{"champion": "가렌", "aliases": [], "hard_counters": [{"name": "티모", "reason": "대표적인 하드 카운터. 맹독 다트(E)가 패시브 발동을 방해하며, 결정타로 달려가도 티모의 신속한 이동(W) 이동 속도에 카이팅을 당한다. 실명 다트(Q)에 결정타가 씹힐 수 있는 것도 문제. 버섯이라도 밟으면 킬 각까지 잡힌다. 갱에 취약한 티모 특성상 정글이 오면 따기는 쉽지만 그전에 피 관리하기가 너무 빡센 것이 문제. 라인전이 터지지 않았다면 중후반부까지는 사이드에서는 우세해지지만, 티모가 16레벨을 찍으면 온 협곡이 DMZ가 되어 버리기 때문에 딱히 가렌의 캐리력이 앞선다고 보기도 힘들다. 그나마 다행인 점은 시즌 14부터 바론 둥지에 공허 유충이 생겨서 정글러가 상체에 영향력을 쏟을 근거가 생겼다는 점. 라인을 당기고 제어 와드와 렌즈로 강가 버섯을 닦아놓은 후 버섯 다 지웠다고 정글러에게 어필하면 웬만해서는 킬 냄새 맡고 와 준다."}, {"name": "베인", "reason": "하드 카운터. 카이팅용 스킬인 구르기(Q)와 밀쳐내는 스킬인 선고(E), 은신을 제공하는 결전의 시간(R)으로 인해 접근이 매우 힘들다. 게다가 위의 퀸, 티모 등의 챔피언들은 아이템이 뜰수록 가렌의 탱킹력을 뚫어내기 힘들고 접근도 꽤나 편해지기 때문에 갈수록 할 만해지나, 베인의 은화살(W)의 고정 피해로 인해 탱킹력도 쉽게 뚫린다."}, {"name": "모데카이저", "reason": "이 분야의 끝판왕. 모데카이저가 스스로 실수를 범하는 것이 아닌 이상 가렌이 모데카이저를 뚫어낼 타이밍이 없다. 가렌만 점화가 있는 경우의 극초반 2렙 싸움 외에는 유리한 구간이 딱히 없다. 라인전에서는 말살(Q)로 중거리 견제를 당하며 선공권도 모데카이저에게 있다. 3레벨 이후로는 근접전, 지속딜 역시 모데카이저의 우위이다. 평타도 주문력 계수를 받고 패시브 장판 퍼뎀도 브루저인 가렌에게 아프다. 또한 죽음의 손아귀(E)에 달린 마관으로 대미지도 아프게 들어오며, 불멸(W)에 궁극기 대미지가 막힐 수도 있다. 세트, 피오라 상대법과 마찬가지로 Q 침묵-궁극기 연계를 활용하자. 1코어 템 차이여도 서로 풀스킬 풀스펠 상태에서 싸울 경우 승리를 장담할 수 없다. 라일라이가 나오면 결정타만 찍고 도망가는 것도 안 된다. 성장성도 모데카이저가 가렌을 능가하고, 중반 이후 사이드 주도권도 당연히 모데카이저에게 있다. AP템의 상향과 진실의 방이 수은장식띠를 무시하게 되면서 극상성이 되어버렸다."}, {"name": "볼리베어", "reason": "현재 패치에서 가렌이 가장 크게 고전하는 하드 카운터. 리메이크 이후 상성이 완전히 역전되었다. 볼리베어의 패시브 때문에 가렌의 패시브가 무력화되며, 다리우스, 트런들 다음으로 압도적인 맞딜 능력을 보유한 탓에 초중반 구간에는 이기기 힘들다. 볼리베어의 Q를 W로 막을 수 있지만 그렇게 되면 E스킬과 W스킬을 생으로 맞게 되고, 아무리 가렌 W에 피해 감소가 있다지만 워낙 계수가 높고 더럽게 아픈 스킬이라 매우 위협적이다. 반피 상태에서 킬 각을 본다고 해도 딜 계산을 잘하는 볼리베어라면 궁극기로 가렌의 궁극기를 버틴 후 W의 회복으로 모든 것을 원점으로 돌린 후 가렌을 그대로 찢는다. 궁극기가 포탑까지 무력화시키는 통에 초중반 딜교를 패배했다면 그대로 상대 정글러와 다이브가 들어오는 점도 위협적이다. 물론 어떻게든 게임을 후반까지 끌고 가서 치감템까지 뽑았다면 가렌이 더 유리해지긴 하나 그 후반까지 끌고 갈 시간에 탑은 터져 있을 가능성이 높다."}, {"name": "트린다미어", "reason": "하드 카운터. 침묵이 걸려도 치명타가 터지는 평타는 강력하며 심판으로 시작되는 딜교환도 치명타가 연속으로 터지기라도 하면 오히려 가렌이 밀린다. 무엇보다 가렌의 데마시아의 정의(R)는 피가 낮은 적을 마무리하는 스킬인데 트린다미어의 궁극기는 가렌의 궁극기를 무의미하게 만들어 버린다. 불사의 분노(R)는 CC기에 걸린 상태에서도 사용할 수 있어서 Q-R 콤보도 소용없다. 그래도 궁이 서로 있는 것보다는 서로 없는 것이 나으므로, 죽지 않고 궁 교환을 할 수 있는 상황이 나온다면 하는 것이 킬 각 방지에 좋다. 그리고 기동력의 차이로 추노는 절대 불가능하고 라인전 주도권은 물론 스플릿 주도권도 항상 트린다미어에게 있다. 탱커에 대항할 수단이 전혀 없는 챔피언이라 판금 장화나 파수꾼의 갑옷 같은 아이템을 사면 이길 수도 있지만, 탱 가렌의 밸류가 그렇게 좋지 않아 좋은 선택은 아니다. 상대할 자신이 없다면 탈진을 드는 것도 나쁘지 않다."}], "general_counters": ["카르마", "럼블", "애니비아", "오로라", "나르", "바루스", "라이즈", "케넨", "제이스", "트위스티드 페이트", "다리우스", "세트", "카밀", "트런들", "케일", "요릭", "판테온"]}
{"champion": "갈리오", "aliases": [], "hard_counters": [{"name": "레넥톤", "reason": "만나면 닷지를 해야 되는 하드 카운터. 미드 레넥톤은 보기가 드물지만 마주치기라도 한다면 상당히 힘든 상대다. 라인전이 강한 챔피언들이 넘쳐나는 탑 라인 먹이사슬 최상위권의 강자로 군림하고 있는 챔피언이기 때문에 갈리오는 레넥톤을 상대로의 라인전이 매우 힘들다. AD 챔피언이기에 레넥톤의 궁극기 피해를 빼면 갈리오의 마법 보호막에 영향을 받지 않으며 분노 50 이상의 무자비한 포식자(W)는 갈리오의 보호막까지 완전히 부숴버린다. 그나마 유통기한이 심하다는 점이 위안. 미드 레넥톤이 사실상 사장된 프로씬에서도 미드 레넥톤이 갈리오를 카운터 칠 목적으로 종종 기용될 정도의 하드 카운터이다."}, {"name": "클레드", "reason": "레넥톤보다 더 어려운 하드 카운터. 레넥톤은 따위로 치부해 버리는 더 강력한 라인전, 대인전 수행 능력과 초반부터 미친 듯한 폭딜과 높은 체력 때문에 라인전은 절대 이길 수 없다. 갱을 불러도 정글 챔피언이 클레드와 상성이 안 좋다면 갱승까지 당할 수 있다. 마법 보호막에 영향을 받는 스킬이 단 하나도 없는 순수 물리 딜러인 건 덤. 갈리오의 특기인 궁극기 로밍도 맞궁 로밍으로 대항이 가능하고, 전투력은 당연히 클레드가 더 높기에 무엇을 하든 답이 없다. 라인전 때 최대한 사리고, 후반을 바라보는 것이 최선."}, {"name": "베인(미드)", "reason": "기본적으로 재빠른 기동성을 갖고 있어 갈리오의 스킬이 닿지 않으며, 어떻게 점멸 유무를 활용하여 닿는다 한들 선고 하나만 배분해주면 모든 시도가 무위로 돌아간다. 그나마 전장의 돌풍은 맞힐 만하지만 체력 회복 아이템을 구비하기 때문에 1틱만 맞아주고 가볍게 피해 갈리오를 때리다 보면 원상복구 되어 있으며 아무리 갈리오가 튼튼하다 해도 은화살 앞에선 모든 게 무의미해진다. 여기에 베인이 정화나 수은을 사들고 오면 그때는 베인이 앞구르기를 쓴 게 아닌 이상 베인 말고 다른 대상을 노리도록 하자. 갈리오는 시간이 지날수록 베인을 전면전으로 이기는 것이 거의 불가능에 가깝지만, 베인이 하이퍼캐리 원딜이긴 해도 사거리가 짧아 팀원 의존도가 매우 높기 때문에 갈리오가 CC기를 걸어주면 아군이 포커싱하는 식으로 운용하는 것이 좋다. 물론 게임 수준이 높지 않다면 그냥 밴하는 것이 마음 편하다. 솔랭에서 갈리오 상대로 간간이 미드 베인이 기용되기도 할 정도로 답이 없는 상성이다."}, {"name": "모르가나(서폿)", "reason": "서포터 갈리오의 하드 카운터. 칠흑의 방패(E)에 갈리오의 모든 CC기가 막힌다. 갈리오가 진입하는 데 성공해도 모르가나는 속박을 먹이고 튀면 그만이다. 그나마 미드에서 볼 일은 거의 없고, 칠흑의 방패(E)의 쿨타임이 매우 길기 때문에 약간이나마 모르가나에게 위협을 줄 기회는 온다."}], "general_counters": ["요네", "리븐", "아트록스", "세트", "카밀", "올라프", "문도 박사", "모데카이저", "루시안", "아크샨", "암베사", "벨코즈", "제라스", "제이스", "조이", "애니비아", "아우렐리온 솔", "탈리야", "흐웨이", "카시오페아"]}
{"champion": "갱플랭크", "aliases": ["갱플"], "hard_counters": [{"name": "럼블", "reason": "그 만기퇴소조차도 상대하기 꺼리는 극상성이다. 비록 럼블의 연이은 너프로 옛날만큼 힘든 상성은 아니나 초반이 부실한 갱플랭크는 럼블이 적당히 열 올려놓고 무지성으로 맞다이해도 밀리며, 과열 상태에서 공속 버프까지 받은 럼블은 화약통 싸움에서도 강력하다. 럼블이 비교적 취약한 1~2렙 구간에 화약통 견제로 라인 주도권을 강하게 가져오지 않는 한 매우 쉽지 않은 상대이며, 3레벨까지 작살로 파밍만 하면 변수도 사라진다. 원거리 견제력과 카이팅 능력도 갱플 못지않게 좋고, 하드 CC기가 없는 럼블을 상대로는 W의 밸류가 급감하고, 점화까지 동원하면 회복도 힘들어진다. 게다가 이 녀석은 메이지 챔피언 주제에 노코스트인지라 첫 귀환 전까지 정말 지옥을 경험하게 되고, 갱플이 라인전에서 조금 밀리는 순간 한타 기여도도 럼블이 압도적으로 우세에 있다. 본인이 만기퇴소만큼 잘할 자신이 없다면 닷지하는 것이 좋은 상성이다."}, {"name": "럼블", "reason": "그 만기퇴소조차도 상대하기 꺼리는 극상성이다. 비록 럼블의 연이은 너프로 옛날만큼 힘든 상성은 아니나 초반이 부실한 갱플랭크는 럼블이 적당히 열 올려놓고 무지성으로 맞다이해도 밀리며, 과열 상태에서 공속 버프까지 받은 럼블은 화약통 싸움에서도 강력하다. 럼블이 비교적 취약한 1~2렙 구간에 화약통 견제로 라인 주도권을 강하게 가져오지 않는 한 매우 쉽지 않은 상대이며, 3레벨까지 작살로 파밍만 하면 변수도 사라진다. 원거리 견제력과 카이팅 능력도 갱플 못지않게 좋고, 하드 CC기가 없는 럼블을 상대로는 W의 밸류가 급감하고, 점화까지 동원하면 회복도 힘들어진다. 게다가 이 녀석은 메이지 챔피언 주제에 노코스트인지라 첫 귀환 전까지 정말 지옥을 경험하게 되고, 갱플이 라인전에서 조금 밀리는 순간 한타 기여도도 럼블이 압도적으로 우세에 있다. 본인이 만기퇴소만큼 잘할 자신이 없다면 닷지하는 것이 좋은 상성이다."}, {"name": "카시오페아", "reason": "하드 카운터. 궁극기를 귤로 해제할 수는 있지만 평타로 화약통 견제를 어렵게 하는 데다가 무엇보다 카시오페아의 폭딜이 유지력이 그리 좋지 않은 갱플에게 쥐약이다. 협상(Q)으로 딜교를 하기엔 카시의 쌍독니(E)의 사거리와 동일해서 딜교로 승부를 보겠다는 것도 꿈 깨야 한다."}], "general_counters": ["우르곳", "베인", "루시안", "칼리스타", "라이즈", "요릭", "제이스", "케일", "아크샨", "아지르", "쉬바나", "제드", "아트록스", "올라프", "문도 박사", "초가스", "오공", "리븐", "렝가", "이렐리아", "자르반 4세", "클레드", "트린다미어", "트런들", "사일러스", "크산테", "신 짜오", "야스오", "녹턴", "모데카이저"]}
{"champion": "그라가스", "aliases": ["그라", "글가"], "hard_counters": [], "general_counters": ["아트록스", "다리우스", "올라프", "우르곳", "일라오이", "문도 박사", "럼블", "크산테", "갈리오", "나르", "룰루", "르블랑", "베인", "뽀삐", "마오카이", "모르가나", "세주아니", "신지드", "아리", "아무무", "오른", "초가스", "하이머딩거"]}
{"champion": "그레이브즈", "aliases": ["그브"], "hard_counters": [], "general_counters": ["니달리", "엘리스", "마스터 이", "판테온", "킨드레드"]}
{"champion": "그웬", "aliases": [], "hard_counters": [{"name": "트런들", "reason": "초중후반을 막론하고 동성장 시 대인전에서 승리가 불가능하다. 진압으로 마법 저항력까지 뺏어가며, 기둥으로 퇴로가 막히는 등 여러모로 힘들다."}, {"name": "우르곳", "reason": "그웬 장인이라면 모두가 인정하는 카운터. 극초반 맞딜은 그웬이 유리한 구간이 존재하지만 원거리 vs 근거리 특성상 우르곳이 상대법만 숙지하고 있다면 그웬이 유리한 타이밍을 활용하기 힘들다. 또한 어찌어찌 초반에 이득을 보더라도 우르곳이 W를 마스터한 9레벨 이후부턴 성공적으로 붙어도 딜 교환에서 손해를 보고 우르곳의 딜링이 완성되는 13레벨부터 높은 체력 비례 피해와 끊임없이 돌아오는 패시브로 인한 지속 폭딜로 경멸을 맞을 때마다 순식간에 300원이 된다. 이를 의식해 E를 아끼거나 딜교에 소극적이 되면 라인이 밀려 포탑 골드를 뜯기는 가불기에 걸리는 상성"}, {"name": "트린다미어", "reason": "극상성. 상술한 그웬보다 대인전이 강력한 챔피언에도 해당된다. 초반부터 분노만 쌓으면 그웬을 능가하는 대인전 능력에 피의 갈망(Q)을 통한 좀비 같은 유지력, 6렙 이후에는 불사의 분노(R)로 최소한의 변수마저 차단한다. 순혈 평타 딜러라 신성한 안개로 막아내어 이득을 볼 만한 스킬이 없다는 것도 문제이며 조롱의 외침(W)은 즉발이라 이미 슬로우에 걸려버렸다면 신성한 안개를 써도 의미가 없다. 한마디로 맞딜은 맞딜대로 밀리는데 유지력도 밀리고 스킬 상성조차 안 좋다. 그나마 탈진을 채용하고 닌탑과 파수꾼의 갑옷 등의 아이템을 우선적으로 올리면 솔킬을 따일 위험은 줄어들지만, 트린다미어 입장에서는 굳이 싸워주지 않고 철거만 뜯으며 골드 격차를 벌리면 그만이고 막상 이런 식으로 초중반을 버틴다 해도 후반전조차 이길 수 없기 때문에 그웬 입장에서는 웬만한 브루저들보다도 더욱 최악의 상대."}], "general_counters": ["볼리베어", "가렌", "리븐", "다리우스", "세트", "신 짜오", "판테온", "클레드", "아칼리", "티모", "잭스", "피오라", "잭스", "마스터 이", "스몰더", "블라디미르", "렝가", "워윅", "우디르", "이렐리아", "스웨인", "라이즈"]}
{"champion": "나르", "aliases": [], "hard_counters": [{"name": "나서스", "reason": "나르의 초반 견제력은 약한 편이기 때문에 초반부터 나서스를 말려놓기가 힘들고, 시간이 지나 나서스의 레벨과 스택이 오르면 오를수록 나서스가 Q 피흡으로 회복하는 양이 올라가 유의미한 피해를 입히기 힘들어진다. 나서스를 말려보겠다고 치감칼 같은 아이템을 두르는 순간부터 알아서 말리는 꼴이 되며, 나서스의 쇠약(W)은 미니 나르는 물론이고 메가 나르에게도 상당히 치명적으로 작용한다. 이동 속도를 대폭 낮추는 것은 물론이고, 미니 나르의 최대 강점인 카이팅을 원천봉쇄하는 것이 가능하기 때문에 폴짝(E)으로 거리를 벌려도 곧 추격당하기 십상이다. 심지어 폴짝(E)의 1레벨 쿨은 22초인 반면, 쇠약(W) 쿨타임이 15초로 서로 스킬이 빠지면 오히려 나르가 뒤에서 사려야 한다. 정직하게 스택을 쌓는 나서스도 말려놓기 힘든데 나서스가 콩콩이에 E를 선마하는 식으로 나오면 오히려 초반 라인전 상성이 역으로 뒤집히며 나르의 저열한 스펙으로는 나서스의 E 견제를 절대 버티지 못한다. 게다가 최근 여러 패치로 인해 나서스 입장에서도 미니언 하나하나에 목숨을 걸지 않는 데다가 대포 미니언만 잘 챙겨놔도 10분에 150스택을 기본으로 쌓는 것이 가능하기 때문에 자체 유지력이 전무한 나르 입장에서 E 스킬을 통해 견제와 라인 푸시를 동시에 해내는 나서스를 막을 방법이 없다. 메가 나르 상태에서 근접전을 유도해도 초반에나 먹힐 뿐, 중반부터 메가 나르로 스택이 쌓이고 아이템이 나온 나서스에게 근접전을 신청하는 것은 죽고 싶다고 들어가는 꼴이다."}, {"name": "AD 케넨", "reason": "기본적으로 케넨은 나르에 비해 견제력이 좋기 때문에 라인전 단계에서 까다로운 상대다. 하지만 마법공학 로켓 벨트와 존야의 모래시계 등을 올리는 AP 케넨의 경우, 한타 기여도는 강력할지언정 1:1 상황에서 지속딜이 안정적이지 않기에 갈수록 나르에게 운영 주도권을 내주게 되므로 상성상 불리하다고 할 정도는 아니다. 그런데 몰락한 왕의 검 등을 올려 스플릿에 특화되게 키우는 AD 케넨은 이야기가 다르다. 대부분의 1:1 강자를 상대로 스플릿을 억제 혹은 오히려 역으로 압박을 넣을 수 있는 나르이지만 AD 케넨에게는 게임이 끝나도록 절대 1:1을 이길 수 없다. 한타는 탱템을 두르는 나르가 좋으니 지속적으로 대규모 교전을 유도해야 한다. 리그 오브 레전드 2017 시즌 월드 챔피언십 우승팀인 Samsung Galaxy의 Cuvee는 이러한 사실을 이용하여 SK telecom T1과의 결승에서 나르를 상대로 AD 케넨을 사용, 게임 내내 주도권을 꽉 쥐고 승리를 견인했다."}, {"name": "사일러스", "reason": "사일러스는 유지력이 좋아 메가 나르 시 현자타임을 가지는 나르 상대로 딜교환에서 우위를 점한다. 미니 나르는 짤짤이로 사일러스를 견제할 수 있지만, 메가 나르로 변하게 되면 사슬 후려치기와 국왕시해자, 억압으로 순식간에 딜교를 당하고 변신이 풀리고 난 뒤 확인해보면 체력 상황이 역전되어 있는 기막힌 상황이 벌어질 수도 있다. 이보다 더 심각한 건 궁극기 복사인데 나르의 궁극기는 말파이트에 뒤처지지 않을 만큼 S급의 성능을 자랑하지만, 분노 관리와 점프를 통한 진입 등 여러 가지 각을 재며 어렵게 풀어나가야 하는 나르와는 달리 사일러스는 나르에게 강탈만 사용하면 아무 제약 없이 우수한 돌진기와 템 상황에 따라 벨트의 힘까지 빌어 더욱 쉽고 빠르게 시전 가능하다. 나르 입장에선 이런 말도 안 되는 도둑놈이 다 있나 싶을 만큼 최악의 상대 중 하나다."}, {"name": "올라프", "reason": "극상성. 역류를 1렙에 맞을 경우에 킬 각을 내주고 망할 가능성이 높을뿐더러, 슝슝이 빠진 상태에서 역류를 맞으면 점멸+유체화+라그나로크=킬이다. 메가 나르나 미니 나르나 거기서 거기다. 메가 나르의 궁극기 스턴과 미니 나르의 슬로우를 라그나로크 하나로 무시하는 게 가능하다. 궁극기가 없을 경우엔 메가 나르인 상태로 들어가주자."}, {"name": "이렐리아", "reason": "밴 대상 1순위 최악의 하드 카운터. 1스턴=1킬. 나르의 폭딜 콤보인 ERWQ도 W만 누르고 있으면 버텨낸다. 야스오는 조합에 탱 손실이 오지만 이렐은 그런 게 없다. 밴하는 걸 까먹었으면 닷지하자."}], "general_counters": ["말파이트", "제이스", "하이머딩거", "빅토르", "아크샨", "카시오페아", "트린다미어", "문도 박사", "소라카", "요릭", "렝가", "오른", "아칼리", "야스오", "오공", "요네", "우르곳", "자르반 4세", "알리스타", "워윅", "클레드", "트위스티드 페이트", "마스터 이", "녹턴", "블라디미르", "신짜오", "탐 켄치"]}
{"champion": "나미", "aliases": [], "hard_counters": [{"name": "블리츠크랭크", "reason": "블리츠크랭크에게 끌리면 변변찮은 탈출기도 없는 데다가 아군 커버 사거리를 벗어나기 때문에 나미뿐만 아니라 아군 원딜 또한 매우 위험해진다. 라인전 이후에도 시야를 장악하는 나미를 순식간에 물어서 죽이는 데 능하다."}, {"name": "루시안", "reason": "아군으로 만나면 최고의 파트너지만, 적으로 만나게 되면 최악의 카운터로 돌변한다. 나미의 물방울은 루시안이 앞대쉬를 써도 맞히기 어려울 정도로 악명이 높기 때문에 루시안 숙련도가 있는 유저들은 앞대쉬 각이 나오면 물방울의 변수 하나만 제외시켜서 그냥 대쉬를 박고 무빙으로 물방울을 피한다(...) 그렇게 해서 물방울이 빗나간 나미 입장에선 루시안 쪽이 서포터든 루시안이든 한쪽이 매우 크게 실수하는 동시에 아군 원딜과 협력해서 딜찍누로 루시안을 먼저 녹이는 방법밖에 없다. 문제는 일반적인 솔랭에서 루시안이 숙련도가 부족하지 않은 이상 물방울을 피하는 경우는 많아도 후자는 드물다는 것이며 이마저도 유틸폿이 대동된 경우의 루시안이면 드레이븐과 칼리스타 못지않거나 그 이상의 데미지가 극초반부터 나오기 때문에 보통 나미 쪽의 원딜 내지 나미 본인이 상대 루시안+유틸폿의 딜찍누로 먼저 터진다."}, {"name": "사미라", "reason": "나미 최악의 하드 카운터. 투사체 방어의 지속 시간은 짧지만 딱 그것뿐이다. 한쪽 방향에서 오는 스킬만 막는 바람 장막이나 불굴과 달리 전 방향에서 오는 투사체를 막아버린다. 때문에 운 없으면 E-W에 물감옥과 해일 모두 막히는 불상사가 생길 수도 있다. 높은 기동력과 뛰어난 근접전 능력으로 가뜩이나 투사체 증발 스킬을 가진 것도 까다로운데 순식간에 접근해서 나미를 회쳐버리기까지 한다. 게다가 사미라는 원딜이라서 마주칠 일도 매우 잦고 주로 함께 픽되는 서포터들도 나미의 카운터인 그랩류, 돌진류 탱포터들이다. 거기에 나미가 저항할 시간을 줄이는 CC기 연계 패시브는 덤이다. 한 마디로 밴 대상 1순위다."}], "general_counters": ["갈리오", "노틸러스", "레오나", "블리츠크랭크", "파이크", "아무무", "마오카이", "판테온", "럭스", "벨코즈", "브랜드", "자이라", "제라스", "하이머딩거", "유미", "이즈리얼", "칼리스타", "드레이븐", "야스오"]}
{"champion": "나서스", "aliases": [], "hard_counters": [{"name": "가렌", "reason": "15시즌 기준 극 카운터 액시옴, 고정 피해에 피해 증폭 효과 적용 등의 패치를 받고 난 후에는 가렌이 반피에 점화를 걸고 데마시아의 정의(R)를 찍어도 나서스가 죽을 정도의 딜이 나와 안 그래도 불리했던 상성이 더욱 극상성이 돼버렸다. 스택을 얼마나 쌓든 침묵을 걸고 그 사이에 나서스의 체력을 반피 정도로 깎기만 해도 바로 끔살나기 때문. 원거리 견제기가 없고 자체 CC기가 침묵밖에 없어서 파밍하는 나서스를 두들겨 패긴 힘들지만, 가렌은 심판으로 살살 긁은 후 혼자서도 다이브를 칠 수 있기 때문에 대놓고 배를 째다가는 그대로 갈라질 수 있다. 쇠약의 둔화도 결정타로 그냥 풀어버린다. 어떻게든 가렌을 말려놓고 성장 차이를 냈다고 쳐도 가렌은 치감이 달려있는 점화를 주로 채용하는 데다가 잃은 체력 비례 고정 피해인 데마시아의 정의로 낮은 체력에서 패시브로 줄타기하는 나서스를 지워버릴 수 있어 매우 거슬린다. 2024년 8월 각종 대회에서 나서스가 유행하자 가렌으로 카운터 치는 전략이 연구되고 있다. 아무래도 미드에서 기어나오기 때문인 것이 큰데, 나서스의 대표적인 카운터 챔피언들은 주로 탑에 얼굴을 들이미는 챔피언인 데다가 억지로 미드에 세우기에는 하자가 많고, 가렌 말고 레넥톤을 세우면 되지 않냐 하는 의견도 있지만 초반에 레넥톤과 어떻게든 다이브를 쳐서 말려놓아도 정작 레넥톤은 중후반에 알아서 썩는 반면 나서스는 망하더라도 뛰어난 유지력과 궁극기의 탱킹력, 현재 쌍포메타를 억제할 수 있는 쇠약으로 한타에서 어느 정도 활약이 가능하기 때문인 듯. 그러므로 대회에서 나서스의 초반을 억제할 수 있고, 쇠약의 영향을 덜 받으며, 한타에서 나서스의 존재감을 지워버릴 수 있는 챔피언은 현재로서는 가렌이 유일하다."}, {"name": "아트록스", "reason": "나서스는 이동 속도가 350으로 최상위권이긴 하지만 이동기가 없고 히트박스가 크기 때문에 다르킨의 검을 피하기가 쉽지 않고, 지옥사슬에 맞는 순간 이어지는 추가 콤보를 피할 방법이 없다. E 선마로 라인전을 풀려고 해도 아트록스는 노코스트 챔피언이라 도방+재바를 들고 오면 금방 회복해 버리고, 대포라도 먹으려고 앞으로 나가는 순간 다르킨의 검에 찢기기 때문에 어떤 빌드를 타건 스택을 제대로 쌓는 게 굉장히 어려우며 스택이 없는 나서스는 중반을 넘기는 순간 존재 가치가 없어진다. 아트록스가 나온다면 쿨하게 닷지해 버리는 게 정신 건강에 이로울 정도. 그나마 8~9레벨에 광휘의 검+신속신+덤불 조끼가 나올 때까지 킬을 주지 않으며 악착같이 버티다가 갱을 받으면 그 뒤부터는 숨통이 트인다."}], "general_counters": ["일라오이", "볼리베어", "렝가", "레넥톤", "다리우스", "클레드", "잭스", "크산테", "갱플랭크", "카밀", "사이온", "라이즈", "오로라", "럼블", "아우렐리온 솔", "신지드", "올라프", "요릭"]}
{"champion": "나피리", "aliases": [], "hard_counters": [{"name": "뽀삐", "reason": "태생부터 튼튼한 탱커라 성장 차이가 어지간히 심하지 않은 이상 원콤은 불가능하며, 굳건한 태세는 나피리의 진입을 확정적으로 차단한다. 사냥개의 추적도 딜레이가 있어 막아내기 여유로운 데다 설령 굳건한 태세가 없어도 수호자의 심판으로 도로 쫓아내 버리거나 용감한 돌진으로 밀어버리기 때문에 나피리 입장에선 답도 없는 극강의 하드 카운터이다. 탱커치고 화력도 강력해 맞딜이 성립되지 않는 건 덤."}, {"name": "이렐리아", "reason": "일명 개장수. 나피리의 무리들은 모든 레벨 구간에서 이렐리아의 칼날 쇄도 한 방에 처치된다. 느려터진 다르킨 단검은 칼날 쇄도로 피해버리고, 혹 맞았더라도 따라 들어오는 무리에게 칼날 쇄도를 타고 체력을 회복하거나 역으로 무리를 징검다리로 삼아 나피리를 노릴 수도 있다. 사냥개의 추적으로 시작하는 나피리의 폭딜 콤보는 저항의 춤으로 한 턴을 쉽게 넘길 수 있고, 사냥개의 추적이 목표에게 정직하게 일자로 들어온다는 점을 이용해 쌍검협무를 맞혀 표식을 만들면 들어오는 무리와 함께 이렐리아의 한 끼 식사가 될 뿐이다. 무리의 부름으로 사냥개들을 더욱 불러봤자 이렐리아 입장에서는 칼날 쇄도를 초기화시키며 스택을 쌓고 체력을 회복시켜줄 포션 그 이상도 이하도 아니다. 후반을 가더라도 몰락한 왕의 검을 위시로 한 템트리를 올리는 이렐리아는 한타에서도, 사이드에서도 나피리를 압도한다. 티어가 두세 단계 이상 차이 나지 않는 한 절대 이길 수 없는 극상성이다."}], "general_counters": ["그라가스", "스카너", "마스터 이", "트런들", "워윅", "벨베스", "그레이브즈", "판테온", "녹턴", "샤코", "헤카림", "피들스틱", "리산드라", "탈리야", "베이가", "카시오페아", "니코", "가렌", "모데카이저", "레넥톤", "클레드", "트린다미어", "럼블", "말자하", "사이온", "나서스", "오로라"]}
{"champion": "노틸러스", "aliases": ["노틸"], "hard_counters": [{"name": "브라움", "reason": "모든 구간에서 상대 승률 45% 내외를 기록하고 있는 극카운터 중의 극카운터로 상성을 간단하게 설명하자면 노틸이 그랩을 쓸 때 브라움이 방패만 들어올려주면 브라움 쪽은 아무런 피해도 입지 않는 반면, 브라움의 패시브로 인해 노틸러스 쪽만 순식간에 역관광 당하는 매우 기막힌 관계다. 노틸러스는 생긴 것과 달리 내구도가 그렇게 뛰어난 편은 아니기 때문에 브라움의 패시브와 포커싱에 상당히 취약하지만 브라움은 자체 내구도가 뛰어나며 방패를 들어올린 채로 그랩을 맞으면 자체 탱킹력 + 불굴(E)의 피해 감소 효과로 인해 체력이 닳지도 않는다. 단순 2대2는 원딜 상성 격차가 극과 극으로 차이가 나지 않는 이상 이기기 거의 불가능하다. 라인전도 상성이 좋지 않은데 한타는 물론이고 각종 교전 밸류조차 패시브로 인해 브라움이 훨씬 높은 편이라 매우 골치 아픈 상대다. 브라움이 선픽으로 나온 상황에서 노틸러스 후픽은 반드시 지양해야 하며 노틸러스를 선픽하면 매우 높은 확률로 튀어나오기 때문에 노틸러스를 선픽할 생각이라면 이 녀석은 반드시 밴하는 것이 정신 건강에 좋다."}, {"name": "시비르", "reason": "원거리 딜러 챔피언들 중 가장 까다로운 상대. 노틸러스가 가진 CC기 따위는 주문 보호막 하나로 간단하게 막아버린다. 덤으로 노틸러스의 CC기를 막는 데 성공하면 일정량의 마나를 회복해 노틸러스의 손해가 더 들어오는 건 덤. Q로 먼저 접근한 뒤 궁극기로 억지로 무는 건 가능하지만 그쯤 되면 호응하기 너무 어려운 위치인데다, 시비르는 궁극기까지 써서 도망가면 그만이다. 사실 시비르는 노틸러스뿐만 아니라 거의 모든 그랩류 서포터를 카운터친다. 서포터 노틸러스인데 상대 바텀 조합이 시비르+모르가나라면 닷지 추천"}, {"name": "레오나", "reason": "프로 레벨에서도 언급되는 대표적인 노틸러스의 카운터. 둘 다 돌진+이니시형 탱폿이지만, 레오나는 기본적인 스탯이 훨씬 좋아서 노틸러스의 여진이 빠진 타이밍에는 그냥 노틸러스한테 스킬을 다 박아서 죽이는 것도 가능하다. 때문에 노틸러스가 레오나를 상대할 때는 매우 신중한 스킬 사용이 요구된다. 딱 하나 무난하게 라인전 페이즈를 넘길 수 있는 방법은 레오나가 노틸러스에게 E를 쓸 때 타이밍을 잘 맞춰서 노틸러스의 그랩을 맞혀서 Q를 못 맞히게 하는 것. 노틸러스의 그랩이 상대를 노틸러스 쪽으로 당겨온 다음에 살짝 튕겨나오는 판정을 이용한 테크닉인데, 이렇게 되면 레오나는 E-Q 콤보를 못 넣는 반면 노틸러스는 Q-E를 넣고 카이팅이 되기 때문에 라인전 딜교에서 우위를 점할 수가 있다. 이 방법은 TL의 코어장전 선수가 본인 유튜브에 자세한 설명을 올려놓았다. # 12시즌 기준으로는 이전에 노블레스 메타가 워낙 오래 지속되었기도 하고, 그 과정에서 레오나가 선공을 들어와도 적절한 상대법이 발견이 되면서 레오나의 궁극기는 연계하지 않으면 헛나가기 쉬운 반면 노틸러스는 궁극기가 확정에 가깝다는 이유와 함께 플레이어에 따라 이 구도에서 노틸러스만이 선공권을 쥐고 있다는 이유로 노틸러스를 더 선호하기도 하나, 기본 스펙 차이가 꽤나 나는데다 레오나의 천공의 검은 미니언이나 지형을 타지 않고 맞딜도 레오나가 타워에 박지 않는 이상에야 매우 강력하기 때문에 레오나 후픽으로 노틸러스를 뽑는 건 선호되지 않는다."}, {"name": "피들스틱", "reason": "상대하기 엄청나게 어렵다. 6레벨 이전에 풍작(W)를 끊을 수 있는 기술이 닻줄 견인(Q)뿐인데, 피들을 끌어 싸움을 열어도 피들이 쫄지 않고 앞으로 가서 원딜과 노틸을 풍작으로 빨아들이면 딜교환에서 무조건 지게 된다. 6레벨 이후에는 궁으로 풍작을 끊을 수 있지만, 피들도 궁이 생겨서 풍작을 끊으면 대놓고 면상궁을 박아 노틸을 녹여버릴 수 있고 한타 기여도도 피들이 밀리지 않는다. 다만 피들 본인도 물몸이라 시야만 잘 잡고 어쩌다 발견하면 즉시 물어서 종잇조각으로 찢어버릴 수 있으니 궁극기를 의식해서 먼저 이니시를 열지 않고 들어온 피들스틱을 받아치는 용도로 쓰면 피들도 곤란하다."}], "general_counters": ["쉔", "알리스타", "잔나", "탐 켄치", "타릭", "렐", "베인", "모르가나", "엘리스", "자야", "이즈리얼"]}
{"champion": "녹턴", "aliases": [], "hard_counters": [], "general_counters": ["아이번", "올라프", "람머스", "스카너", "트런들", "그레이브즈. 아무무"]}
{"champion": "누누와 윌럼프", "aliases": ["누누", "누누와윌럼프"], "hard_counters": [{"name": "트런들", "reason": "예로부터 탱커 담당 일진으로 정평이 난 챔피언으로, 난입을 든다면 도주 자체는 어렵지 않으나 얼음 기둥에 눈덩이가 막히고 절대 영도가 끊기는 것이 치명적이다."}, {"name": "올라프", "reason": "맞딜도 강한데 CC기도 무시해서 도저히 답이 없는 상대이다. 만나면 E-Q-평으로 난입만 터트리고 뒤로 눈덩이를 굴려서 도망치는 것이 상책이다."}], "general_counters": ["엘리스", "바이", "워윅", "오공", "세주아니", "그라가스", "자르반 4세", "자크", "스카너", "아무무", "문도 박사", "카시오페아(미드)", "니코(미드)", "애니비아(미드)", "신지드(미드)", "카사딘(미드)"]}
{"champion": "니달리", "aliases": [], "hard_counters": [{"name": "샤코", "reason": "상당히 성가신 하드 카운터. 니달리가 진입하면 샤코는 바로 깜짝 상자를 설치하거나 속임수로 회피하면 그만이기에 역으로 니달리만 당하게 된다. 그리고 창을 막을 방법이 세 가지나 있기 때문에 창을 맞히기가 매우 힘들다."}], "general_counters": ["리 신", "릴리아", "바이", "신 짜오", "판테온", "누누와 윌럼프", "헤카림", "렉사이", "엘리스"]}
{"champion": "니코", "aliases": [], "hard_counters": [{"name": "제라스", "reason": "하드 카운터. Q의 최대 사거리가 1400이나 되는 것에 비해 니코는 그나마 제일 긴 게 1050인 E밖에 없어서 작정하고 포킹하는 제라스의 견제를 버티기 힘들다. 무작정 들어가자니 E도 구속이라 제라스가 침착하게 스킬로 반격하면 오히려 역관광당할 수도 있다. 다만 제라스도 마나 소모가 꽤 큰 챔피언이고 스킬 하나하나가 전부 논타겟이라 분신을 동원해가며 스킬샷만 잘 피하면 오히려 주도권을 잡는 것도 가능하다. 다만 무난하게 잘 큰 제라스는 R을 시작으로 후반부 중원거리 견제가 상당히 강력하므로 라인전에서 이겼다고 방심하면 안 된다. 어지간히 죽여놓지 않는 이상 초반부터 후반까지 끝없이 신경 써야 하는 상대."}, {"name": "말자하", "reason": "패시브 때문에 주문 방어막을 쓰는 챔피언이라서 니코가 말자하를 일방적으로 갖고 놀 수 있을 것 같지만 실상은 정반대다. 딜링 구조가 말자하 이상으로 매우 단순한 탓에 오히려 대부분은 말자하가 손쉽게 카운터를 잘 치기 때문. 라인전은 공허충을 단순하게 정리할 수 있어서 당연히 니코가 말자하를 압도하지만 진짜 문제는 교전 선택권과 후반 영향력이 말자하에게 있다. 니코는 라인전 콤보가 속박 이후 Q평뿐인데 그냥 패시브로 막아버리면 그만이다. 말자하가 이를 알고서 작정하고 라인 반을 넘지 않고 열심히 푸시에 집중만 한다면 니코가 말자하를 라인전 단계에서 잡기가 정말 까다롭다. 이는 한타나 교전에서도 마찬가지인데 침묵의 문의 사거리가 충분히 길고 쿨타임이 6초라 한타에서 진입해야 하는 니코가 침묵에 걸리면 궁극기의 제압에 맞기에도 쉬워, 일단 말자하의 궁을 맞으면 사망 확정이다. 따라서 말자하는 후반 영향력으로 게임을 터트려버릴 수도 있으며 게임을 길게 가져가지 않는 게 좋다. 결정적으로 라인전 & 교전 & 한타에서든 침묵을 피하는 무빙이 강제된다."}, {"name": "강철의 솔라리 팬던트", "reason": "이 아이템을 채용하는 챔피언들은 니코를 그야말로 엿먹이고 바보로 만들 수 있다. 또한 강철의 솔라리 팬던트는 광역 보호막을 제공해주고 니코가 만들기 좋은 킬 각을 방어막으로 손쉽게 차단할 수 있다. 피해 흡수 효과를 보는 아이템 중에서 가장 효율이 좋기 때문에 궁이나 분신을 쓰면 오히려 니코의 한타 기여도를 대폭 낮추게 되며 상대에게 쉽게 물어뜯고 도와주는 꼴이 된다."}], "general_counters": ["직스", "벨코즈", "럭스", "조이", "제이스", "코르키", "하이머딩거", "제드", "카타리나", "아리", "아크샨", "베이가", "갈리오", "노틸러스", "레오나", "마오카이", "블리츠크랭크", "쓰레쉬", "아무무", "알리스타"]}
{"champion": "닐라", "aliases": [], "hard_counters": [{"name": "제이스", "reason": "딜러 챔피언 중 최악의 하드 카운터. 평타 위주 딜러나 메이지 상대로는 승리의 장막을 이용해 평타를 회피하거나 마법 피해를 줄이는 식으로 어느 정도 대처가 가능하다. 어떻게든 근접하면 닐라가 더 우세하기도 하고. 그런데 제이스는 승리의 장막이 가진 장점들을 교묘히 회피하는 물리 스킬 딜러라 장막의 밸류가 현저히 낮아진다. 특별한 도주기가 없어 진입 자체는 가능하나, 닐라가 진입해봤자 제이스는 굳이 뺄 필요도 없이 풀콤보를 박아주면 닐라는 걸레짝이 된다. 포킹 때문에 체력이 깎인 상태였다면 킬로 이어질 수도 있다."}, {"name": "직스, 카시오페아, 흐웨이 등", "reason": "닐라는 근딜인 만큼 스킬 사거리가 짧기 때문에 아군의 도움이 없는 한 사거리가 긴 챔피언들 상대로 굉장히 무력한 모습을 보인다. 물론 닐라에겐 막강한 이동기 E가 있으니, 스택을 모두 소모하면 돌진 거리 자체는 매우 뛰어나다. 그러나 반대로 상대가 눈 뜨고 급류에 맞아주지 않는 이상 결국엔 뒤에서 계속 맞다 포탑 안에서 물약만 쪽쪽 빨아먹어야 하는 암울한 신세가 되기 마련이고, 아군 서폿의 호응이 없는 상황이라면 그냥 상대 바텀 라이너와 서폿에게 제발 죽여주세요 하며 목을 갖다 바치는 일밖에 되지 않는다. 이들 중 대부분은 스킬을 사용하는 챔피언들이기 때문에 W 스킬이 의미가 없어지는 건 덤."}, {"name": "룰루(서폿)", "reason": "닐라가 애써 들어와도 룰루는 닐라를 지정해 변이 한 번 걸어주면 모든 게 끝난다. 사거리가 워낙 짧아 라인전부터 쉽게 견제당하며 한타에서는 룰루의 모든 스킬과 스펠까지 닐라의 활약을 막아버릴 수 있기 때문에 정말로 악랄하고 짜증 나는 카운터이다. 카밀과 마찬가지로 닐라를 완전히 바보로 만들어버리는 챔피언"}], "general_counters": ["애쉬", "케이틀린", "바루스", "진", "제라스", "벨코즈", "자이라", "밀리오", "잔나", "알리스타", "레나타"]}
{"champion": "다리우스", "aliases": ["다리"], "hard_counters": [{"name": "럼블", "reason": "다리우스가 3렙 전에 끌면 이기고, 못 끌면 진다. 대인전이 밀리지 않는 챔피언과 원거리 견제 챔피언에 모두 포함된다. 럼블은 평타 사거리만 근접일 뿐이지 실질적으로는 사거리 600짜리 화염방사기로 딜하는 원거리 챔피언이나 마찬가지라 모든 스킬이 포획보다 사정거리가 길다. 포획의 사거리는 535이고, 화염방사기의 사거리는 600으로 포획보다 65나 길어서 거리 조절을 빡세게 하는 럼블 유저를 만난다면 쉴 새 없이 유성 짤짤이를 맞아야 하고, W 이속 버프에 둔화&중첩 마방깎까지 거는 작살로 다리우스를 가지고 놀 수가 있으며 아무리 맞딜 강자 다리우스라고 해도 열 관리가 잘된 럼블이 점화를 동원해 맞다이를 하면 이때는 처참히 찢긴다. 다리우스가 무진장 잘 큰 상황이 아니라면 한타 기여도도 럼블이 훨씬 높으며, 빠른 라인 클리어를 바탕으로 스플릿 각도 잘 내주지 않는 편이기 때문에 상당히 어려운 매치업이다. 그러나 거리 조절과 열 관리 실수가 빈번한 저티어의 경우 이때는 포획으로 계속 끌어 킬 각을 잡을 수 있다."}, {"name": "판테온", "reason": "스킬 구성상 다리우스의 스킬셋을 대부분 카운터친다. 방호의 도약과 혜성의 창으로 선공권은 당연히 판테온에게 있으며 포획으로 끌고 오더라도 방패 돌격으로 모두 씹어버리며 유유히 빠져나가거나 역공을 가할 수도 있다. 어쩌다 5중첩 다 쌓는 데 성공하더라도 단두대로 마무리하려다 방패 돌격에 단두대가 막힐 수도 있다. 무엇보다도 판테온의 궁극기를 통한 로밍을 막을 수 없다는 것이 가장 뼈아프며, 라인전을 어찌어찌 사리면서 코어템을 구비해놓으면 그 높은 전투 지속력으로 판테온을 맞딜로 찍어누를 순 있지만, 그때쯤이면 판테온 또한 다리우스를 상대하려 하지도 않을 것이기에 판테온의 로밍을 막지 못하고 질질 끌려다니다가 게임이 터지는 경우도 적지 않다. 다만 판테온은 라이엇의 집중 견제 탓에 체급이 완벽하게 하락된 상태고, 반대로 다리우스는 라이엇의 편애에 너프를 피해서 체급이 깡패 수준이라, 초반에 사고가 나지 않을 경우 시간은 다리우스의 편이다."}, {"name": "문도 박사", "reason": "하드 카운터. 문도의 리메이크 이후 상성이 완전히 뒤바뀌어버린 케이스이다. 라인전은 당연히 다리우스가 비교도 안 되게 유리하지만, 승률 자체는 위에 서술된 웬만한 카운터들 이상으로 낮은 하드 카운터이다. 그 이유는 간단한데, 문도의 패시브 때문. 다리우스 딜교의 핵심인 포획(E)이 봉쇄되기 때문에 멀리서 사리면서 뼈톱(Q)으로 미니언을 먹는 문도에게 큰 압박을 가할 수가 없다. 패시브가 빠진 틈에 유체화를 이용해 붙으려고 해도 문도가 맞 유체화를 들고 오면 잡는 게 아예 불가능해진다. 결국 CS 차이를 조금 내는 것 이외에 큰 이득을 취할 수 없고, 그렇게 무난하게 서로 1코어가 뜬 이후부터는 오히려 문도가 먼저 강심 평타로 딜교를 거는 그림이 나온다. 패시브와 뼈톱의 둔화 때문에 강심 스택만 쌓고 도망가는 문도를 잡을 수가 없다. 2코어 이후 타이밍까지 무난히 흘러갔다면 게임이 끝날 때까지 영원히 문도를 억제할 수 없다. 다른 라인에서 문도를 잘 잡아주길 기도해야 한다. 당겨지는 라인에서 최대한 프리징하고 문도가 대포 미니언에 q를 쓰는 것을 몸으로 막는 정도가 격차를 벌릴 수 있는 유일한 방법이며, 상대가 바보 같은 실수를 하지 않는 이상 초반에 터트리는 것은 거의 불가능하다. 이처럼 초반은 어차피 문도가 싸워주려 하지 않아 억누르기 힘들고 후반 1대1 대면에서는 이기기 힘들기 때문에 로밍과 오브젝트 교전으로 문도가 성장하기 전에 먼저 이득을 보고 게임을 굳히는 것이 중요하다."}, {"name": "제이스", "reason": "다리우스 최악의 하드 카운터다. 다리우스를 상대하는 제이스는 거의 난입을 들고 오기 때문에 거리를 붙어도 해머폼 E 스킬로 밀쳐내거나 난입을 발동 혹은 가속관문 키고 이속 증가 폼 변화를 하면 이속 증가 해머폼 Q스킬에 달린 둔화 등 라인전에서 다리우스의 스펠을 이용한 한방 킬 각만 흘려내면 다리우스 입장에서는 킬 각을 잡기가 매우 어렵다. 난입 제이스 상대로 스펠을 이용해 킬 각을 잡으려고 해도 다른 챔프들에 비해 킬을 따기가 굉장히 어렵다. 제이스 상대론 5스택을 쌓기 쉽지도 않고 어중간하게 딜교했다가는 유지력이 부족한 다리우스는 다음 턴에 제이스에게 킬 각이 잡힌다. 이렇게 라인전도 힘든데 텔포를 든 상대로 라인전을 반반 혹은 열세로 보낸 다리우스는 게임 내내 제이스에 비해 장점은 없고 단점만 많은 즉 다리우스의 단점은 지독하게 후벼파고 장점은 없앨 수 있는 픽이다."}, {"name": "케넨", "reason": "원거리 챔프고 다리우스가 접근한다 쳐도 케넨은 도주기인 E 스킬이 있고 패시브에 기절이 있기 때문에 다리우스와 거리를 쉽게 벌리며 견제를 넣을 수 있는 챔프다. 한타 기여도도 케넨이 훨씬 우위고 하지만 제이스나 베인 같은 극상성들보단 쉬운데 상대법이라면 케넨이 E 스킬로 도망가려고 할 때나 스턴을 박으려고 할 때 다리우스가 W나 E 스킬에 달린 둔화와 그랩 에어본으로 선입력 혹은 후입력을 하면 케넨은 도주를 하려고 해도 둔화가 그래도 남아있어 다리우스 상대로 벗어나기 어렵다. 게다가 다리우스를 상대하는 케넨은 베인이나 퀸처럼 똑같이 유체화 점멸을 들고 오는 게 아니라 텔포 점멸을 들고 오기 때문에 킬 각 잡는 건 제이스나 베인보다는 쉽다."}, {"name": "라이즈", "reason": "뚜벅이들 상대로 매우 강한 모습을 보여주는 라이즈인 만큼 다리우스도 예외는 아니다. 사거리 차이도 큰데 과부하의 이동 속도 증가와 난입이 합쳐지면 유체화를 써도 따라가기 힘들고 룬 감옥에 달려 있는 둔화, 전이 시 속박은 안 그래도 버티기 힘든 라인전을 지옥으로 만든다. 단독으로 학살을 맞추기가 거의 불가능에 가깝기 때문에 유지력으로 승부를 볼 수도 없는데다 라인 클리어도 빨라서 순식간에 라인을 지워버리고 궁극기로 로밍을 가거나 유충, 전령 싸움에 합류가 가능하기 때문에 매우 불리하다. 성장성도 좋아서 동성장이라면 한타는 물론이고 사이드 1:1도 크게 밀리지 않으며 성장이 밀리면 그냥 처음부터 끝까지 잡아먹힌다. 하지만 라이즈도 어쨌든 메이지기에 유지력이 전무한 건 마찬가지이므로 점멸이나 유체화를 소모해서라도 포획을 맞추기만 하면 큰 이득을 볼 수 있기에 방심한 틈을 타 한 방 먹여줄 수는 있다. 아니면 적극적으로 정글러를 불러 말려죽이는 것도 가능. 반대로 말하면 라이즈 쪽에서 실수를 하거나 정글러가 부르는 대로 와주는 게 아닌 이상 1대1로 이기는 건 동실력 기준 거의 불가능하다."}], "general_counters": ["판테온", "요릭", "볼리베어", "오공", "올라프", "잭스", "트런들", "클레드", "녹턴", "마스터 이", "케인(다르킨 학살자)", "베인", "하이머딩거", "스몰더", "트위스티드 페이트", "아크샨", "오로라", "말파이트"]}
{"champion": "다이애나", "aliases": [], "hard_counters": [{"name": "애니비아", "reason": "매우 껄끄럽다. 다이애나가 들어오면 Q-R-E-W로 매우 아프게 딜을 넣을 수 있다. 물론 애니비아는 최악의 기동성을 자랑하는 뚜벅이이기 때문에 Q만 피하면 다이애나의 폭딜로 녹일 수 있다."}, {"name": "갈리오", "reason": "마법 쉴드 덕분에 딜이 안 박히고 라인전에서 날아오는 Q 견제에 몸도 사리기 바쁘며 최대 체력 비례라 튼튼한 다이애나 입장에선 불리하다. 그리고 들어가자니 W로 도발을 먹이고 이어지는 콤보로 다이애나가 당한다. W만 켜고 있어도 막강해지는 탱킹력은 덤이고 광역으로 도발을 먹일 수가 있어 한타 기여도도 다이애나 못지않게 강력하다. 궁극기를 동반한 아군 보호와 로밍력은 더 답이 없다. 방법이 아예 없는 건 아니나, 이기기 엄청나게 힘들다."}, {"name": "럼블", "reason": "애니비아보다 더 어려운 상대. 럼블의 화염방사기 견제는 애니비아의 견제보다 더 피하기 힘들고 더 아프게 들어가며 다이애나가 돌진해도 럼블은 W의 실드로 간단히 대응할 수 있다. 한타 기여도도 럼블이 우위에 있다."}, {"name": "레넥톤", "reason": "하드 카운터. 미드 레넥톤이 대회든 솔랭이든 가끔 보이는데 다이애나 입장에서는 정말 지옥 그 자체다. QE로 들어가도 풀콤보를 맞으면 다이애나는 걸레짝이 되는데 레넥톤은 멀쩡하고, 분노 W는 다이애나의 보호막을 깨뜨리기까지 하는 극상성이다. 그래도 워낙에 유통기한이 심한 레넥톤이라 초중반만 견디면 된다. 한타와 시간은 다이애나의 편이다."}, {"name": "뽀삐", "reason": "돌진형 챔프를 카운터치는 데 특화된 챔프로, 다이애나의 진입을 차단할 수 있는 스킬이 무려 3개씩이나 돼서 한타에서도 다이애나를 마킹할 수 있는 데다가 탱커라 딜이 잘 박히지도 않는데 탱커치곤 맞다이도 센 편이다. 매우 성가신 하드 카운터"}], "general_counters": ["나서스", "모데카이저", "클레드", "카시오페아", "에코", "니코", "벡스", "리산드라", "탈리야", "카사딘", "블라디미르", "워윅", "마스터 이", "올라프", "킨드레드", "자르반 4세", "샤코", "문도 박사", "마오카이"]}
{"champion": "드레이븐", "aliases": ["드븐"], "hard_counters": [{"name": "사미라", "reason": "원딜 중 드레이븐의 하드 카운터. 원형 검무가 야스오의 바람 장막과 똑같이 회전 도끼를 없애버린다. 문제는 바람 장막은 우회할 수라도 있지만 원형 검무는 어떤 각에서도 도끼를 지워버리기 때문에 진짜 최악의 하드 카운터라는 것. 특히 칼날비를 들었을 경우 도끼 2개가 한 번에 그냥 사라지는 경우가 많다. 다만 원형 검무가 빠지면 상성이 바뀌는데, 평타 맞딜은 드레이븐이 훨씬 센 데다 비켜서라로 지옥불 난사를 쉽게 끊어버릴 수 있기 때문이다."}, {"name": "야스오", "reason": "사미라와 마찬가지로 바람 장막으로 회전 도끼를 없애버려서 드레이븐을 다른 원거리 딜러보다 더욱 최하급 원거리 딜러로 만들어 버리는 최악의 카운터로 뽑힌다. 게다가 Q 3타의 회오리와 최후의 숨결로 교전에서 드레이븐을 저격할 수도 있다. 만약 바텀 라인전에서 원딜로 야스오를 만난다면 닷지를 추천한다."}, {"name": "스웨인(서폿)", "reason": "사거리가 길고 도끼 파밍을 봉쇄하는 절대 극상성. 우선 모든 스킬이 드레이븐보다 대체로 사거리부터 한 수 위이다. 비켜서라만이 유일하게 사거리가 긴 편이지만 쿨타임이 길고 맞춘 후 반드시 평타를 연계해야 하기 때문에 결국 드레이븐은 다시 550의 사거리 내에서 스웨인보다 더 짧은 사거리 내로 들어와야 해서 불리해진다. 특히 사거리가 훨씬 긴 속박명령이 더 악랄한데, 다른 그랩 챔피언들과는 달리 미니언을 통과하기 때문에 라인전에서 도끼가 떨어지는 위치에 던지기만 하면 드레이븐은 딜이 약해지거나 그랩을 맞아야 하는 지옥의 이지선다에 놓인다. 이 때문에 라인전에 선 미니언을 통과하는 그랩을 쓸 수 없는 그랩 서포터들보다 더 위협적인 하드 카운터로 꼽힌다. 다만 속박명령만 안 맞아주면 이만큼 쉬운 챔피언이 별로 없는데다, 투사체의 속도도 느릿해 미니언과 같이 묶일 것 같다면 상황을 봐서 앞무빙을 치는 것도 추천한다."}, {"name": "마오카이(서폿)", "reason": "상황에 따라서는 상당한 하드 카운터로, 속박+밀쳐내기 때문에 도끼 유지를 매우 어렵게 만든다. 특히 뒤틀린 전진은 대상 지정 불가인지라 비켜서라로 밀쳐내는 것도 안 된다."}], "general_counters": ["진", "바루스", "애쉬", "케이틀린", "세나", "제라스", "브라움", "노틸러스", "레오나", "블리츠크랭크"]}
{"champion": "라이즈", "aliases": [], "hard_counters": [{"name": "아우렐리온 솔", "reason": "아우렐리온 솔이 약한 초반엔 라이즈도 약하며, 후반으로 갈수록 압도적인 사거리의 광역기, 라이즈와 비교해도 꿀리지 않는 DPS 등 라이즈가 아무리 커도 아우렐리온 솔은 그 이상의 한타 기여도를 보여준다. 사이드로 해결하려고 해도 아우렐리온 솔 역시 자체적으로 본대 합류 스킬이 있어서 사이드로도 해결이 안 된다."}, {"name": "애니비아", "reason": "그야말로 지옥을 경험할 수 있다. 6레벨 전에는 그냥저냥 무난한 라인전으로 풀어나갈 수 있지만 6레벨 후 애니비아가 미니언 앞에 떡하니 버티고만 있어도 라이즈는 파밍도 못하며, 실수로 애니비아의 궁극기 벽 기절 콤보를 맞게 되면 뚜벅이인 라이즈는 점멸이 없으면 그대로 죽는 데다가 어찌저찌 극후반까지 끌어서 아이템을 뽑아온다고 하더라도 교전 사거리가 압도적으로 차이가 나서 라이즈는 아무것도 못하고 죽게 된다."}, {"name": "말자하", "reason": "침묵과 제압 두 글자만으로 설명이 끝난다. 통계 사이트 기준으로 라이즈에게 늘 상대 승률 우위를 점하며, E-Q로 공허충을 쉽게 지울 수 있지만 그것뿐이다. 말자하가 라인 클리어에 시동을 걸 때마다 E-Q를 난사하자니 서로 마나 소모만 심해지고, 말자하는 추가로 재앙의 환상까지 같이 옮길 수 있으니 라인전 딜교를 이길래야 이길 수가 없다. 진정한 문제는 한타인데, 침묵 한 번 맞으면 2초 동안 미니언만도 못한 신세가 되는 라이즈에게 쿨이 짧은 침묵 난사는 라이즈의 혈압을 제대로 올린다. 그렇다고 인파이팅을 하려고 앞포지션을 잡는 순간 황천의 손아귀가 꽂히고 신나게 두들겨 맞을 일만 남았기에 값비싼 수은 장식띠를 올려 눈물을 머금고 왕귀 타이밍을 스스로 늦춰야 한다. 말자하의 후반 캐리력 역시 라이즈보다 약할 뿐이지 메이지 챔피언 평균은 상회하기에 진지하게 닷지를 고려해야 할 상대이다."}], "general_counters": ["아지르", "카시오페아", "멜", "벨코즈", "제라스", "빅토르", "아리", "탈론", "제드", "야스오", "이렐리아", "잭스", "렝가", "갈리오", "초가스", "문도 박사", "마오카이"]}
{"champion": "라칸", "aliases": [], "hard_counters": [{"name": "뽀삐", "reason": "필밴 1순위. 라칸의 핵심 스킬인 화려한 등장과 전쟁무도가 굳건한 태세에 얄짤없이 막혀버리기에 한타 때 라칸이나 뽀삐의 아군 주변에서 굳건한 태세만 써줘도 라칸은 말 그대로 아무것도 못한다. 매혹의 질주마저 뽀삐가 수호자의 심판으로 바로 날려버리면 그만이다."}, {"name": "카시오페아(바텀)", "reason": "만날 경우 정말 답이 없다. 고정 CC기 판정을 가진 독기의 늪의 존재 덕분에 카시오페아 앞에서 라칸의 진입은 이니시가 아닌 조공에 가까운 수준으로 역할을 대부분 봉쇄하기 때문이다. 한타에서 궁극기를 켜고 이니시를 시도하면 늪에 빠져서 궁점멸이나 R-W를 못 쓴다. 게다가 그 사이에 몸이 녹아져서 아군에게 E를 써서 탈출하려고 하지만 늪이어서 그것도 불가능하다. 또한 라칸과 어울리는 원딜들 대부분이 카시오페아에게 열세인 것도 마이너스 요소이다."}], "general_counters": ["니코", "렐", "나미", "룰루", "럭스", "브랜드", "잔나", "샤코", "피들스틱", "모르가나", "마오카이", "베이가", "레오나", "바드", "유미", "자야", "베인"]}
{"champion": "람머스", "aliases": [], "hard_counters": [{"name": "아무무", "reason": "최악의 하드 카운터. 만나면 닷지하는 게 답이다. 아무무의 모든 스킬은 마법 피해여서 아무무는 지속딜로 람머스를 녹여버리면 그만이고 아무무가 AP로 간다면 람머스는 아무무의 궁극기에 그대로 폭사해 버릴 수도 있다. 람머스가 진입만 하면 아무무는 람머스를 CC기로 봉쇄해 버릴 수 있고, 한타 기여도도 아무무가 높은 것도 덤."}, {"name": "릴리아", "reason": "대표적인 람머스의 하드 카운터인 정글 챔피언으로 AP 챔피언에다가 정글링 속도에서 차이도 심하게 나며 최대 체력 비례 대미지로 탱커를 잘 잡는 릴리아에게 붙어서 계속 싸워봤자 람머스만 손해이며 릴리아는 기본적으로 기본 이동 속도가 상당히 빠르기에 달라붙기도 매우 힘들어서 릴리아가 도발 거리를 안 내주며 Q로 카이팅만 해도 피가 상당히 까인다."}], "general_counters": ["누누와 윌럼프", "트런들", "올라프", "자크", "그라가스", "문도 박사", "카서스", "모데카이저(탑)", "모르가나(서폿)"]}
{"champion": "럭스", "aliases": [], "hard_counters": [{"name": "블리츠크랭크", "reason": "전통의 카운터. 실드 파괴가 있기 전과 여진 럭스가 유행할 때에도 카운터였는데 9.14 패치로 실드 파괴가 생긴 후에는 더욱 어려워진 상대. 원딜이 끌리면 그래도 속박을 넣든 딜을 넣든 저항을 해볼 순 있으나 이것도 어디까지나 다른 딜포터들에 비해서 그럴 여지가 있는 정도에 불과하며 아예 본인이 끌리면 점멸이 없으면 속박 한번 넣고만 채 그대로 끔살당한다. 미드 럭스 입장에서도 끌릴 때 대처법이 점멸밖에 없는 건 매한가지고 높은 양의 쉴드를 궁극기로 간단히 파훼해버린다는 점에서 거슬린다. 존야의 모래시계를 포기하고 밴시의 장막 가는 게 더 추천된다."}, {"name": "야스오(미드)", "reason": "하드 카운터. 만나면 닷지를 고려해 봐야 한다. 궁극기를 제외하면 모든 스킬이 장막에 막히며, 장막이 없더라도 스킬을 질풍검으로 스킬을 피하고 럭스에게 쉽게 접근할 수 있다. 그렇다고 야스오가 성장성에서 밀리는 것도 아니므로 야스오가 웬만한 비정상이 아니고서야 게임 내내 이길 수 없다고 봐도 무방하다. 럭스가 작정하고 버티면 킬은 당하지는 않겠지만, 바람 장막을 통해 스킬로 파밍하려는 것조차 막아버리기 때문에 CS 차이는 불가피하다. 어렵지만 상대하는 법은 평타로 꾸준히 야스오의 패시브 방어막을 빼주면서 미니언과 동시에 야스오에게 E의 공격을 주는 것이 좋고 Q의 경우엔 장막이 빠지지 않았다면 사용하지 않는 게 좋다. E의 범위를 이용해 예측 장막으로 장막 판정보다 살짝 앞에 두고 딜을 넣는 방법이 있으나 E 범위 하향으로 조금 어려운 방법이 된다. Q 역시 야스오가 미니언을 타고 갈 예측 지점을 향해 쏘아서 딜교 시도하는 것도 좋으나 Q 맞고 바로 장막으로 대응하면 장막을 빙글 돌아 평타 혹은 E를 던지려다 거리를 내주어 딜교 실패로 이어지니 조심하는 게 좋다. 이러나 저러나 럭스에게 야스오는 최악의 카운터 중 하나다. 그나마 받아먹기라도 가능한 상성이란 점에서 다이브까지 밥 먹듯 해 버릴 수 있는 이렐리아보다 라인전은 낫지만 마주치지만 않으면 속박이든 뭐든 던져서 보조할 여지 정도는 주는 이렐리아와 달리 야스오는 라인전 이후까지도 장막으로 럭스가 아예 뭘 하지도 못하게 하기에 럭스의 1순위 밴 대상이다."}, {"name": "이렐리아(미드)", "reason": "라인킬 확률은 6:4, 승률도 밀리는 하드 카운터. 우선 럭스의 느릿느릿한 스킬들을 칼날 쇄도로 피하거나 미니언의 피가 충분하다면 저항의 춤으로 버티기까지 하고, 쌍검 협무나 선봉진격검을 맞았을 경우에는 곧바로 돌격해 평타질을 해대는데, 이게 럭스 같은 물몸들이 감당할 수 있는 딜이 아니다. 라인전을 버티고 후반 가면 포킹이 가능한 럭스가 조금 유리해지겠지만 혹여라도 이렐리아 팀에 말파이트 같은 이니시에이터가 있으면 이니시에이팅과 함께 선봉진격검을 맞게 되고 이럴 경우에는 후반을 보는 플레이도 불가능하게 된다. 다만 전술하였듯이 이런 최악의 상황이 아니면 의외로 반반을 갈 만하다. 최대한 아군 미니언에게서 떨어져서 스킬로만 파밍하자. 이렐리아는 앞의 다른 하드 카운터와는 다르게 스킬 파밍조차 방해할 만한 수단을 가진 챔프는 아니다. 다만 이렐리아 특성상 럭스가 실수로 솔킬을 한두 번이라도 내주면 6렙 이후부턴 진짜로 스킬로밖에 파밍을 못하게 된다. 6렙 이후 다이브 능력이 워낙 막강하기 때문이다. 이로 인해 대표적인 미드 럭스 장인인 여왕럭스는 야스오 상대로도 잘 들지 않는 탈진을 이렐리아 상대로는 거의 무조건 들고, 이로도 모자라 정글이 봐주어야 한다고까지 말한다. 다른 카운터를 상대할 때는 텔이나 회복을 유동성 있게 들고, 정글이 조금 덜 봐줘도 괜찮다는 장인조차도 이렐리아 상대로는 탈진을 들면서도 정글의 도움이 필수라고 말할 정도의 엄청난 카운터인 것이다."}], "general_counters": ["레오나", "아무무", "파이크", "노틸러스", "제라스", "벨코즈", "니코", "바루스", "진", "칼리스타", "칼리스타", "시비르", "루시안", "이즈리얼", "카사딘", "제드", "피즈", "카타리나", "르블랑", "벨코즈", "제라스", "아리"]}
{"champion": "럼블", "aliases": [], "hard_counters": [{"name": "일라오이", "reason": "치감이 없다면 E에 끌린 상태에서는 과열 풀콤보를 박아도 그렇다 할 이득을 보기 힘들다. 일라오이가 1렙에 W를 찍었을 경우 이때는 럼블이 맞다이에서 밀리므로 작살과 Q유성 짤짤이를 통한 아웃복싱형 견제로 갉아먹고, 1렙에 Q를 찍었다면 죽일 듯이 딜교를 걸어서 이득을 봐두자. 이후 6레벨 이전에 심리전으로 E를 최대한 피한 뒤에 점화를 동원한 과열 풀콤보로 쇼부를 치자. 6레벨 이전까지 충분히 격차를 벌리지 않는다면 이후는 일라오이가 드러눕기만 해도 불리해지며, 이때부터는 정글 교전과 로밍에 취약한 것을 이용하자. 럼블의 빠른 라인 클리어로 스플릿 각을 최대한 주지 않으며 한타 차이로 게임을 풀어나간다면 그나마 승산이 있을 것이다. 물론 일라오이 상대법을 잘 알고 있는 유저라면 닷지할 정도의 카운터는 아니다."}, {"name": "판테온", "reason": "판테온 리워크 전에는 럼블이 뭘 해도 판테온이 1대1로는 절대 이길 수 없을 정도로 럼블에게 유리한 극상성이었지만, 리워크 이후로는 판테온의 Q 견제가 이전보다 럼블에게 훨씬 아프게 들어가게 된 반면 럼블의 모든 주력기는 판테온의 E에 도트 딜이 다 막히기 때문에 상성이 역전된 케이스. 유일한 이길 수 있는 방법은 점멸으로 뒤로 가서 때리는 것이다. 상대가 바로 반응하는 것이 아니라면 등 뒤로 가서 화염방사기의 틱 대미지와 과열 평타 한 대는 쑤셔박을 수 있어서, 스펠 차이가 매우 중요한 매치업."}, {"name": "마스터 이", "reason": "맞라인에서는 거의 볼 일이 없지만 챔피언 상성으로 봤을 때는 최악의 상대. 마주치는 순간 도주도 반격도 불가능해 아군의 도움 없이는 그냥 죽는 수밖에 없다."}, {"name": "베이가", "reason": "럼블에게 이만한 하드 카운터는 보기 드물다. 베이가는 자신보다 교전 거리가 짧으며 지평선(E)를 흘릴 수 없는 챔피언에게 우위를 점하는데, 럼블은 이에 모두 해당되며 근접 챔피언이면서 이동기도 부실한 럼블에게 베이가는 쥐약이다. 지평선에 갇히면 할 수 있는 거라곤 이퀄라이저로 발악하는 것뿐이다. 어찌어찌 반반을 갈 수는 있더라도 문제는 후반 포텐셜마저 베이가가 좋을 수밖에 없다는 점. 라인전 최약체인 베이가에게 라인전을 반드시 이겨서 스노우볼링을 해야만 하는 럼블에겐 치명적이다. 이러한 문제점들은 단순히 챔피언과 라인전 간의 상성뿐만 아니라 럼블의 운영마저 틀어막기도 한다. 같은 라인이 아니어도 문제인데 정글의 경우 베이가를 갱킹하기란 쉽지 않으며, 탑이나 미드에서 라인이 다를 경우 럼블이 유리한 라인전도 베이가를 불러내서 스노우볼링을 억제까지 할 정도이다. 한타에서도 역시 럼블의 캐리력은 중요한데 베이가 역시 지평선으로 카운터를 친다는 점도 마이너스 요소이다."}], "general_counters": ["리븐", "요릭", "클레드", "트린다미어", "탐 켄치", "애니비아", "오로라", "아리"]}
{"champion": "레나타 글라스크", "aliases": ["레나타", "레나타글라스크"], "hard_counters": [{"name": "제라스", "reason": "레나타의 사거리가 ‘상대적으로’ 길다 한들 결국 평타 한정이고, 제라스는 평타 자체가 길진 않지만 스킬들의 사거리가 E를 제외한다면 리그 오브 레전드 내에서 열 손가락 안에 든다. 게임 시작부터 끝까지 아무것도 못 하고 맞기만 해야 한다. CC기에 취약한 제라스의 단점조차 아득한 사거리 차이로 상쇄된다."}, {"name": "자이라", "reason": "레나타보다 확연히 사거리가 긴 견제형 서포터인 만큼 레나타 입장에서 라인전이 숨막히게 괴로워지고, 식물이 레나타의 궁 활용에 큰 방해가 된다. 기본적으로 레나타의 궁극기는 대부분의 소환수를 중립몹으로 판정하므로 레나타의 궁극기에 걸린 적들은 주변에 다른 아군 챔피언이 있을 경우 소환물을 무시하고 아군 챔피언부터 공격 대상으로 삼지만, 어째서인지 자이라의 식물만은 챔피언으로 판정되는지 다른 소환물처럼 무시되지 않고 챔피언과 동등한 우선순위로 공격받기 때문이다. 한타 상황에서는 자이라도 사방팔방에 식물을 피워놓기 마련이라, 기껏 레나타가 궁대박을 터트려도 그다지 길지 않은 레나타의 궁극기 지속 시간 동안 자이라의 식물이나 제초하고 있는 상황이 심심찮게 벌어진다. 더구나 식물은 레나타의 궁극기에 맞아도 다른 챔피언은 공격할지언정 절대로 자이라 본체만은 공격하지 않는 묘한 판정을 가지고 있기도 하다."}, {"name": "벨코즈", "reason": "리그 오브 레전드에서 포킹으로는 한 손에 꼽히는 벨코즈인만큼 레나타에게는 매우 어려운 상대다. 멀찍이 떨어진 채로 꾸준히 포킹을 날리는 벨코즈를 상대로 레나타는 계속 얻어맞는 것 외에 방법이 없다. 어쩌다 거리가 좁혀져도 지각 붕괴 한 방이면 다시 멀어지고, 체력 상태에 따라 킬 각까지 잡힐 수 있다. 제라스와 마찬가지로 CC기에 약한 벨코즈지만, 레나타는 멀리 떨어진 벨코즈에게 CC기를 맞히는 게 매우 어렵기에 게임 내내 고통받는다."}], "general_counters": ["질리언", "카르마", "질리언", "소나", "소라카", "유미", "밀리오", "바드", "브라움", "시비르", "제리", "야스오", "직스"]}
{"champion": "레넥톤", "aliases": ["레넥"], "hard_counters": [{"name": "럼블", "reason": "사실상 레넥톤을 라인전 능력으로 압도할 수 있는 몇 안 되는 하드 카운터이다. 아무리 라인전 강자 레넥톤이라지만 점화를 든 럼블 앞에서는 살살 기어야 한다. 원거리 대응 능력이 낮은 레넥톤은 작살 포킹과 Q 끝 사거리로 유성 짤짤이를 넣는 럼블의 카이팅에 아무런 반항이 불가능하며 레넥톤이 주로 힘을 쓰는 3~4렙 기준 맞다이 최강자도 럼블이다. 어지간한 카이팅은 더 큰 손해로 이어지며 별다른 생각 없이 맞딜을 걸었다간 순식간에 황천길로 갈 수 있다. 점화를 켜는 순간 치감으로 Q 피흡도 줄어들며 과열 상태의 지속딜 능력 또한 레넥톤을 능가한다. 초반 오브젝트 교전이나 정글 싸움 능력도 이퀄라이저 한 방에 끝내버리며 처참한 후반 기대치를 가진 레넥톤에 비해 럼블은 한타 특화형 메이지이기 때문에 초반에 갱을 부르는 것 말고는 할 수 있는 게 없다."}, {"name": "바루스", "reason": "숨겨진 하드 카운터로, 픽률은 처참할 정도로 낮지만 만나게 되면 지옥을 경험하게 된다. 레넥톤의 자르고 토막내기보다 훨씬 긴 거리에서 견제가 들어오는데다, 역병화살이 체력 비례 대미지라 체력 탱킹을 하는 레넥톤 입장에서는 너무나 아프게 박힌다. 6렙 이후 2단 돌진과 궁극기를 통한 맞다이가 레넥톤이 만들 수 있는 유일한 변수인데, 바루스가 곧바로 맞궁으로 대처한 후 유체화를 키고 카이팅을 하기 시작하면 그냥 아무것도 못한다. 심지어 바루스 입장에서는 그냥 대놓고 이겨 먹겠다는 식으로 탱템을 두르는 선택지도 존재하기 때문에, 유통기한이 극심한 레넥톤 입장에서 이렇게 라인전을 압살당하면 아무리 상대 팀 밸런스가 안 좋다 한들 존재감이 0에 수렴해버린다. 그나마 갱 호응 자체는 좋은 편이라 정글이 탑을 계속 봐주면 어찌저찌 활로가 뚫린다."}, {"name": "퀸", "reason": "최악의 전통 하드 카운터. 원거리 딜러인 퀸은 근접 전사인 레넥톤을 상대로 사거리 우위부터 가져가며, 레넥톤이 E로 진입해도 바로 E를 쓰면 레넥톤은 둔화와 넉백을 먹고 밀려나는 반면 퀸은 이속 증가로 유유히 거리를 벌리는 건 물론 역으로 킬각을 잡을 수도 있다. 심지어 사이드에 특화되어있어 게임 내내 마주쳐야 하는 상성이라는 점까지 게임 시작부터 끝까지 하드 카운터. 한타 위주로 게임하게 된다면 그래도 다른 때에 비해 할 만한 편이지만, 대부분의 퀸은 레넥톤 상대로 정화나 유체화를 들고 돌풍을 가는 경우가 대부분이기에 말만 쉽다. 이후 돌풍이 없어지고 레넥톤도 암살자 아이템을 하나 둘 섞으며 그나마 녹일 만은 해졌으나, 여전히 퀸이 반응이나 판단 미스로 미끄러지지만 않으면 이기기가 불가능에 가까운 상성이다."}], "general_counters": ["가렌", "일라오이", "클레드", "워윅", "볼리베어", "케인(다르킨 학살자)", "나르", "케넨", "티모", "베인", "아지르", "르블랑", "아리", "애니비아", "오리아나", "하이머딩거", "탈리야", "뽀삐", "말파이트", "초가스", "자크", "오른"]}
{"champion": "레오나", "aliases": [], "hard_counters": [{"name": "브라움", "reason": "레오나 최악의 상대 1. 이론적으로나 실전으로나 말도 안 되는 상대다. 레오나가 창과 같은 존재라면, 브라움은 그냥 말 그대로 방패다. 스킬셋 자체가 진입형 챔피언을 받아치는 데에 특화되어 있기 때문에 레오나 같은 뒤가 없는 진입형 챔피언 상대로 매우 강한 모습을 보여준다. 아무리 상대 원딜에게 천공의 검(E)을 꽂아도 브라움이 내가 지킨다(W)로 원딜에게 붙으면서 불굴(E)을 사용하면 결과적으로 상대 원딜이 아닌 브라움을 물어버리는 꼴이 된다. 그렇다고 브라움을 물자니 불굴(E) 하나 때문에 아군 원딜의 딜은 전부 차단되며, 브라움 자체가 쉽게 녹아내리는 픽도 아니다. 2대2 교전 과정에서 아군 원딜이 브라움의 뇌진탕 펀치(P)라도 맞고 기절에 걸리면 결국엔 브라움 쪽이 승기를 잡는다. 게다가 6레벨 이후, 레오나의 천공의 검(E)은 브라움의 빙하 균열(R)에 막히기 때문에 더더욱 까다롭다. 시간이 지나면 지날수록 한타 기여도 부분이나 원딜 보호 부분이나 모두 브라움이 레오나보다 압도적인 상위 호환의 모습을 보이기 때문에 매우 까다로운 픽. 그나마 브라움은 극도로 수동적인 챔피언이라 상대를 뚫어내기는 어렵지만 뚫어야 하는 쪽이 레오나라 말마따나 브라움이 어지간히 못하는 거 아닌 이상 레오나가 브라움을 이길 구석이 안 보인다."}, {"name": "타릭", "reason": "레오나 최악의 상대 2. 타릭은 본인과 원딜 양쪽 모두를 통해 황홀한 강타(E)를 쏠 수 있다 보니 누구를 물어도 레오나가 카운터 맞기 일쑤고 대치가 길어질수록 회복과 보호막을 가진 타릭이 좀 더 유리하다. 게다가 타릭은 근접 전투형 서포터 중 맞딜 능력이 최상위권이라 꽝 붙는 싸움도 결코 무시할 수 없다. 심지어 발동을 알아보기 쉬운 레오나의 궁은 레오나가 아무리 각을 잘 봐도 타릭이 카운터치기 쉽다. 그나마 타릭의 궁 쿨이 2분을 넘어간다는 점이 위안이지만 궁극기의 레벨이 올라가는 11레벨 이후부터는 길지 않은 쿨타임을 갖게 되어 선이니시를 걸기 어려워진다. 사실 타릭 자체가 브라움처럼 스킬셋 자체가 진입형 챔피언을 받아치는 데에 특화되어 있기 때문에 존재만으로도 레오나의 진입을 망설이게 한다."}], "general_counters": ["아무무", "마오카이", "샤코", "알리스타", "탐 켄치", "렐", "세트", "모르가나", "뽀삐", "잔나", "시비르", "베인", "루시안", "이즈리얼", "트리스타나", "제리"]}
{"champion": "렉사이", "aliases": [], "hard_counters": [{"name": "녹턴", "reason": "대표적인 렉사이의 카운터. 녹턴은 렉사이 이상으로 초반에 강력한 챔피언이기에 렉사이가 진입하면 녹턴은 곧바로 E로 공포를 걸고 맞다이를 할 수가 있어 오히려 렉사이 쪽만 손해를 보게 되며, 렉사이의 돌출을 녹턴의 어둠의 장막으로 막아버릴 수도 있기에 상대하기 힘들다. 다만 초반 갱킹은 자유롭게 벽을 넘어다닐 수 있고 접근기인 매복 E가 있는 렉사이가 더 우수하기 때문에 녹턴의 갱킹이 급격히 강해지는 6렙 이전에 라인을 터뜨려서 최대한의 이득을 봐야 한다. 한타에서는 매우 특이한 관계를 보이는데, 안 그래도 시야 좁아지는 렉사이의 매복이 만약 녹턴의 궁까지 맞는다면 렉사이는 눈 없는 제르사이 그 자체가 되어 갈팡질팡하기 십상이다. 그때는 진동 감지를 이용해서 녹턴의 노림수에 맞대응하도록 하자. 한타의 안정성은 렉사이가 조금 더 좋다. 만약 극딜 빌드를 타고 선공 W를 성공한다면 렉사이가 녹턴을 맞딜로 이기긴 하나 그러면 유통기한이 너무 심하여 잘 시도되지 않는다."}, {"name": "엘리스", "reason": "굉장히 까다로운 상대. 땅굴을 써서 진입하면 바로 고치를 맞고 엘리스의 풀콤보를 맞게 되며, 기본 스탯이 낮은 렉사이가 엘리스의 풀콤을 맞으면 대부분 흑백 화면을 보게 될 것이다. 게다가 엘리스의 초반 라인 개입력은 렉사이와 견줄 만하므로 갱킹으로도 승부를 보기는 힘들다. 물론 렉사이는 엘리스보다 정글링이 아주 조금 더 빠르고 정글 루트를 더 자유롭게 정할 수 있기에 굳이 엘리스와 1대1을 걸 이유는 없으니 맵을 넓게 써가며 풀어가보자."}, {"name": "카서스", "reason": "카서스의 정글링 속도는 렉사이보다 뛰어나다고 평가받으며, 땅굴이 빠지면 뚜벅이인 렉사이에게 고통의 벽을 깔고 황폐화를 맞히는 건 어렵지 않은 일이라 렉사이 단독으로 카서스를 견제하는 것은 굉장히 힘들다. 그렇기에 카서스의 전성기가 찾아오기 전에 빨리빨리 갱킹으로 스노우볼을 굴리고 라이너들과 함께 카서스를 견제해야 하는데, 카서스의 입장에서는 렉사이의 동선을 파악해서 반대 동선으로 정글링을 하면 그만이지만 렉사이는 카서스가 6렙을 찍기 전에 라이너가 카서스의 궁 개입을 감수하고도 주도권을 잡을 정도로 차이를 벌려놔야 하므로 렉사이의 부담감이 훨씬 높은 상성이다. 카서스 3코어 전까지는 렉사이가 탈진 맞아도 이기고. 이후로는 못 이긴다. 참고하자. 첫 귀환에 곡괭이를 뽑아온 뒤 카서스의 동선을 예상해서 적극적으로 카정 동선을 짜주면 좋다. 상대 챔피언이 대부분 스노우볼 챔피언이라면 아예 렉사이도 극딜템을 가서 게임 시작부터 끝까지 일단 물면 죽인다! 는 마인드로 해도 좋다."}], "general_counters": ["올라프", "워윅", "볼리베어", "트런들", "스카너", "가렌", "레넥톤", "잭스", "다리우스", "모데카이저", "클레드", "트린다미어"]}
{"champion": "렐", "aliases": [], "hard_counters": [{"name": "알리스타", "reason": "박치기 하나로 렐의 진입과 인게임 플레이를 완벽하게 제한시켜 버리는 것이 가능하다. 혹은 진입하게 내버려 두고 분쇄로 띄우고 포탑으로 토스해 버릴 수도 있다. 능력치를 빼앗겨도 스탯보다는 궁극기의 피해 감소로 탱킹을 하는 챔피언이라 큰 영향을 받지 않고, 알리스타의 패시브로 체력 유지에서부터 차이가 난다. 단, 렐이 탑승 W로 알리스타의 박치기를 넘겨버린다면 박치기가 끊겨버린다. 알리스타가 렐을 밀어내는 것보다 렐이 알리스타를 뒤로 넘기는 게 먼저 적용되는 판정 때문인데, 이를 이용해 렐을 쳐 내려는 알리스타를 역관광시킬 수 있다. 물론 이런 잡기술을 감안해도 알리스타는 렐의 진입을 차단하기 쉬워서 라인전 이후 교전과 한타에서 영향력의 차이가 난다."}, {"name": "브라움", "reason": "렐 진입을 막는 부류 중에서 가장 까다로운 상대. 브라움은 들어오는 챔피언을 받아치는 데에는 어떤 서포터보다 뛰어나며 뒤가 없는 렐의 특성상 진입하면 뇌진탕 펀치에 골로 가기 딱 좋다. 능력치를 빼앗겨도 불굴 덕분에 탱킹이 가능하다는 것도 문제."}, {"name": "하이머딩거", "reason": "능력치가 매우 부실하고 이동기 없는 뚜벅이라서 렐이 한 번 물면 잡아낼 수는 있으나, 그놈의 포탑이 문제이다. 진입하는 순간 CH-2 전자폭풍 수류탄(E)으로 기절을 맞기 딱 좋고, 포탑의 집중 포화를 받고 되려 체력 손해를 크게 입을 수 있다. 진입하기 전부터 포탑과 포킹 견제를 맞고 체력 손실이 누적되어 함부로 들어가기 어려운 것도 악재이다. 갱을 불러도 반격 능력이 매우 좋다 보니 되려 역킬각도 잡혀서 서포터로 상대할 경우 굉장히 까다로운 카운터."}], "general_counters": ["뽀삐", "잔나", "쓰레쉬", "타릭", "레나타 글라스크", "샤코", "이즈리얼", "이즈리얼", "칼리스타", "루시안"]}
{"champion": "렝가", "aliases": [], "hard_counters": [{"name": "다리우스", "reason": "밴 대상 1순위 및 최악의 하드 카운터, 강화 W는 포획으로 끌려가는 걸 해제하는 것이 불가능하며, 포획에 끌리기라도 하는 순간 5스택 궁각을 내주게 된다. 렝가의 리워크 직후에는 강화 W가 1.5초 CC기 면역+이속 증가라 당기기를 무시하고 후퇴할 수 있어서 렝가가 유리했으나, 단순히 수은 효과로 변경된 이후에는 이속 증가를 감안해도 절대 도망갈 수 없게 되었다. 6레벨 이후에도 정신 못 차리고 다리우스 앞에서 재롱이라도 부렸다간 포획에 끌려간 뒤 그 자리에서 뚝배기가 깨지게 될 것이다. 렝가 장인들도 탑에서든 정글에서든 반드시 밴하는 챔피언이다."}, {"name": "말파이트", "reason": "밴 대상 2순위 및 슈퍼 초하드 카운터. 닷지하는 것이 매우 좋으며 정신건강에 이롭다. 극초반엔 말파이트가 마나 소모가 심하고 방어력이 낮아 잘하면 찍어 누를 수 있지만 그런 가능성은 매우 희박하다. 렝가가 암살하려 부쉬에서 튀어나오면 E로 공속을 느리게 만들어 버리고 오히려 말파이트에게 W로 싸대기 세례를 당하면 오히려 렝가의 피만 너덜너덜해진다. 가장 힘든 건 말파이트의 첫 귀환인데 렝가의 Q가 평타 판정이라 판금 장화만 사줘도 렝가의 딜은 씨알도 안 박혀서 계속 E를 맞히거나 앞에서 깝죽거려서 귀환을 늦춰야 하는데 만약에 말파의 심기를 잘못 건드리면 말파 특유의 궁을 동반한 점화 폭딜 콤보를 박으면 역으로 렝가가 녹아버려서 그때부턴 정말 큰일난다. 렝가가 물관템을 올려봤자 원딜 입에서도 더럽다는 소리가 나오는 말파이트의 탱킹력은 아이템으로 뚫을 수 있는 수준이 아니다. 그렇다고 게임을 풀려고 렝가 혼자 사이드를 간다면 오히려 말파는 얼씨구나 하며 팀에 합류하여 강제로 한타를 열 것이다. 알다시피 한타도 말파가 매우 유리한 건 덤."}, {"name": "오공", "reason": "거듭된 너프로 체급이 낮아져 6레벨 이전까지는 들어가도 분신 전사로 피해를 흘려내는 것 말고는 렝가에게 아쉬울 것이 많이 없어졌다. 하지만 분신 전사의 어그로 핑퐁 능력은 매우 막강하여 렝가도 6레벨 이전에 이득을 취하기가 어려운 편이고, 별 다른 사고 없이 6레벨 이후에 접어드는 경우가 많은데 그 순간 상성 관계가 180도 뒤집혀 하드 카운터로 돌변한다. 무난히 6레벨을 찍고 광휘의 검을 구매한 오공은 회전격을 위시한 파쇄격을 3번 사용하는 콤보로 다리우스, 볼리베어 등의 챔피언마저 방어 아이템을 구매하지 않았다면 원콤을 낼 정도의 막강한 전투력을 자랑하는데, 이들보다 기본 체급이 훨씬 약한 렝가가 오공의 이런 전투력을 버텨낼 리는 없다. 라인전이 끝나도 오공을 암살하기는커녕 부쉬에서 튀어나온 오공에게 암살을 당하거나, 렝가가 궁극기로 선공권을 가져가도 패시브로 렝가의 딜을 버텨내고 콤보를 넣으며 분신 전사로 렝가를 역으로 농락하는 등 고통만 받을 가능성이 농후하다. 특히 성장한 오공의 1:1 능력은 렝가를 따위로 만들어버릴 만큼 강력하기 때문에 사이드 스플릿을 도는 오공을 렝가 혼자 잡으러 가는 것은 자살 행위나 다름없다. 한타로 가면 더더욱 답이 없는데, 오공 입장에서는 강력한 한타 파괴력을 이용해 렝가의 팀원들에게 이니시에이팅을 걸어 한타를 폭파시킬 수도 있고 원딜 옆에서 렝가가 들어오기만을 기다리다 들어오는 순간 회전격의 에어본으로 돌진을 끊어버리고 렝가를 잘라내며 한타를 유리하게 가져갈 수도 있다."}], "general_counters": ["가렌", "우르곳", "트런들", "클레드", "워윅", "아트록스", "뽀삐", "쉔", "탐 켄치", "티모", "자크", "마스터 이", "판테온", "우디르", "아무무", "마오카이", "람머스"]}
{"champion": "루시안", "aliases": [], "hard_counters": [{"name": "칼리스타", "reason": "라인전에서 우위를 점할 방법이 없다. 전체적인 사거리도 궁극기를 빼고 볼 때 루시안이 밀리는데 정작 맞딜도 밀린다. 게다가 평타가 이동기인 칼리스타 특성상 루시안 이상의 카이팅 능력을 자랑해서 도주도 어려운 데다 타겟팅이면서 논타겟팅인 Q스킬을 맞히기도 어렵다 보니 더욱 상대하기 좋지 않다. 이 때문에 후반에 궁극기를 통해서 일방적으로 때리는 구도 외에 루시안이 내세울 만한 요인이 딱히 없는데 상대 서포터부터 패기엔 서포터를 확정적으로 살리는 궁극기가 있어서 그것마저 어려운 상성이다."}, {"name": "룰루(서폿)", "reason": "2022년에 루시안을 상대로 하드 캐리 원딜들이 후픽 카운터로 나오게 된 근본적인 원흉. 변덕쟁이는 루시안의 앞대시를 거의 봉인해 버리며 급성장 등으로 폭딜 변수를 차단하는 능력도 뛰어나다. 하드 캐리 원딜들이 좋아하는 정직한 DPS 대결로 구도를 강제하기 좋은 서포터이다. 그나마 솔랭에서는 간단히 룰루를 밴해서 이러한 그림을 루시안 측에서 봉쇄할 수 있지만 룰루에까지 밴 카드를 쓰기 어려운 대회에서는 그 강력한 루시안-나미의 대항마로 나와서 루시안의 활약이 봉쇄당하는 그림이 나오고는 한다."}, {"name": "브라움(서폿)", "reason": "아군으로 만나면 최고의 파트너지만 적으로 만나면 최악의 하드 카운터로, 패시브와 빛의 심판의 연발 공격으로 승부하는 루시안 앞에서 브라움이 방패를 세우고 떡하니 버티고 있으면 그야말로 통곡의 벽이 따로 없다. 루시안이 옆대시로 포지션을 이동해 뒤쪽 원딜을 잘라먹으려고 해도 브라움 또한 W로 잽싸게 루시안을 따라와 방패를 세워 막아버릴 수 있으며, 이러다가 싸움이 길어지면 뇌진탕 펀치의 기절 때문에 패배하는 쪽은 루시안이다."}, {"name": "알리스타(서폿)", "reason": "매우 열받는 상대. 루시안이 앞대시하면 박치기(W)로 도로 쫓아내 버리거나 분쇄(Q)로 반격하면 루시안 입장에서는 아무것도 못한다. 궁극기를 동반한 엄청난 탱킹력으로 루시안의 딜을 막강한 피해 감소로 상쇄한다는 것도 악재. 거기에 루시안이 선궁을 쓰는 순간 곧바로 분쇄와 짓밟기(E)의 스턴에 걸려 영혼까지 털려버린다는 것도 심각한 문제점. 특히 한타에서도 선궁을 쓴다면 아군 단체로 광역 분쇄를 먹고 루시안은 박치기의 넉백으로 적진에 손쉽게 배달당할 수 있어 패배하는 쪽은 역시 루시안이다. 심지어 갱 호응도 CC기가 많은 알리스타가 압도적으로 훨씬 더 우수하고 루시안이 다른 적에게 궁극기를 시전한다고 해도 루시안이 할 수 있는 것들을 아예 삭제할 수 있기 때문에 루시안 입장에서는 거슬리는 존재이자 완벽한 최악의 상대다."}], "general_counters": ["드레이븐", "애쉬", "바루스", "야스오", "칼리스타", "하이머딩거", "케이틀린"]}
{"champion": "룰루", "aliases": [], "hard_counters": [{"name": "자이라", "reason": "룰루가 힘들어하는 원거리 AP에 룰루의 빈약한 유지력으로는 자이라의 지속적인 식물, 스킬 딜링을 감당해내기 힘들며 평타 사거리마저도 훨씬 길어 버티기도 힘들다. 거기에 다른 원거리 AP와는 차별되는 점으로 받아치기가 매우 뛰어나기 때문에 정면 대결이든 버티는 것이든 룰루 쪽이 질 가능성이 농후하다. 추가로 한타 페이즈까지 질질 끌어도 자이라의 만만치 않은 한타력이 발목을 붙잡게 된다. 궁과 쉴드로 단 한 명만 지킬 수 있는 룰루의 스킬셋 특성상 광역딜을 퍼붓는 식물딜을 룰루 혼자 감당하기 어렵다. 이 때문에 미드든 서포터든 어느 시즌을 막론하고 거론되어오는 룰루 최악의 카운터이며 자이라가 메타상 한창 좋았을 때는 상대 승률이 40% 초반대까지 떨어지기도 했었다."}, {"name": "유미", "reason": "리워크된 이후로 여전히 사르르탄(Q)을 선마하고 루덴 같은 딜템을 구입하는 등의 이해도가 낮은 유미는 라인전과 한타 모두 룰루가 압도하지만 Q 스킬을 2레벨까지만 찍고 슈우우웅(E) - 너랑 유미랑!(W) 순서로 선마하는 유미는 라인전부터 한타까지 상대하기 굉장히 까다롭다. 견제 사거리 자체는 유미가 길지만 적중 난이도나 대미지 측면에서는 룰루가 더 우위에 있기 때문에 초반 라인전 자체는 룰루가 우위에 설 수 있으나 문제는 유미가 리워크된 이후로 보호막과 힐 주는 능력이 대폭 강화되어서 유미가 슈우우웅(E)을 선마하면 룰루 입장에서도 뚫기가 어렵다는 것과 스펠 개수 차이로 인해 유미를 상대로 2대2 교전을 이기기가 생각보다 쉽지 않다. 또한 이렇게 유미를 상대로 라인전을 반반으로 넘기면 기분 좋은 쪽은 룰루가 아닌 유미 쪽이며, 유미의 아군 캐리력 증폭과 한타 밸류는 룰루를 훨씬 상회하기 때문에 어지간한 대미지로는 절대 뚫리지 않는 막강한 쉴드량과 힐량 때문에 유미는 물론이고 상대 원딜을 잡기가 굉장히 어려워진다. 게다가 룰루는 조금만 포지션을 잘못 잡아도 잘리기 쉬운 것에 반해 유미는 특별히 실수하지 않으면 잘릴 일도 없다. 사실상 라인전이 끝나면 룰루의 상위 호환이라 해도 과언이 아닌 수준."}, {"name": "블리츠크랭크", "reason": "그랩을 피하면 무한 견제로 괴롭힐 수 있지만 그랩을 맞는다면 절륜한 파괴력과 막강한 폭딜로 인해 저항조차 못하고 터진다. 모든 그랩류 챔피언 중에서도 그랩 적중 시 리턴값이 가장 크기 때문에 그랩을 맞는다는 전제부터가 잘못된 상대이므로 원딜이나 룰루 본인이나 둘 다 그랩을 안 맞는 것이 상책이다. 한타 밸류는 룰루가 앞설지언정, 블리츠는 한 놈만 걸려라 방식의 잘라먹기 1인자인 만큼 한타가 아닌 잘라먹기 식으로 나와버리면 게임이 매우 어려워진다. 시야먹기 싸움에서도 블리츠가 더 우위에 있는 것도 골치 아프다. 초반 라인전도 상당히 피곤한데 일단 그랩을 안 쓰고 계속 들고 있는 블리츠 상대로 앞에서 견제하는 것은 꿈도 꿀 수 없으며 항상 그랩에 당하지 않게 아군 미니언의 존재를 상기하고 있어야 한다. 또한 초반에 블리츠를 상대로 사고가 난다면 블리츠크랭크의 로밍 역시 따라가기가 힘들어진다. 6렙 이후에도 상황은 별로 달라지지 않는데 블리츠 역시 6렙 이후에 폭딜이 더욱 강력해지기 때문에 6렙 이후에 끌려도 안심할 처지가 못 된다"}], "general_counters": ["벨코즈", "제라스", "브랜드", "럭스", "노틸러스", "블리츠크랭크", "아무무", "나미", "소나", "소라카", "유미", "밀리오", "세나", "이즈리얼"]}
{"champion": "르블랑", "aliases": [], "hard_counters": [{"name": "벡스", "reason": "AP 계열에서 말자하와 쌍두마차를 달리는 르블랑 최악의 하드 카운터. 뚜벅이 메이지다보니 르블랑이 가지고 놀 수 있다고 생각하지만 실상은 정반대. 리산드라와 마찬가지로 르블랑이 왜곡으로 진입하는 순간 패시브가 활성화된 상태에서 거리 두기로 공포를 걸기 때문에 역으로 딜교를 손해 본다. 말자하와 리산드라는 적어도 사거리라도 짧지만 벡스는 사거리가 긴 데다 평타로는 못 벗기는 실드까지 있다 보니 르블랑이 버틸 재간이 없다. 모든 암살자들의 진입을 받아치고 솔킬을 못 먹게 하는 것만으로도 벡스 입장에서 1인분은 다 한 셈이다. 베테랑들도 까다로워할 정도이며 말자하, 리산과 달리 픽률도 높고 대부분 유저들이 다루기 어려운 챔프도 아니라서 숙련도 이슈를 기대하기도 무리이기에 사실상 밴이나 닷지를 추천한다."}, {"name": "말자하", "reason": "준 카운터. 즉발 CC기, 소환물(공허충), 기동성 제약(Q의 침묵, 라일라이의 수정홀을 통한 무한 둔화) 등 르블랑이 싫어하는 요소들은 다 갖추고 있다. 황천의 손아귀의 제압은 즉발 원거리 타겟팅+2.5초 제압이라 정화조차 소용없어서 물몸인 르블랑에게 치명적이며, 아이템 의존도가 은근히 높고 딜로스가 일어나면 안 되는 르블랑은 AD 방어템인 수은 장식띠를 갈 수도 없다. 밴시의 장막과 다름없는 패시브와 공허충으로 르블랑의 갱 호응의 핵심인 사슬을 무력화하기도 쉽다. 공허의 부름의 포킹과 미니언 전염을 이용한 재앙의 환상의 견제도 굉장히 거슬리고, 말자하의 라인 푸시력은 르블랑이 가능한 모든 플레이를 봉쇄한다. 르블랑이 W-R을 써야 간신히 닿을 먼 거리에서 라인만 쭉쭉 밀어도 미드 챔피언 중 최악의 라인 푸시력을 가진 르블랑은 모든 스킬을 총동원해 공허충과 씨름해야 한다. 반면 말자하는 스킬 몇 번 써서 빅 웨이브를 포탑에 박아넣고 르블랑이 포탑과 CS 경쟁을 하는 동안 시야 확보, 오브젝트 체크, 상대 정글러 탐색, 심하면 로밍에 다이브까지 원하는 모든 플레이를 여유롭게 하며 르블랑을 압박할 수 있다. 기발 룬 들고 도란의 검이나 수확의 낫 등 AD 아이템으로 시작해 평타 견제, Q 선마해서 견제로 강력하게 딜교해 라인전을 말려놓는 방법이 있기는 하나 르블랑 숙련도가 낮은 유저가 쓰기에는 어려운 방법이라 잘 나오지 않는다."}, {"name": "룰루(서폿)", "reason": "급성장으로 르블랑의 암살을 방해하는 건 물론이며, 들어오는 르블랑에게 변이만 걸면 딜이고 카이팅이고 도주고 뭐고 전부 끊긴다. 원래 암살자에게 강한 룰루지만 몸을 던지는 스타일의 르블랑에게 너무 치명적인 스킬셋을 보유한 관계로 명백한 하드 카운터."}], "general_counters": ["리산드라", "라이즈", "애니", "나피리", "하이머딩거", "아크샨", "갈리오", "트위스티드 페이트", "판테온", "다이애나", "카사딘"]}
{"champion": "리 신", "aliases": ["리신"], "hard_counters": [{"name": "렉사이", "reason": "원래는 초중후반 맞다이를 전부 렉사이가 압도했으나 라이엇 개발자가 리신으로 렉사이에게 찢기기라도 한 건지 상성이 완전히 뒤집혀버렸다. 기본적으로 원래 초중반 렉사이가 압도하고 후반은 리신이 약우위인 상성이었는데. 이제는 초중반을 리신이 렉사이를 압도하고 중후반은 렉사이가 한타력 우위를 차지하는 관계로 변했다. 초중후반 모두 렉사이가 리신을 1대1로 이기진 못하지만 한타는 이제 렉사이가 세미 브루저 / 탱커로서 기능하여 리신보다 확실히 좋은 편. 따라서 이전만큼 극악한 하드 카운터는 아니지만 라인전 단계에서 큰 이득을 못 보면 어그로 핑퐁이 가능하고 에어본을 활용해 리신의 메이킹을 무력화하기 때문에 여전히 편한 상대는 아니다."}, {"name": "나피리", "reason": "렉사이와 동급 혹은 그 이상의 하드 카운터. 이쪽은 다른 의미로 리신의 진입을 카운터치는 데, 바로 나피리의 패시브 무리의 존재이다. 음파의 의존도가 높은 리 신 입장에서는 무리를 뚫고 나피리에게 음파를 적중하는 게 매우 어려우며, 심지어 후반엔 음파로 무리를 맞히면 한 번에 무리 하나가 죽기 때문에 초반엔 날아갈 수라도 있었지만 후반엔 날아가지도 못한다. 심지어 나피리는 맞딜 능력이 매우 흉악한 암살자이며 리 신 정도는 가볍게 찢어버릴 수 있고 설령 나피리를 차버려도 금세 사냥개의 추적으로 다시 따라붙기 때문에 나피리의 추적으로부터 벗어나기도 힘들다. 리 신이 진입하면 나피리의 단점인 단순한 대처법마저도 가려지기 때문에 나피리는 감사히 받아먹을 뿐이며, 그렇다고 후반을 바라보기엔 나피리는 중후반에 전성기를 맞이하는 챔피언이기 때문에 여러 모로 답이 없다."}], "general_counters": ["람머스", "피들스틱", "뽀삐", "세주아니", "누누와 윌럼프", "우디르", "볼리베어", "신 짜오", "워윅", "바이", "판테온", "오공", "그레이브즈", "쉬바나", "자크"]}
{"champion": "리븐", "aliases": [], "hard_counters": [{"name": "뽀삐", "reason": "대표적인 하드 카운터로, 리븐의 부러진 날개(Q)와 용맹(E)을 차단할 수 있어 라인전에서도 한타에서도 리븐을 집요하게 압박할 수 있다."}, {"name": "가렌", "reason": "리븐이 슈퍼 OP이던 2015 시즌부터 주목받았던 전통의 하드 카운터. 유리한 타이밍은 첫 귀환 이전 타이밍 한 번 뿐이다. 가렌의 딜링 및 탱킹 능력이 약한 초반 6렙 이전까지는 리븐 특유의 치고 빠지는 딜교환으로 우위를 가져올 수 있지만, 용기(W)의 피해 감소로 손해를 최소화하고 6렙부터는 패시브의 압도적인 유지력으로 딜교환을 아예 안 했던 것처럼 원상복구하는 게 문제이다. 그리고 궁극기가 찍히고 점점 템이 나온 후부터는 답이 없어지는 상대. 스킬 연계가 중요한 리븐에게 침묵은 매우 치명적이며, 리븐의 폭딜을 용기(W)로 버텨내고 심판(E)의 딜링으로 갈아버리다가 데마시아의 정의(R)로 바로 뚝배기를 깨버린다. 초반 딜교로 최대한 이득을 가져오고 정글러와 갱킹이나 다이브를 시도하여 최대한 말려놓아야 수월하지만, 그마저도 용기(W)와 잃은 체력 비례 고정 피해를 가진 궁극기의 존재로 다이브 방어 능력마저 뛰어난 가렌이기에 이마저도 쉽지 않다. 리븐의 입장에선 최대한 초반부터 가렌을 밀어붙이고 합류 위주로 운영하는 것이 바람직하다."}, {"name": "레넥톤", "reason": "역사와 전통의 하드 카운터. 리븐의 치고 빠지기는 레넥톤의 무자비한 포식자(W)에 봉쇄되고 역으로 풀콤이 박히며, 보호막을 파괴하기 때문에 리븐의 E로 막는 것도 불가능하다. 또한 리븐은 파밍기가 없기 때문에 CS를 먹으려면 거리를 줄 수밖에 없다. 궁극기를 이용한 폭딜로 잡는 전법 역시 레넥톤이 맞궁을 쓰면 쉽게 카운터 칠 수 있으며, 풀분노라면 리븐의 궁콤과 비슷한 수준의 폭딜을 때려박고 궁극기의 지속 피해와 분노 수급으로 풀콤 이후의 지속 전투력은 더 앞서기 때문에 지속전으로 끌고 가도 못 이긴다. 조건부로 이동기도 두 번 쓸 수 있기 때문에 도주나 선공권 잡기도 쉽지 않은 편. 유일하게 1렙 구간에는 우세하므로 이 구간에서 이득을 보고, 그 이후에는 레넥톤이 E로 들어오는 것을 W로 반응하고 튀는 것만이 유일한 대처법이다."}, {"name": "볼리베어", "reason": "레넥톤과 더불어 탑에서 자주 만나게 되는 하드 카운터 중 하나. 적과 맞붙으면서 근접 딜교환을 해야 하는 리븐에게 탑 맞딜 최강자인 볼리베어는 사신 같은 존재다. 번개 강타(Q)를 에어본이나 기절로 캔슬시켜도 쿨이 초기화되기 때문에 계속 다시 써서 기어이 따라잡고 말아서 차라리 한 번 맞아주고 기절을 쓰는 게 더 나을 지경이고, EQW평 집공 콤보 한 방이면 초반부터 반피가 날아가며, 정작 볼베 자신은 E의 실드로 유유히 딜을 다 씹어버리고 다시 라인을 밀어젖히기 시작한다. 그렇게 라인전 주도권을 넘겨줘 버리면 미드나 정글에 적극적으로 개입해 다이브로 봇이나 미드를 말려 버리거나 정글몹을 모조리 다 먹어버린다. 게다가 궁극기의 추가 체력 때문에 바람 가르기 킬 캐치도 엿먹이고, 맞딜하다 너덜너덜해져 집에 가려고 하면 포탑 정지 다이브를 한다."}], "general_counters": ["그라가스", "아크샨", "루시안", "베인", "제이스", "케넨", "퀸", "티모", "람머스", "마오카이", "말파이트", "쉔", "오공", "판테온", "나서스", "올라프", "요릭", "우르곳", "일라오이", "마스터 이", "오른", "탐 켄치", "피오라", "트런들", "트린다미어", "초가스", "클레드"]}
{"champion": "리산드라", "aliases": ["리산"], "hard_counters": [{"name": "제라스", "reason": "통계상으로도 나타나는 리산드라에게 있어서는 최악 그 자체. 미드에서 만날 경우 닷지가 속이 편해진다. 리산드라의 최상급 갱킹 호응을 통한 아군 정글러의 도움 외에는 답이 없다. 슬프게도 갱킹으로 제라스를 1~2번 잡아내더라도 오히려 제라스 유저의 숙련도에 따라 계속 얻어맞게 되는 경우가 많다. 아군 정글러와 제라스를 잡아냈다면 팀 전체에게 도움이 되는 오브젝트나 로밍 등에서 추가적으로 이득을 봐주는 것이 좋다. 다만 유통기한이 온다지만 제라스는 엄연히 생존력이 약해서이지 극딜은 제라스가 3~4코어쯤에 올리는 라바돈 때문에 후반 가면 오히려 더 한 편이라 괜히 후반이라고 깝죽거리다가 W-E-Q 콤보를 잘못해서 맞아주면 리산드라는 물몸이라 한 번에 터져버릴 위험이 있으므로 1대1은 제라스가 말린 게 아니라면 가급적 피하고 한타에서 승부를 봐야 된다."}, {"name": "카사딘", "reason": "원래 2020 시즌만 해도 리산드라는 마법 피해 감소로 무장한 카사딘을 이길 수도, 카사딘의 성장을 저지할 수도 없어서 마치 제드, 사일러스, 라이즈, 애니비아 급의 극카운터 중 한 명이나 다름없었다. 그나마 2021 시즌에 들어서 카사딘이 간접 너프를 많이 당하게 되어(안정적인 코어템인 영겁의 지팡이의 삭제 등) 챔피언의 성능이 상당 부분 약화되었기 때문에 어느 정도 수월하게 상대할 수 있게 되었으나 다시 영겁의 지팡이와 대천사의 생명선 효과 롤백으로 만만한 상대는 아니게 되었다. 다만 리산드라가 점화를 들고 얼음 파편만 잘 맞히는, 즉 라인전을 강하게 이끌 실력이 되는 유저라면 카사딘을 상대로 킬각을 잡는 경우도 많다. 당연히 카사딘의 패시브의 마법 피해 감소와 무의 구체의 보호막 때문에 딜이 반감되므로 혼자서 딜교를 막 걸었다가는 크게 손해를 보므로 주의해야 한다."}, {"name": "사일러스", "reason": "사일러스도 라인전이 센 챔피언은 아니지만, 초반부터 극후반까지 계속해서 이어지는 흉악한 맞싸움과 난전 능력, 그리고 결정적으로 국왕시해자의 높은 피해량과 체력 회복, 여기에 아이템이 조금 쌓여 스킬 가속이 좀 맞춰지다 보면 안 그래도 맞으면 아픈 스킬들이 쿨타임까지 짧아져서 리산드라는 사일러스를 절대로 이길 수 없게 된다. 게다가 사일러스가 팀원들을 학살하는 것을 방어해야 하는 것도 너무나도 힘들고, 얼음 무덤도 사일러스가 더 잘 써먹는다."}], "general_counters": ["애니비아", "럭스", "벨코즈", "오리아나", "직스", "신드라", "빅토르", "라이즈"]}
{"champion": "릴리아", "aliases": [], "hard_counters": [{"name": "헤카림", "reason": "가장 대표적인 릴리아의 카운터 챔피언. 대회에서 릴리아를 픽할 때 카운터로 자주 나온다. 정글링이 릴리아 못지않게 빠르며 화력도 우수하다. 릴리아의 Q 범위가 조금 더 넓고 딜링이 강력하다지만 헤카림이 더 빠르고 튼튼하기 때문에 돌격을 허용할 수밖에 없고, 그럼 맞아죽을 뿐이다. 손쉽게 저지 불가와 공포라는 하드 CC기를 걸어버리는 궁극기의 존재까지 생긴 건 비슷하지만 다방면적인 카운터."}, {"name": "마스터 이", "reason": "헤카림에 버금가는 최악의 상대. 최상급 이동+무적기인 일격 필살으로 릴리아 스킬을 엿먹이기 쉬우며 릴리아의 Q는 멀어져야 효과가 나오지만 둔화 면역에 이속 증가가 있는 마이의 궁 앞에서는 쓸모없다. 거기다 딜도 초반부터 강해서 마주치면 최소 플이다. 6렙 이후는 좀 낫지만 궁을 빼서 릴리아 갱을 고자로 만들 수 있고, 아예 한 대 맞아주고 궁을 씹을 수도 있는 데다가 왕귀력도 엄청나다."}], "general_counters": ["그레이브즈", "렉사이", "신 짜오", "엘리스", "판테온", "이블린", "오공", "아이번", "녹턴", "렝가", "스카너"]}
{"champion": "마스터 이", "aliases": ["마이", "마스터이"], "hard_counters": [{"name": "람머스", "reason": "평타 딜러들의 악몽. 게임 내내 마스터이의 영향력을 제한당하는 매우 피곤한 매치업. 마스터 이의 빈약한 갱킹 능력과 달리 초반 구간대부터 람머스는 최상급의 갱킹력으로 온 라인을 터뜨리고 다닐 수 있으며, 맞다이도 몸 말아 웅크리기의 자체 둔화가 삭제되었고 일격 필살로 입힌 피해도 적중 시 효과가 되면서 반사 대상에 포함되게 바뀌면서 마법 저항력이 확보가 되어 있지 않다면 람머스가 웅크린 상태에서 도발을 거는 순간 마스터 이가 지는 경우가 발생한다. 한타에서는 수은이 없는 채로 람머스의 도발을 맞는다면 그 즉시 전광판으로 사출되며, 마법 저항력을 잔뜩 올린 후 반 풀템전이라면 1:1 싸움은 당연히 이기지만 애초에 일반적인 게임에서는 후반에 마스터 이가 람머스랑 1:1을 하는 상황 자체가 안 나온다. 초반 정글링이 느리고 약한 람머스를 초반 카정으로 상대하는 방법도 있지만, 카정이라는 플레이 자체가 리스크가 높은 플레이이고 실패했을 경우 그대로 마스터이의 존재감이 사라지는 만큼 이마저도 여의치 않다. 그나마 확정 CC기가 1개라 수은으로 도발을 풀면 그만이기 때문에 람머스가 이미 잘 큰 마스터 이를 저지하기에는 한계가 있으나 애초에 마스터 이가 수은을 올리는 것은 딜로스라는 큰 리스크를 짊어져야 한다."}], "general_counters": ["피들스틱", "스카너", "자크", "아무무", "오공", "카직스", "엘리스", "판테온", "신 짜오", "워윅", "녹턴", "트런들"]}
{"champion": "마오카이", "aliases": ["마오"], "hard_counters": [{"name": "샤코(서포터)", "reason": "깜짝 상자를 이용해서 안전하게 묘목을 제거하며 자기는 상자를 남길 수 있다. 또한 마오카이가 뒤틀린 전진을 샤코에게 사용할 경우 Q로 박스가 있는 곳에 배달하면 몸이 약한 서포터 마오카이는 순삭당한다. 마오카이가 궁극기를 사용했을 때, 샤코가 맞궁을 사용하면 궁을 막으면서 샤코의 분신은 남는다. 라인전 이후에는 박스를 깔며 마오카이가 수행하는 시야 장악 역할을 거의 똑같이 수행할 수 있고, 은신 때문에 생존하는 것이 훨씬 쉽다. 원거리인 묘목에 비해 상자는 사거리가 짧아 시야를 뚫는 리스크는 있고, 원딜 보호력을 포함해 한타에서는 마오카이가 낫지만, 이외에는 완벽하게 카운터당하는 상성."}, {"name": "문도 박사", "reason": "하드 카운터 1호. 마오카이가 싫어하는 특징을 장판기 빼고 전부 가지고 있다. 뼈톱은 무지막지한 현재 체력 비례 대미지도 아프지만 마오카이의 패시브보다 쿨타임이 훨씬 짧아 문도에게 쉽게 다가가지 못한다. 정글이 갱킹을 온다고 해도 쉽지는 않다. 문도의 패시브는 마오카이의 핵심 갱 호응 스킬인 W에 달린 속박을 무시하기 때문. 그리고 궁을 배워서 추가 CC기가 생긴다 해도 문도는 그냥 궁을 쓰면 끝난다. 한타에서 이니시 능력이 부실한 마오카이를 상대로 뼈톱을 뿌려대면 불리해지는 건 마오카이이며 문도는 패시브로 CC기를 씹기 때문에 아군을 두들겨 대려 달려드는 문도를 막을 방법이 없다."}, {"name": "모데카이저", "reason": "하드 카운터 2호. 문도 박사보다 더 힘든 상대 라인전부터 한타까지 게임 내내 끌려다녀야 한다. 모데카이저가 약한 초반에는 마오카이가 더 약하고, 6렙 이후에 잘못 끌리면 강제로 죽음의 세계에 납치당하여 일대일을 해야 한다. 마오카이가 아이템이 더 잘 나왔다고 해도 탱커에다가 스킬 쿨이 하나같이 짧지 않은 마오카이가 맞딜을 이기지는 못하기 때문에 착취보다는 난입을 들어 빠르게 모데와 거리를 벌리는 것이 중요하다. 탑 마오카이는 한타를 보고 뽑는 픽인데 모데카이저는 궁극기로 마오카이를 팀원과 격리시켜 변수 창출을 막아버린다는 점도 문제다."}], "general_counters": ["모르가나", "벨코즈", "자이라", "제라스", "니코", "흐웨이", "일라오이(탑)", "초가스(탑)", "오른(탑)", "트런들(탑, 정글)", "올라프(탑, 정글)"]}
{"champion": "말자하", "aliases": [], "hard_counters": [{"name": "빅토르", "reason": "빅토르는 말자하보다 사거리가 길고, 빅토르의 중력장(W)은 슬로우가 1.5초 걸려야 기절한다. 중력장에서 황천의 손아귀를 썼다간 시전 시간 절반도 못 채우고 기절이 걸려버리며, 중력장에서 나오고 쓰자니 나올 동안 도망간다. 또한 빅토르의 궁극기는 첫 타격이 정신집중을 끊기 때문에 다른 챔피언을 물었을 땐 더 쉽게 무력화된다. 패시브로 막으려 해도 빅토르의 레이저는 피하기 어렵고, 말자하의 도트 대미지를 Q 쉴드로 어느 정도 방어하고, 무엇보다도 공허충을 잘 지워서 푸시력을 상쇄시킨다. 다만 빅토르는 갱에 매우 취약하고 말자하는 치트키 수준의 갱 호응 능력을 갖추고 있으니 실력 차가 크지 않다면 갱을 불러서 해결하자."}, {"name": "스몰더", "reason": "스몰더가 Q 25스택을 쌓는 순간 라클하려고 뽑은 공허충이 Q 한 방에 정리되어 스몰더가 계속 푸시 주도권을 잡고, 중반 이후 말자하보다 밸류가 높다. 무엇보다 말자하 공허충이 스택을 내주는 거나 다름없어 W는 거의 봉인하다 싶이 해야 한다. 그나마 궁극기를 활용한 무한갱이 가능하다는 게 위안."}, {"name": "애니비아", "reason": "초반에는 공허충을 그렇게 잘 지운다고 보기는 어렵지만 사거리가 말자하보다 길기 때문에 애초에 딜교가 성립되지 않고 패시브는 없는 스킬이 되며 라인전 내내 얻어맞아야 한다. 무엇보다 궁극기가 나온 뒤에는 공허충을 손쉽게 지워버리기에 라인 푸시에서 압도적으로 밀린다. 황천의 손아귀도 말자하가 다른 챔피언에게 궁극기를 꽂으면 애니비아는 원거리에서 냉기 폭발(Q)을 던지거나 벽으로 간단히 풀 수 있다. 다만 공허의 부름(Q)으로 얼음 폭풍(R)을 끊거나 냉기 폭발(Q)의 스턴을 막을 수 있어 Q 적중률이 높다면 상대할 만하다."}, {"name": "럼블", "reason": "화염방사기(Q) 한 틱에 패시브가 바로 빠진다. 화염방사기로 라인 클리어도 빠르고 공허충도 정리된다. 고철 방패(W)의 쉴드로 인해 견제하기도 쉽지 않고 침묵이나 제압을 맞아도 나오던 화염방사기는 계속 나가기 때문에 딜교하기가 쉽지 않다. 이퀄라이저 미사일(R) 또한 뚜벅이인 말자하에게는 까다로운 존재. 2019 시즌 이후로는 미드 라이너로 종종 운용되기 때문에 라인에서 만날 확률이 있다."}], "general_counters": ["제라스", "직스", "신드라", "오리아나", "아우렐리온 솔", "브랜드", "트위스티드 페이트", "럭스", "아크샨", "흐웨이"]}
{"champion": "말파이트", "aliases": ["말파"], "hard_counters": [{"name": "럼블", "reason": "최악의 극 하드 카운터1. 대부분의 말파이트 유저들이 사일러스를 고정밴하다 보니 혹여나 맞라이너로 만나는 순간 지옥을 경험할 수 있다. 기본적으로 말파이트가 AP 위주 챔피언들에게 약한데 거기에 체력 퍼뎀 스킬을 2개나 장착하고 있다. 적어도 럼블이 어느 정도 숙련도를 갖추고 있는 유저라면 라인전은 뭘 해도 말파이트가 절 대 이길 수 없다. 점화를 들고 오는 순간 미니언 하나 먹으려고 하면 화방과 작살 유성 짤짤이로 반피를 후두려 맞아야  하고, 3레벨이 찍히는 순간 점화(치감)+작살 2방(중첩 마저깎)+W(딜씹)+화방(체력 퍼뎀)+과열 평타(체력 퍼뎀) 풀콤보를 맞고 변사체로 발견된다. 말파이트의 Q는 쿨타임이 더 짧은 W하나로 가뿐히 무시해버리고, 라인을 당겨놓으면 경험치조차 제대로 먹을 수 없으며 라인 푸쉬력도 압도적으로 럼블이 우위를 점한다. 궁극기를 통한 갱킹 호응이 있다면 여차저차  킬은 따낼 수 있어도 라인 주도권이 없는 것은 여전하고, 럼블은 저점이 보장된 챔피언이라 말파이트를 위해 갱이 투자된 것부터가 팀적 손해다. 라인전 이후에도 사이드에서 럼블을 일대일로 이기는 것은 불가능에 가까우며, 나중에 존야까지 나온 럼블을 궁극기로 마크하는 것도 쉽지 않아진다. 한타에서도 럼블의 궁극기는 그 말파이트만큼이나 영향력이 막강해 서 말파이트에게 한타 영향력이 밀리지 않는데, 말파이트가 AP챔피언을 상대하는 상황에서 한타 영향력이 비등하다는 것 자체가 굉장한 손해이다. 또 아군의 호응이 있어야 제 성능이 나오는 말파이트의 궁극기와 달리 럼블의 궁극기는 광역으 로 높은 마법 피해를 가하기 때문에 초반부터 더 쉽게 교전에 합류하며 영향력을 뿌릴 수 있는 쪽도 럼블이다. 아군이나 상대가 사일러스를 미리 밴했다면 럼블을 밴하는 것이 좋은 선택이다."}, {"name": "사일러스", "reason": "최악의 극 하 드 카운터2. 어지간한 말파이트 초고수들도 사일러스만큼은 밴을 추천하며, 역으로 사일러스의 티어가 높지 않은데도 밴 페이즈에서 뜬금없이 사일러스가 밴당하면 그 플레이어가 말파이트를 하려는 게 아닌가 의심을 해볼 정도로 정형화되어  있다. 신비로운 유성을 들고 짤짤이를 하다 궁극기로 깜짝 킬각을 보든, 집중 공격을 들고 평타로 두들겨 패든 말파이트 가 라인전 단계에서는 럼블보단 어느 정도 할 만하지만, AP 위주 스킬셋은 말파이트에게 달갑지 않고, 사일러스의 근접  전투력이 만만하게 볼 정도로 약한 것도 아니다. 물론 가장 큰 문제는 말파이트의 아이덴티티인 궁극기를 게임 내내 훔쳐간다는 것이다. 말파이트의 궁극기에 달린 높은 0.9의 AP계수와 마법 피해를 역이용해 한타를 터뜨릴 수 있기 때문에 말 파이트 유저들이 그냥 상수로 고정밴하는 챔피언이다. 럼블이 말파이트를 라인전 스노우볼로 카운터친다면 사일러스는 게임 전체 스노우볼로 카운터치는 꼴인 것이다. 초반에는 유성과 지진의 파편, 각종 마저템으로 말파이트가 우위지만 결국 성장성 측면에서 사일러스가 우위다. 강탈의 쿨타임 페널티는 2레벨 이상 찍히면 사실상 없는 수준이기에 사일에겐 그리 큰 페널티도 아니고, 존야나 밴시를 둘러서 강탈에 대응하자니 사일러스는 밴시를 사슬 후려치기(Q)로 빼기도 쉽고, 억압(E)에 맞는 순간 기절+에어본 맞고 궁극기를 뺏긴다. 게다가 이놈은 억압(E)이 이동기인만큼 말파이트보다 더 먼 거리에 서 기습적으로 접근할 수 있고 연계도 더욱 다채롭다. 결론적으로 말파이트 자신이 맞라인에서 사일러스를 상대하는 건  어떻게든 극복한다 치더라도 말파이트의 아군들이 크나큰 고생을 하게되는 부분까진 막을 수 없다. 말파가 아예 탈주라도 하지 않는 이상, 궁극기를 뺏기는 건 막을 수 없는 필연이므로 어지간해선 밴을 때리거나 아군이 사일러스를 데려오는  게 정신건강에 이롭다."}, {"name": "갈리오", "reason": "최악의 극 하드 카운터3. 닷지하는 것이 정석인 상대이다. 그야말로 라인전과 게임 전체적으로 말파이트를 카운터치는 최악의 상성 중 하나. 안티 AP인 주제에 정작 본인은 또 AP기반인자라 말파이트를 면상에 제대로 카운터를 꼿아버리는 것이 가능하다. 지진의 파편은 마법 보호막으로 그냥 무시하고 갈리오는 평타 비중이 낮은 데다 패시브 평타는 공속 감소에 아무런 영향이 없다. 그렇다고 라인전이 약한것도 아닌게 말파이트는 모든 스킬이 씹히는 와중에 갈리오 본인은 진입해서 도발걸고 패시브 평타랑 Q로 감전 터트리고 빠져버리는 이기적 인 딜교환이 가능하다. 유성을 들고오면 원래 원거리 대응력이 비교적 좋은 말파이트이나 그놈의 마법 보호막 때문에 원 거리 견제를 속수무책으로 다 맞아야한다. 라인클리어도 말파이트보다 빨라 적극적인 로밍으로 게임을 터뜨리기도 쉬우며, 영웅 출현의 광역 에어본과 광역 도발로 한타 기여도도 말파이트에게 밀리지 않는 데다 마방템과 존야가 하나하나 나오기 시작하면 궁극기를 맞고 버티면서 싸우는 게 가능해서 제대로 한타력 차이를 내는 것이 가능하다. 결론적으로 라인전 과 팀 전체적으로도 말파이트의 존재를 지워버리는 것이 가능하기에 말파이트의 AD팀원들이 무지막지하게 잘 크지 않는한 끔찍한 경험을 선사하는 상대이다."}], "general_counters": ["마스터 이", "올라프", "일라오이", "요릭", "라이즈", "카시오페아", "가렌", "갱플랭크", "카사딘", "그라가스", "나서스", "자크", "탐 켄치", "모데카이저", "마오카이", "오른", "초가스", "블라디미르", "사이온", "문도 박사", "쉔"]}
{"champion": "멜", "aliases": [], "hard_counters": [{"name": "블라디미르", "reason": "라인전부터 블라디미르의 압도적인 유지력에 멜이 밀리며, 반사할 수 있는 것도 선혈의 파도뿐이다. 게다가 E의 속박을 맞히기도 어렵고, 맞혀봤자 피의 웅덩이로 숨어버리기 때문에 스택을 쌓기가 매우 힘들다. 무엇보다도 궁극기 또한 피의 웅덩이로 씹어지기 때문에 한타 상황에서도 블라디미르를 견제하기에 거슬린다. 반박으로 잠시 스킬들을 씹을 수는 있으나 후반으로 가면 블라디미르의 주력 딜링기인 수혈과 선혈의 파도의 쿨타임은 5초 이내가 되기 때문에 명백한 멜의 하드 카운터이다."}], "general_counters": ["럼블", "빅토르", "아지르", "애니", "카시오페아", "제라스", "탈리야", "베이가", "리산드라", "나피리", "아칼리", "카사딘", "야스오", "판테온", "피즈", "트린다미어", "노틸러스", "레오나", "아무무", "블리츠크랭크"]}
{"champion": "모데카이저", "aliases": ["모데"], "hard_counters": [{"name": "베인", "reason": "뚜벅이 탱커 브루저 잡는 1타 챔피언. 모데도 탑 뚜벅이 브루저답게 베인에게 힘든 상성이다. 말살(Q)을 구르기로 피하고, 붙으려고 하면 선고로 밀어내고, 만약 붙었다 하더라도 궁극기의 은신 효과로 모데카이저의 패시브 발동을 늦출 수 있고, 궁극기 안에서도 시간을 질질 끌 수 있다. 베인이 쫓는 입장, 모데가 도망치는 입장임을 염두에 둔 채 유체화+궁극기를 사용해 킬 각을 잡으려는 베인을 항상 생각하면서 플레이하자. 만약 베인의 필살기 점멸+선고에 당했다면 사망 확정이므로 베인의 노림수에 걸려들지 않도록 주의하자. 선고 스킬은 투사체이므로 모데카이저의 궁극기와 사용 타이밍이 겹칠 시 사라진다. 베인의 단점인 느린 라인 푸시 속도를 이용해 최대한 버티다가 텔레포트를 이용한 합류 위주의 플레이를 하는 것이 좋다. 만약 라인전에서 베인을 이겼더라도 베인에게 선공권을 넘겨주는 순간 킬 차이가 얼마나 나든 언제든지 죽을 수 있으니 조심하면서 사이드를 돌고 한타 위주의 플레이를 하자"}, {"name": "마스터 이", "reason": "1대1 승리가 불가능한 상대 중 하나로 아무리 모데카이저가 대인전 능력이 뛰어나다 한들, 최강의 DPS와 모든 기본 공격에 추가 공격력 계수가 붙은 고정 피해를 보유한 마스터 이를 이기는 것은 불가능하다. 이것 말고도 애초에 모데는 하드 CC기도 없고 주력기가 논타겟이라는 점에서 마이 상대로 매우 불리하다. 모데카이저의 1대1 승리 플랜에 있어서 가장 중요한 말살(Q)의 적중 유무도 마이 앞에선 대단히 불리하게 작용되는데 마이 입장에서 평타로 슥슥 썰어대다가 모데가 말살을 쓸 때 일격필살(Q)을 딸깍 누르기만 하면 그만이다. 설사 일격필살(Q)로 회피하지 못했다고 해도 명상(W)을 누르면 대미지가 감소되기 때문에 모데 입장에서 답이 없다. 마이가 몰왕검을 뽑아 온 시점부터는 게임 끝날 때까지 대인전 성립이 불가능하며 어느 정도 선이 있는 다른 전사 챔피언과 달리 마이는 그런 것도 없이 1코어 격차도 그냥 가볍게 무시하고 모데를 딜로 찍어누르기 때문에 나대지 않는 것이 상책이다. 2코어부터는 죽음의 세계고 뭐고 없이 부쉬에서 E, Q, 평 다 맞추고 시작해도 역으로 썰려나가므로 절대 혼자서 대면하지 않도록 주의해야 한다. 반드시 팀과 같이 마이를 점사해야 하지, 단독으로 죽음의 세계에서 마이를 마킹하겠다는 것은 두말할 필요가 없는 그야말로 완벽한 자살 행위이며 죽음의 세계로 데려가봤자 모데가 말살 한 번 쓸 때 마이의 평타 찜질을 맞고 2초 내로 증발한다. 어쩔 수 없이 모데가 마이를 마크를 해야 한다면 마이를 궁으로 끌고 와서 필사적으로 도망치다가 존야로 시간을 끄는 거 말고는 방법이 없다. 맞라인전에서 만나도 쉽지 않은데, 초반에 스킬 쿨타임이 긴 말살을 마이가 일격필살로 피하면서 모데에게 붙어버리면 답이 없다."}, {"name": "올라프", "reason": "하드 카운터. 거의 전 구간에서 맞다이를 지는 데다, 궁과 E를 봉인당하는 수준이며, 뚜벅이인 모데는 올라프의 도끼를 맞으면 도망갈 수도 없다. 동성장 기준 맞딜을 이기는 방법은 2가지 정도가 있는데, 2렙 타이밍에 보호막 강타와 점화를 이용해 풀피 싸움을 걸거나, 죽음의 세계에 끌려 들어가면 원래 협곡의 바닥에 떨어져 있던 도끼를 올라프가 주울 수 없게 되므로 도끼를 맞자마자 올라프가 궁을 켜기 전에 데려가버리는 것이다. 데려가는 데 성공했다면 스탯을 빼앗기도 하는 데다 도끼는 줍지 못하면 쿨타임이 꽤 긴 스킬이기에 이 상황이라면 모데가 이길 수 있다. 다만 이것조차 쉽지 않은 것이, 2렙 딜교는 모데가 E가 없는 상태이니 올라프가 응하지 않을 수 있고, 궁 싸움 역시 올라프가 먼저 궁을 켜고 달려오든, 모데 궁에 반응하여 궁을 켜든, 애초부터 거리가 있어 궁 거리가 닿지 않든 하나만 해당되어도 끌려가지 않는다. 얌전히 받아먹다가 한타를 보는 게 답인 매치업."}], "general_counters": ["베인", "오로라", "카시오페아", "하이머딩거", "신지드", "카르마", "퀸", "바루스", "피오라", "워윅", "트린다미어", "나서스", "볼리베어", "애니비아", "릴리아", "르블랑"]}
{"champion": "모르가나", "aliases": ["몰가"], "hard_counters": [{"name": "카르마", "reason": "프로 선수들도 언급한 적이 있는 최악의 카운터 챔피언이다. 라인전에서 카르마의 견제력은 딜러형 서포터들을 뺨칠 정도라 모르가나와는 비교를 불허하며, 그런 주제에 이속 증가가 달린 실드를 가지고 있어서 유지력 싸움에서도 카르마가 불리할 게 없고 모르가나의 속박을 피하기도 쉽다. 거기다가 모르가나는 라인을 밀어야 제 성능을 낼 수 있는데 카르마한테는 푸시력조차 딸린다. 이렇다 보니 라인전을 못하면 한타에서 애매해진다는 카르마의 단점도 모르가나를 상대로는 그리 문제가 안 되며, 설령 어찌저찌 카르마를 상대로 반반이라도 가도 모르가나 역시 한타 기여도가 그리 좋은 서포터가 아닌지라 카르마 입장에서는 아쉬울 게 없다. 그나마 카르마 입장에서도 칠흑의 방패 때문에 안 그래도 그리 좋지 못한 킬 각을 잡는 능력과 갱 호응 능력이 더 낮아진다는 점은 있지만 워낙 모르가나를 두들겨 패기 좋아서 카르마가 굳이 속박에 얽매일 필요가 없다는 게 문제이다. 다만 파훼법이 아예 없지는 않은데, 일단 카르마의 생존력은 유틸형 서포터치고는 꽤 좋지만 아군 보호 능력은 유틸형 서포터치고는 그리 좋지 않아서 상대 원딜만 집중적으로 마크해서 카르마도 덩달아 망하게 할 수 있다. 또한 6레벨 이후의 폭발력은 모르가나가 우위일 수밖에 없어서 6레벨 타이밍을 노리는 것도 좋다. 카르마는 견제를 하다 보면 라인을 밀 수밖에 없는 구조라 여차하면 갱을 콜하기도 쉽다는 점도 있다."}, {"name": "소나", "reason": "전통의 하드 카운터. 모르가나는 다른 유틸형 서포터를 상대로 불리하기는 하지만 그들은 수동적이거나 CC기 의존도가 다소 있어서 유지력은 밀릴지언정 칠흑의 방패로 막을 스킬도 있고 견제기도 논타겟 스킬 위주라 원딜과 함께 카이팅을 해가며 버티기는 다소 용이하지만, 소나는 타겟팅인 용맹의 찬가와 패시브를 피할 수가 없어서 라인전 내내 모르가나만 손해를 보는 딜교 싸움을 하게 된다. 그나마 기민함의 노래의 파워 코드 효과가 칠흑의 방패로 막히게 수정이 되어서 갱킹 대처는 나아졌지만 같은 패치로 기민함의 노래의 이속이 대폭 버프되어 속박을 위시한 모르가나의 갱 호응을 더 잘 피하게 되어 더욱 까다로워졌다. 실제로 한국은 물론 유럽이나 북미의 소나 장인들도 소나가 버프를 받기 전 5티어를 전전해도 모르가나만큼은 라인전 단계부터 잘 찢어버리는 모습을 보여준다. 굳이 소나가 모르가나를 라인전부터 괴롭히지 않고 반반만 가도 소나의 성장성은 순수 서포터 중 최상급이라 소나에게는 나쁠 게 없다."}, {"name": "렐", "reason": "탱커 챔프임에도 출시부터 모르가나가 힘들어하는 요소를 갖췄다. 미드에서도 잘 만나지 않으며 분노를 쌓아서 W를 써야 보호막을 뚫는 레넥톤, 궁에만 보호막 파괴가 있고 일반 스킬인 그랩과 강철주먹은 단일 타겟이고 블쉴에 씹히는 블리츠크랭크와 달리 렐은 조건이 따로 없는 일반 스킬 Q가 광역 스턴+보호막 파괴라는 것이 치명적이다. 렐 Q의 선딜이 길다곤 하나 아예 느린 것도 아니고 미니언을 방패 삼을 수 없기 때문에 이속 버프가 궁밖에 없는 모르가나가 무빙으로 피해야 하는 것부터 문제인데 일단 맞으면 선스턴으로 행동 불가가 되어 블쉴을 쓰지 못하기 때문에 후속 W나 궁 등의 CC 연계까지 맞아서 빈사가 되거나 죽기 쉬워서 골치 아프다. 특히 렐은 사미라, 카이사, 칼리스타 등 행동 및 이동 불가 CC 연계가 뒷받침되면 라인전부터 폭딜을 퍼붓는 원딜들과 주로 같이 오기 때문에 속박을 맞춘다 해도 이 속박은 결국 이동만 불가한 거라 모르가나 본인이나 아군 원딜은 프리딜을 받는다는 게 문제. 렐의 Q를 계속 보고 피하는 건 힘들므로 아예 라인전 대치 및 견제 구도에서 선 Q를 맞을 각을 안 만들거나 Q를 맞아도 스턴이 빨리 풀리도록 강인함을 갖춰 블쉴을 빨리 사용하여 후속 W 등의 CC 연계를 막거나 선 W를 봉쇄시키는 게 최선이다."}, {"name": "밀리오", "reason": "최악의 하드 카운터이다. 밀리오의 견제력은 유틸폿치고 좋은 편은 아니지만, 모르가나 역시 견제력이 전무해서 의미가 없고 유지력은 밀리오가 훨씬 좋다. 문제는 그것이 아닌 밀리오의 궁. 안 그래도 맞히기 힘든 속박인데 어쩌다 맞혀도 궁으로 풀어버린다. 또한 3초 동안 부여되는 65%의 강인함은 모르가나에게 매우 까다롭다. 밀리오가 작정하고 미카엘부터 올려 버리면 더더욱 답이 없어진다. 한타 기여도도 밀리오가 압도적이다."}, {"name": "하이머딩거", "reason": "혜성같이 등장한 또 다른 하드 카운터이다. 미드 하이머딩거는 거의 없기에 기존에는 탑 vs 미드, 서폿의 관계로만 만나서 괜찮았는데 하이머딩거가 서폿으로 준수한 성능을 보이기 시작하면서 보이는 구도. 일반적으로 메이지에게는 반반 내지 불리한 편인 하이머딩거지만 모르가나는 말이 메이지이지, 스킬 구조는 라이즈처럼 인파이팅형이라 사거리가 짧아서 하이머딩거에게 취약하며 속박 적중 하나에 크게 의존하는 딜 구조상 속박을 막아버리는 포탑을 깔아대는 하이머딩거에게 게임 초반부터 끝까지 카운터당한다. 아무리 주문력을 올려도 장판 구조상 하이머딩거의 포탑을 절대 지울 수 없기 때문이다. 하이머딩거 입장에선 포탑이 안 지워지므로 딜을 넣기 위해서는 무조건 포탑 안으로 들어와야 하는 모르가나가 무섭지 않고, 모르가나 입장에서는 블랙 실드로 하이머딩거의 기절을 씹어도 딜찍누에 죽어버리니 답이 없다. 포탑 자체가 코어템인 존야를 카운터치는 것은 덤."}, {"name": "루시안(원딜)", "reason": "모르가나 최악의 카운터. 서포터나 미드 라이너나 라인전이나 후반 한타에서나 모르가나에게 매우 위협적인 챔피언이다. 끈질긴 추격으로 속박을 피하거나 궁극기에서 벗어나기 쉽고 되려 추노할 수도 있으며 W에 스킬 포인트를 준 경우 1레벨 칠흑의 방패쯤은 쉽게 벗길 수 있다. 동시에 모르가나를 두들겨 패는 것은 덤. 심지어 루시안은 어차피 CC기가 없고 W와 패시브 경계 효과를 제외한 모든 딜링이 물리 피해이기 때문에 미드나 탑에서 만났을 때는 칠흑의 방패의 효율성도 떨어진다. 짧은 사거리라는 루시안의 단점도 450으로 더 짧은 모르가나를 상대로는 전혀 약점이 되지 않는다."}, {"name": "카타리나(미드)", "reason": "모르가나 최악의 하드 카운터. 카타리나는 CC기 의존도가 낮기 때문에 블랙쉴드의 영향을 받지 않으며 아무리 모르가나가 속박을 날리든 궁을 쓰든 카타리나는 잽싸게 순보로 피해버린다. 순보의 쿨타임도 짧아서 빈틈이 안 보이는 것도 덤이며 동성장한 카타리나의 살인적인 화력은 모르가나의 블랙쉴드 따위는 눈 깜짝할 새 녹아내린다. 미드든 서포터든 반드시 밴하고 가는 게 정신건강에 이로운 최악의 상대이다."}, {"name": "아지르(미드)", "reason": "사실상 모르가나 최악의 카운터다. 신기루(E)로 속박을 쉽게 봉쇄할 수 있다. 라인전이 끝나면 아지르의 지옥 같은 모래병사 지속딜이 모르가나가 감당할 수 있는 수준이 아니다. 일반적으로 각이 뻔한 아지르의 궁극기조차 광역기라 심리전이 아지르에게 우위가 있다."}], "general_counters": ["세나", "잔나", "소라카", "질리언", "벨코즈", "럭스", "제라스", "브랜드", "자이라", "흐웨이", "베인", "이즈리얼", "사미라", "트리스타나", "시비르", "케이틀린", "제드", "제이스", "드레이븐", "아우렐리온 솔", "빅토르", "요네", "탈론", "카사딘", "블라디미르"]}
{"champion": "문도 박사", "aliases": ["문도", "문도 박사"], "hard_counters": [{"name": "요네", "reason": "W에 기본적으로 퍼뎀이 존재하며, Q3과 E스킬로 문도 박사의 저열한 기동성을 공략해 치고 빠지기 좋은 챔피언이라 매우 불리하다. Q3타의 에어본이나 궁극기를 패시브로 막을 수 있다는 것은 다행이지만 에어본을 막아도 후속 공격은 그대로여서 피해를 크게 입는 것은 똑같다. 심지어 몰락한 왕의 검을 주력으로 채용하는 챔피언이라 유지력도 충족되며 맞다이는 전 구간에서 성립하지 않는다고 봐도 무방. 상대의 요점은 강심 전까지는 스킬 교환 외의 딜교는 엄금, 강심이 뜬 후에도 요네가 E스킬을 켠 상태로 시도하는 딜교는 피하는 것. 요네의 E스킬은 준 피해의 일부를 되돌아가면서 주는 효과로, 즉 E스킬을 켠 요네는 가뜩이나 높은 W와 몰왕검의 퍼뎀이 더 높아지는 것과 다름없어 심각하게 아프기에 이기기 정말 어렵다."}, {"name": "피오라", "reason": "체력 비례 고정 피해가 잔뜩 들어오기 때문에 피오라가 2번 따이고 시작해도 어렵다. 또한 문도에게 접근할 수 있는 이동기를 보유하고 있으며 궁극기의 약점을 다 찔리면 당연히 못 이기고 다 찔리지 않더라도 약점에 찔린 것만으로 이미 문도는 너덜너덜해져 있다. 게다가 응수 역시 매우 불편한데, 뼈톱 한 방을 무시하고 역으로 높은 수치의 이속+공속 감소를 거는데 이동기도 없고 평타가 메인 딜인 문도에겐 두 효과 모두 치명적이다. 심지어 문도는 패시브 때문에 기절은 막지만 정작 둔화는 막을 수 없다는 것이 다른 방향으로 피오라를 상대하기 어렵게 만든다. 응수는 하드 CC기를 맞으면 둔화가 기절로 강화되는 효과가 있는데, 이 때문에 다른 챔피언은 하드 CC기를 아끼거나 사용 타이밍을 꼬아서 기절을 맞지 않으려고 노력하며 반대로 피오라도 상대의 CC 타이밍까지 응수를 아껴 두지만, 문도는 어차피 하드 CC가 전혀 없으므로 싸움이 열릴 때마다 피오라가 부담 없이 지르는 응수에 맞고 둔화에 걸려 1대1 구도에서 큰 손해를 보기 때문이다."}, {"name": "케인(정글)", "reason": "탱커 저격하는 수준의 스킬셋을 기반으로 뛰어난 전투 지속력을 자랑하고 다르킨 학살자 케인의 주력 딜링기인 살상돌격(Q)의 기본 깡딜이 최대 체력의 6%인데 한 번 쓸 때 두 번 휘둘러 스킬 한 방에 체력 12%가 순식간에 녹고 쿨타임도 4초 정도로 굉장히 빠르다. 몰아치는 낫(W)은 패시브로 무마시킬 수 있으나 문도의 패시브보다 쿨타임이 더 빨리 차서 계속 싸우면 문도가 에어본만 띄워져 무한 방방이 세례를 당할 수 있다. 가장 큰 문제점은 그림자의 지배(R)인데 가면 갈수록 최대 체력 비례 대미지가 높아지기에 16레벨을 찍었다고 대인전을 이길 수 있는 상대가 아니다. 한타에서도 팀원과 함께 다르킨 케인을 잡겠다고 나서다가 오히려 케인의 피만 채워주는 꼴이 될 수도 있으므로 그냥 문도의 우수한 돌파력으로 케인을 무시하고 적 딜러를 물러가는 게 낫다."}], "general_counters": ["피오라", "바루스", "베인", "그웬", "가렌", "일라오이", "나서스", "아트록스", "요릭", "트린다미어", "트런들", "암베사", "마스터 이(정글)", "킨드레드(정글)", "벨베스(정글)"]}
{"champion": "미스 포츈", "aliases": ["미포", "미스포츈"], "hard_counters": [{"name": "야스오", "reason": "미스포츈이 제일 싫어하는 최악의 하드 카운터. 야스오의 바람 장막에 평타, Q, 궁극기가 전부 다 막힌다. 설령 장막이 쿨이라도 에어본을 이용하여 미포를 방해할 기회가 충분히 많고, 그 에어본이 없어도 충분히 질풍검(E)으로 궁극기 범위 밖으로 나갈 수 있다. 초반 라인전도 야스오가 더 강하고, 후반으로 간다 하더라도 에어본에 맞고 최후의 숨결(R)에 띄워진다면 점멸이 없다면 거의 살아남을 수 없다. E스킬로 야스오의 패시브 보호막을 쉽게 빼는 게 가능하다는 게 유일한 위안거리인 최악의 상대."}, {"name": "브라움(서폿)", "reason": "답이 없다. 대회에서도 미스 포츈의 티어가 높아지면 브라움이 꼭 튀어나올 정도. 브라움의 불굴과 궁 둘 다 미포의 궁극기를 각각 차단/방해할 수 있다. 특히나 브라움의 불굴을 빼내기가 쉽지 않은 편으로, 브라움이 있으면 미포의 존재감이 많이 흐려진다. 브라움이 계속해서 미포를 주시하고 불굴을 박아서 궁 각을 차단하면 미포는 거기서 잉여가 되며, 그게 아니더라도 브라움은 궁극기로 미포의 궁을 끊어버리는 선택지가 있어서 게임 내내 고통받다가 궁 한번 제대로 못 쓰고 끝나는 경우가 많다. 웃기게도 파트너로 만난 경우엔 조합이 괜찮은 편."}, {"name": "신 짜오( 정글)", "reason": "맞라인에서 만날 일은 없지만 딱 그것뿐이다. 삼조격 에어본/찌르기 둔화/타겟팅 몸빵 둔화에 일정 거리로 밀어내고 그 범위 바깥에 있는 피해를 차단하는 궁극기 등, 미스 포츈에게 악재가 될 만한 조건을 전부 다 갖췄다. 뚜벅이인 미포에게 들러붙기 쉽게 설정되어있는 신 짜오로부터 도망가는 게 거의 불가능할 뿐더러 궁을 어디서 쓰나 맞궁에 막힌다. 신 짜오는 유통기한 챔프이지만 교전 개시 능력이 뛰어나서 진영이 한순간에 망가지고 미포가 물려 집중 포화로 저승사자와 데이트할 확률이 높다."}], "general_counters": ["루시안", "드레이븐", "사미라", "애쉬", "노틸러스", "레오나", "블리츠크랭크", "쓰레쉬", "파이크", "릴리아", "아무무"]}
{"champion": "밀리오", "aliases": [], "hard_counters": [{"name": "블리츠크랭크, 쓰레쉬, 노틸러스, 파이크 등 그랩류", "reason": "밀리오 최악의 카운터들. 대부분의 물몸 뚜벅이들의 천적으로 궁극기가 에어본을 풀 수 없기 때문에 이런 챔피언들을 상대로는 큰 의미가 없어진다. 특히 그랩류 챔피언들은 8할은 서폿으로 쓰며 픽률도 높기 때문에 자주 보인다는 것도 큰 악재다."}], "general_counters": ["알리스타", "니코", "제라스", "자이라", "브랜드", "벨코즈", "럭스", "카르마", "흐웨이", "소라카", "소나", "바드", "진", "케이틀린", "드레이븐", "세나"]}
{"champion": "바드", "aliases": [], "hard_counters": [], "general_counters": ["노틸러스", "블리츠크랭크", "쓰레쉬", "알리스타", "아무무", "레오나", "애니", "카르마", "럭스", "벨코즈", "브랜드", "제라스", "세나", "흐웨이", "이즈", "시비르"]}
{"champion": "바루스", "aliases": [], "hard_counters": [{"name": "시비르", "reason": "극카운터. 주문 방어막에 바루스의 모든 딜링기가 막히며 성장성이 밀리는 것도 아니라 원딜 중에선 극상성으로 취급된다."}, {"name": "야스오", "reason": "바루스가 어떤 빌드로 가든 바루스의 대표적인 하드 카운터. 원래도 원거리 딜러의 천적인 야스오이나, 바루스의 스킬을 야스오가 바람 장막으로 막거나, 질풍검으로 모조리 회피할 수 있어 매우 힘들다. 심지어 야스오는 원거리 상대로도 라인전이 강하기 때문에 라인전부터 강하게 압박한다는 바루스의 플레이를 카운터치는 것이 가능하다. 질풍검 회오리에 잘못 맞아 야스오에게 궁 각, 킬 각이 바로 잡히는 경우도 부지기수. 맞라인을 선다면 극초반에 밟아놓는 게 최선이지만, 다른 라인에서 왕귀해서 오는 야스오는 그마저도 안 된다."}, {"name": "올라프(탑)", "reason": "바루스가 어떤 빌드로 가든 바루스에게 있어서는 가장 최악의 상대이자 위의 모데카이저와 반대 이유로 보다 더 악랄한 챔피언. 모데카이저가 후반 한타에서 진실의 방을 이용해 바루스를 제압하기 쉬워서 상대하기 어렵다면, 올라프는 초중반 휘몰아치는 스노우볼링으로 바루스가 기를 펴기도 전에 뚝배기를 깨뜨려서 어렵다. 올라프의 Q는 최대 사거리 1000에 파밍과 포킹, 둔화와 방깎을 다 주는 스킬로, 흔하진 않지만 탑에서 만나면 포킹엔 맞포킹, 맞딜하면 맞딜로 찍어누른다. 6렙 이후에는 궁극기를 켜고 달려오는 올라프는 모든 CC기를 개무시하고 달려들기 때문에 원딜이더라도 모든 아군을 무시하고 달려오는 올라프에게 바루스가 아무리 궁극기와 E의 CC기가 있어도 발을 묶을 수 없으며, 심지어 바루스는 이동기가 아예 없는, 기동성이 원딜 최하위라 도끼에 한번 맞는 순간 달려드는 올라프에게 벗어날 수 없어 300원을 헌납한다. 탑 바루스에게는 상대 승률이 40% 정도만 나와도 우세한 지표이며, 일반적으로는 항상 상대 승률이 30% 정도에 머무는 최악의 카운터. 비록 후반에는 돌진하기 전에 딜로 찍어누르겠지만, 적어도 올라프는 후반을 가게 두지 않을 것이다. 딜로 찍어누른다는 해결법도 바루스를 옆에서 보조해줄 수 있는 아군이 한 명 이상 있다는 가정 하에서나 성립하고, 순수 1:1로는 후반에도 여과 없이 처참히 찢긴다"}], "general_counters": ["진", "럭스", "제라스", "브랜드", "자이라", "카르마"]}
{"champion": "바이", "aliases": [], "hard_counters": [{"name": "녹턴", "reason": "바이와 녹턴은 모두 암살자와 전사의 중간 정도 되는 스킬을 갖고 비슷하게 공격적인 역할을 수행한다. 자연히 자주 마주쳐서 싸우게 되는데, 바이의 스킬들은 모두 시전 모션이 상당히 뚜렷하고 비교적 느린 탓에 어둠의 장막에 쉽게 막히므로 전투에서 불리한 위치에 있다. 피해망상의 긴 사거리를 바탕으로 성장 위주 플레이를 하다가 역갱을 보기도 상대적으로 편하고, 추가적으로 시야를 끊어 바이를 팀으로부터 고립시킬 수도 있기 때문에 바이 입장에서 상당히 힘들다."}, {"name": "카서스", "reason": "정글로 만났을 때 카서스가 반갈 밑캠 인베이드 후 바텀 다이브를 해 버리면 4레벨 이전에 매우 약한 바이가 이를 대처할 수단이 아예 없다. 정작 맞다이 자체는 이후에 바이가 이길 확률이 높지만 반갈 운영을 해 버리면 필연적으로 동선이 반대로 갈리기 때문에 애초에 만날 일이 없어져 버린다. 성장 속도나 포텐도 바이에 비해 훨씬 높기 때문에 매우 까다로운 카운터이다."}], "general_counters": ["신 짜오", "뽀삐", "엘리스", "킨드레드", "판테온", "마스터 이", "트런들", "오공", "세트", "워윅", "우디르", "올라프"]}
{"champion": "베이가", "aliases": [], "hard_counters": [{"name": "제라스", "reason": "사거리 긴 챔피언 중에서 가장 힘든 상대이다. 다른 챔피언들의 포킹은 피할 여지라도 있으나, 제라스의 비전 파동(Q)은 범위형 즉발이기 때문에 줄창 얻어맞아야 하며, 라인 푸시력마저 넘사벽이기 때문에 베이가가 제대로 파밍할 여지를 주지 않는다. 특히 미드에서 만나면 더 심하다."}, {"name": "카사딘", "reason": "전통적으로 베이가를 거의 모든 상황에서 농락하는 극상성이다. 베이가의 장점을 살려 후반을 바라보려고 해도 카사딘 또한 약속의 16레벨이라고 불리는 최강의 왕귀 타이밍을 가진 챔피언이다. 마법 피해를 덜 받는 패시브 때문에 딜이 생각보다 덜 박히는 건 덤. 극후반에 가면 한타 영향력은 베이가가 우위니 한타로 승부를 보자. 카사딘을 상대할 때 한 가지 팁이 있다면 후반에는 꼭 마방템을 섞으라는 것. 카사딘은 근접 진입 챔피언인 특성상 상대를 원콤을 못 내면 존야의 모래시계 외에는 무적기가 없기 때문에 오히려 카사딘이 위험해진다."}], "general_counters": ["피즈", "제드", "르블랑", "오리아나", "빅토르", "벨코즈", "직스", "흐웨이", "모르가나", "탐 켄치", "질리언", "파이크", "노틸러스", "블리츠크랭크", "쓰레쉬", "레나타 글라스크", "이즈리얼", "시비르"]}
{"champion": "베인", "aliases": [], "hard_counters": [{"name": "미스 포츈", "reason": "바루스와 함께 통계상으로 증명되는 하드 카운터다. 라인전이 워낙 강하기에 베인으로 절대 라인전을 이길 수 없으며, 사거리도 베인보다 더 길어 강력한 압박이 가능하다. 웬만하면 밴하거나 밴하지 않았는데 나왔다면 닷지를 하자. 선제공격을 들고 온 미스 포츈은 후반에라도 압살할 수 있지만 집중 공격을 들고 온 미스 포츈은 후반에 베인이 접근하는 순간 평-Q-평으로 베인의 반피 이상을 까버린다."}, {"name": "야스오", "reason": "이렐리아와 비슷하게 무력으로 라인전이 밀리는 하드 카운터. 탑과 바텀 어디에서 만나든 야스오가 숙련된 유저라면 답이 없다. 탑 베인이 라인전이 강한 이유는 은화살의 최대 체력 비례 고정 피해와 선고로 브루저들의 접근을 저지하는 선고와 구르기를 기반으로 한 카이팅에서 나오는데, 야스오는 질풍검으로 끈질기게 베인에게 붙을 수 있고 바람 장막으로 선고와 평타를 막아낼 수 있고 지속 딜도 강해서 탑 베인을 기용한 장점이 퇴색된다. 바텀에서 만난다면 대표적인 초반 라인전 약캐인 베인이 바텀 야스오를 이기는 건 서포터 상성이 매우 유리한 게 아니라면 사실상 불가능하다. 작정하고 야스오가 몰락한 왕의 검 등 1대1 아이템을 두르면 후반에도 이기기가 쉽지 않다. 게다가 이쪽은 탑, 미드, 바텀 세 포지션 전부 채용률이 낮지 않아서 야스오가 픽창에 올라오면 베인 자체를 픽하지 않는 게 좋다. 야스오를 상대로 버티기 너무 힘들다면 란두인의 예언을 올려 보자."}, {"name": "하이머딩거", "reason": "매우 빠른 라인 푸시력과 악랄한 견제력 때문에 탑에서 만나든, 바텀에서 만나든 베인의 최악의 하드 카운터 중 하나다. 물론 라인전 이후 힘이 빠지는 챔피언이긴 하나, AP 누커라는 특성상 한타 때도 위협적인 광역 딜을 넣을 수 있기 때문에 라인전을 버텨도 쉬운 상대가 아니다. 강화 포탑을 세우고 버티는 하이머딩거에게는 베인의 인파이팅도 역효과를 낳을 수 있다."}, {"name": "말파이트(탑)", "reason": "밴 대상 1순위. 상대 승률이 40%도 채 안 되는 동시에 라인킬 확률이 7:3까지 밀리는 탑 베인의 최악의 카운터이며, 거의 모든 지표에서 압살당한다. 외부의 개입 없이 자력으로 말파이트를 솔킬 내는 것은 아예 불가능한 정도로, 이 둘의 구도는 탑 전체, 더 나아가 협곡 전체로 범위를 넓혀봐도 찾기 힘든 극상성이다. 비슷한 카운터인 티모는 장인픽이기 때문에 탑 베인을 선픽할 경우 가장 높은 확률로 마주칠 챔피언이기도 하기에 베인 입장에서는 악몽 그 자체. 이론상으론 말파이트의 방어력을 완벽하게 무시하는 은화살이 존재해서 쉬울 것 같지만, 공격 속도를 줄이는 지면 강타를 맞는 순간 그 은화살이 안 터져서 바보가 된다. 또한 평타 견제를 하려면 지진의 파편 사거리에 들어올 수밖에 없기 때문에, 말파이트의 스킬셋이 완성되지 않은 1~2렙 타이밍만 베인이 유리하고 그 이후로는 쿨마다 초코파이를 강제급여당하며 계속 고통만 받다 궁극기에 당해 죽는 패턴이 반복된다. Q에 붙은 둔화 때문에 패시브를 통한 카이팅도 봉쇄된다. 궁극기가 선고를 무시하는 데다 라인 푸시력마저 말파이트가 더 뛰어나다는 건 덤. 한타 기여도는 말할 필요가 없이 말파이트가 압도적으로 우월하다. 지면 강타를 통한 전담 마크, 그리고 갱 호응까지 좋은 엄청나게 까다로운 상대이다. 오죽 카운터로 악명이 높으면, 베인 장인들은 기발+도방+재바로 드러누워 버리거나 아예 탱템 올려서 킬이라도 안 주는 게 대처법이라고 할 정도."}, {"name": "티모(탑)", "reason": "말파이트와 쌍벽을 이루는 탑 베인의 최악의 카운터이다. 심하면 상대 승률이 40% 아래까지 내려가는 절대로 이길 수 없는 상대이며, 후술할 공략법으로 한두 번 따고 시작해도 못 이길 정도로 심각하다. 베인은 기본적으로 공격 수단이 평타뿐이라서 티모의 실명 다트 1방에 모든 공격 수단을 상실하며, 6레벨 이후 탑에 깔리는 버섯의 딜은 매우 아프다. 논타겟 스킬이 없는 베인 혼자의 힘으로는 절대 티모의 은신을 풀 수 없는 건 덤이다. 티모의 사거리는 500이고 베인의 사거리는 550이라는 점을 이용해서 라인전 도중 평타를 눈치껏 넣는 방식으로 싸워야 한다. 하지만 실명 다트의 사거리가 베인의 사거리보다 길어 눈치껏 넣는 방식마저도 손해를 볼 수도 있다. 짧게 딜교환을 했을 경우에도 똑같이 때리면 베인이 손해를 보기 때문에 비슷한 실력일 경우 베인이 매우 불리해진다. 후반 사이드 운영으로 가도 티모의 버섯이 베인보다 악명이 높으면 높았지 낮지도 않다."}, {"name": "오공(탑)", "reason": "탑 오공이 통계상으로 잘 나오는 픽은 아니지만 상대 승률 45% 이하의 하드 카운터이다. 근두운 급습의 사거리가 베인의 평타 사거리보다 길기 때문에 근접전을 강제할 수 있으며, 돌진기를 선고로 밀어낼 수 있지만 오공은 쿨이 절반이나 짧은 근두운 급습으로 다음 턴에 다시 교전 각을 잡을 수 있다. 2~5레벨 구간에서 오공이 과욕을 부릴 때 이득을 취하지 않으면 6레벨 이후부터는 영영 압도당하는 상성이다. 기동성이 뛰어나면서도 앞서 언급한 이렐리아나 야스오와 달리 가렌이나 다리우스 등 이동기가 없는 브루저와 비교를 해야 할 정도로 브루저 상위권의 체급을 가진 데다 기동성/하드 CC기까지 모두 갖춘 챔피언이므로 매우 상대하기 까다롭다. 왕귀를 노리려고 해도 오공의 한타 기여도는 최상위권이라 시간이 베인, 그것도 탑 베인의 편이라고 장담할 수 없다."}, {"name": "아칼리(탑)", "reason": "엄청난 기동성으로 선고를 써도 계속 따라오고 순간 폭딜도 베인을 찢기에는 충분하다. 또한 황혼의 장막은 베인의 모든 공격 수단을 차단한다. 탑 베인의 하드 카운터이며, 후술할 이블린과 함께 매우 상대하기 어려운 암살자이다."}], "general_counters": ["드레이븐", "칼리스타", "루시안", "바루스", "애쉬", "케이틀린", "코그모", "트위치", "룰루", "나서스", "요릭", "이렐리아", "판테온", "잭스"]}
{"champion": "벡스", "aliases": [], "hard_counters": [{"name": "카시오페아", "reason": "최악의 하드 카운터. 라인전이고 맞딜이고 모조리 카시오페아가 압도한다. 카시오페아는 이동기가 하나도 없으므로 우울 패시브를 묻힐 수가 없고, 그나마 벡스 스킬 중에서 사거리가 긴 Q 포킹도 카시오페아가 피하기 쉽다. 더군다나 맞딜을 넣으려면 카시오페아 사거리 내에서 교전해야 하는데 카시는 명실상부 지속딜 깡패이다. 우울 표식이 없는 상태에서 공포 묻히고 스킬들 다 맞혀도 풀피의 카시를 잡는다는 보장은 없으며, 거기서 못 잡으면 바로 석화 걸리고 반격당해서 역으로 털린다. 궁극기 돌진이 카시의 늪에 막히거나 맞궁으로 대처해서 그대로 조공을 당하는 것도 악재이다. 궁극기 돌진이 저지 불가이지만 카시 궁의 선딜 때문에 충돌 후 카시의 궁에 맞거나 긴 기절 지속 덕분에 저지 불가 판정 도중에 맞아도 충돌 후 저지 불가가 풀리는 동시에 기절에 걸리기 때문에 후속 콤보를 못 쓴다."}, {"name": "애니", "reason": "의외의 하드 카운터. 사거리 자체는 벡스가 좀 더 길지만 벡스의 스킬 특유의 딜레이와 용암 방패(E) 이속 증가로 인해 생각보다 스킬들을 맞히기 쉽지 않으며 애니 역시 이동기가 없기에 우울 표식이 묻지 않는다. 반대로 애니는 스킬들의 사거리가 짧더라도 피할 수 없는 즉발이거나 타겟팅이기 때문에 애니 상대로 사거리가 그리 길지도 않고 적중하기 쉬운 하드 CC기가 없는 데다 뚜벅이인 벡스가 회피하기 힘들다. 게다가 애니는 사거리가 짧아서 문제지 상대가 접근을 해준다면 오히려 고마워하며 즉발 스턴으로 시작하는 풀콤보의 엄청난 폭딜을 거의 즉발로 넣어 상대를 역관광 낼 수 있는데 이는 한타에서 적에게 접근해서 딜을 넣어야 한다는 벡스의 전투 방식을 그대로 카운터치며 하이 리스크라는 단점을 부각시킨다. 심지어 사이드 주도권과 한타에서의 활약 역시 애니의 명백한 우세이다."}, {"name": "제드", "reason": "제드의 W 첫 시전 자체로는 바로 이동하는 것이 아니고, 재시전을 해서 이동을 완료해야 벡스의 패시브가 장전되기 때문에 그림자 견제에 매우 취약하다. 만약 제드가 W를 재시전했다면 그건 제드가 킬 각을 잡았다는 소리니 이땐 한가하게 패시브 추가 딜을 터트릴 여유가 없다. 제드가 궁극기를 사용하면 잠시 공포로 제드의 딜 타임을 줄일 수는 있으나 그것뿐이며, 다시 달라붙는 게 가능해서 도주도 제한되는 하드 카운터 중 하나다. 특히 벡스의 궁을 씹는 데 성공한다면 동귀어진도 안 된다. 다만 제드 또한 한타에선 벡스의 스킬셋에 취약하므로, 어떻게든 라인전을 넘길 수만 있다면 편해진다."}], "general_counters": ["제라스", "벨코즈", "직스", "니코", "럭스", "신드라", "탈리야", "스웨인", "블라디미르", "애니비아", "라이즈", "말자하", "오리아나", "빅토르", "베이가", "아리"]}
{"champion": "벨베스", "aliases": [], "hard_counters": [{"name": "람머스", "reason": "극단적인 공속형 챔프인 벨베스에게 람머스는 상당한 난적이다. 성장형 챔프인 벨베스는 안 그래도 크게 높지 않은 공격력이 패시브로 너프까지 받기 때문에 높은 공속은 반사딜만 올릴 뿐이고, 벨베스가 엄청 잘 크지 않은 이상 후반에도 벨베스의 공속이 오른 만큼 반사딜도 더 자주 맞으므로 람머스를 꺾기 힘들다. 심지어 람머스는 E를 끊을 수 있는 CC기를 여러 개 보유하고 있고, 그중 하나는 자신을 때리도록 강제하는 도발이다. 제일 문제는 R의 패시브 고정 피해는 대상이 바뀌면 그대로 초기화된다는 점 때문에 한타 시나 교전 시에 벨베스가 적 딜러나 서포터를 물어 죽이려 할 때 람머스가 도발 한 번만 걸면 그 즉시 저지되며 천 번 찔린 가오리 신세가 된다."}], "general_counters": ["뽀삐", "탈리야", "킨드레드", "아무무", "볼리베어", "트런들", "판테온", "올라프", "워윅", "티모(탑)", "말파이트(탑)", "나서스(탑)", "잭스(탑)", "레넥톤(탑)"]}
{"champion": "벨코즈", "aliases": [], "hard_counters": [{"name": "파이크", "reason": "뛰어난 이동기를 가진 챔피언에도 속한다. 다른 그랩류, 돌진류 서포터와 달리 하드웨어는 약한 편이지만 대신 유지력이 좋고 은신과 뛰어난 이동기까지 지녔다. 파이크는 벨코즈의 궁극기도 쉽게 회피하거나 끊어버릴 수 있고, 반대로 벨코즈가 파이크의 궁극기에 대처할 만한 방법은 없다."}, {"name": "카사딘(미드)", "reason": "패시브의 마법 피해 감소와 Q의 마법 방어막으로 벨코즈의 마법 피해를 경감할 수 있으며, 6레벨이 되어 궁극기를 배우면 스킬을 맞히기가 까다로워진다. 벨코즈의 궁극기를 Q로 끊어버릴 수 있는 것은 덤. 물론 벨코즈는 라인 클리어 능력이 뛰어나서 라인을 몰아넣어 카사딘을 압박할 수는 있지만, 갱 방지 능력과 로밍 능력은 바닥 수준이라 카사딘이 6레벨만 되어도 섣불리 타워 바깥을 나다니기 어려워진다."}, {"name": "야스오(미드)", "reason": "야스오 본인에게 문제가 있는 것이 아니라면 하나부터 열까지 벨코즈를 압도한다. 라인에서 싸울 때에는 E스킬을 사용하여 벨코즈의 스킬을 요리조리 피할 수 있다. 게다가 야스오는 진입 능력이 뛰어난 챔피언에도 속하는데, 라인전 때는 E스킬을 미니언에게 사용하여 벨코즈를 향한 쾌속 접근이 가능하며, 한타 때에는 Q스킬의 에어본을 통해 에어본 상태의 아군이나 벨코즈한테 궁극기를 사용해 원활하게 접근할 수 있다. 바람 장막(W)에 Q스킬, W스킬 1타, 상황에 따라서는 E까지 막히는 만큼 스택 중첩과 딜링이 어렵기도 하다."}], "general_counters": ["노틸러스", "레오나", "블리츠크랭크", "쓰레쉬", "파이크", "아칼리", "요네", "제드", "키아나", "피즈", "이렐리아", "르블랑", "카타리나"]}
{"champion": "볼리베어", "aliases": ["볼베"], "hard_counters": [{"name": "베인", "reason": "극상성. 구르기와 선고라는, 볼리베어의 추격을 뿌리칠 수단이 무려 2개나 있다. 선공권이 아예 없으며, 심지어 최대 체력 비례 고정 피해 때문에 탱템을 아무리 올려도 피가 쭉쭉 닳는다. 라인을 당겨 정글을 부르는 것이 라인전을 타개하는 사실상 유일한 방법. 그나마 파훼법이라 한다면 Q 선마와 점화. 포탑까지 라인이 당겨진 상태에서 베인이 앞구르기를 시전할 경우 바로 Q를 켜 접근하는 방법이다. 베인은 구르기를 써버린 상태라 거리가 조금이나마 좁혀진 상태고, 빠른 이속으로 접근하는 볼베를 선고로 밀어낸다 해도 Q 쿨 초기화로 다시 붙을 수 있기 때문. 이후 점화와 압도적인 순간 화력으로 베인을 녹여버리면 된다. 근데 이마저도 볼베가 E를 잘못 사용하거나 레벨이나 템이 어느 정도 갖춰진 베인이 맞궁을 켜고 대응한다면 승률이 급감한다. 서로 궁이 찍히기 전 초반에 승부를 보는 게 관건."}, {"name": "케넨", "reason": "라인전 초반 승률이 45%에도 미치지 못하는 극카운터 중 하나다. 케넨의 번개 질주(E)는 1레벨부터 이속 증가량과 쿨타임 모두 볼베의 번개 강타(Q)보다 우수하다. 케넨은 그냥 라인전 내내 견제하다가 볼베가 Q를 쓸 때 맞E로 째면 볼베는 자력으로는 케넨 털끝도 못 건드린다. 그나마 CS를 포기하며 체력을 관리한 후 6렙 찍고 궁극기를 이용해 물어볼 수는 있으나, 선딜이 길어서 맞히기도 어렵고, 케넨이 저지 불가 시간을 잘 재서 기절 걸고 튀면 이후에는 다시 일방적으로 처맞는다. 게다가 후반에도 궁+존야로 광역 딜링+스턴이 가능한 케넨의 영향력을 더 높게 치기 때문에, 볼리베어가 초중후반 모두 힘을 쓰기 어렵다."}, {"name": "잭스", "reason": "대부분의 장인들도 인정하는 하드 카운터. 초반이 약한 챔프들 중에서 유일하게 볼리베어가 라인전 우위를 점하지 못하는 챔프다. 기본적으로 맞딜 자체는 잭스가 허약한 초반엔 볼베가 우위에 있지만 문제는 반격(E). 잭스의 반격 하나에 볼리베어의 Q, W가 다 막혀서 딜교에서 히트 앤드 런 방식으로 치고 빠지는 잭스에게 볼베는 일방적으로 피해만 입고 손해만 보게 된다. 이를 파훼하려면 잭스와의 반격 심리전을 이겨야 하는데, 결국 주도권은 잭스에게 있으므로 매우 불리한 심리전이다. 시간이 지날수록 잭스의 딜링은 감당 안 될 정도로 강력해지면서 반격의 쿨타임도 매우 짧아지므로 상대하기 더욱 힘들어진다."}], "general_counters": ["카시오페아", "그레이브즈", "킨드레드", "칼리스타", "퀸", "갱플랭크", "나르", "뽀삐", "하이머딩거", "바루스", "아칼리", "쉔", "티모", "블라디미르", "일라오이", "마스터 이", "올라프", "오공", "럼블", "클레드", "아트록스", "신지드"]}
{"champion": "브라움", "aliases": [], "hard_counters": [], "general_counters": ["잔나", "카르마", "유미", "벨코즈", "브랜드", "자이라", "소나", "소라카", "제라스", "럭스", "바드", "세나", "베이가", "애니", "니코", "타릭", "질리언"]}
{"champion": "브라이어", "aliases": ["브라"], "hard_counters": [{"name": "람머스", "reason": "만나면 진지하게 닷지를 고려해야 하는 상대. 원래부터 평타 위주 AD 챔피언을 잘 때려잡기로 정평이 나 있는데, 브라이어는 람머스에게 당할 수 있는 최악의 수를 전부 체험할 수 있어서 더욱 극단적인 상성이다. 특히나 전열에 서는 특성상 브라이어의 W나 R에 의한 광분 어그로를 끌어주기 매우 쉬운 데다가, 그나마 브라이어가 정신 차리고 도주하려고 해도 즉시 E로 도발을 먹이거나 Q 구르기 혹은 궁으로 끝까지 쫓아갈 수 있다. 당연히 동성장 기준으로 1대1에서는 뭘 해도 이길 수 없다. 심지어 메타 픽도 아니라서 밴 때리는 것도 상당히 애매하니 이리저리 골치 아픈 존재. 그나마 느린 정글링 속도를 이용해서 카정 등으로 성장 차이를 조금씩 벌리는 게 답이긴 하지만 레벨 차이를 벌려 놓고도 가갑을 거의 필수로 가는 람머스에게 1:1이 밀리고 한타 때 람머스가 진입을 막고 버티면서 도발까지 걸면 아무것도 못하고 그대로 녹아버릴 정도로 상당히 까다로운 상대이다."}, {"name": "잭스", "reason": "기본 공격을 방해하는 챔피언들 중 가장 최악으로 답이 없다고 봐도 무방하다. 반격도 있지만, 대인전이 브라이어보다 훨씬 강해서 동성장 기준으로 이기는 게 거의 불가능하다. 그나마 정글 잭스는 픽률이 낮다는 게 위안거리지만, 탑 잭스도 스플릿은 상대가 안 되는 데다가 한타에서도 반격의 기절로 상대 딜러를 물려는 브라이어를 마킹하기 쉬워 까다로운 상대다. E로 밀쳐내 반격을 피할 수는 있으나 잭스에게도 도약이 있으며 심리전 주도권이 잭스에게 있는데다 게임이 진행될수록 스킬 가속과 존야로 반격을 두 번 이상 돌릴 수 있게 되는 잭스 입장에서 서로 E를 교환하기만 해도 이득이다."}, {"name": "신지드(탑)", "reason": "천상계와 심해를 막론하고 대표적으로 거론되는 브라이어의 하드 카운터. 브라이어의 핵심 스킬인 QW 모두 신지드의 초강력 접착제(W) 위에선 사용이 불가능하다. 거기에 광기의 물약은 사용 시 맹독의 자취(Q)에 치유 감소 효과가 굉장히 골치가 아픈 것도 모자라, 맹독의 자취의 독가스가 주딜인 챔피언이라 신지드한테 어그로 잡혀서 독가스 따라 달리다가 혼자 피가 까지고 자멸하는 어처구니없는 경우가 자주 발생한다. 게다가 신지드는 독가스 딜링을 극대화하기 위해 라일라이의 수정홀 슬로우 효과와 각종 이속템을 코어템으로 삼기에, 브라이어가 잘 성장했다 하더라도 신지드에게 거의 피해를 줄 수 없다. 다시 말해서, 신지드는 그냥 자기 앞에 W 뿌리고 도망가다가 적당히 E로 넘겨서 추격 각을 조절하면 완벽하게 농락할 수 있다. 다대다 싸움에서 브라이어가 다른 챔피언한테 불가항력적 죽음(R)을 맞히고 들어간다 해도, 신지드는 그냥 브라이어 아래에다 접착제 뿌리면 스킬이 대부분 봉인된 브라이어는 손쉽게 상대방한테 두들겨 맞고 산화해버린다. 신지드한테 맞힌다 해도 똑같이 접착제 뿌리거나 그냥 궁극기를 사용해서 저 멀리 달려버리면 끝이다. 그럴 경우 광분 상태를 조정하는 오싹한 비명(E)이 허무하게 빠져 이후 광분 상태에서 아무것도 못 하고 죽을 확률마저 높다. 신지드는 픽률이 낮은 장인 챔피언이니, 만일 픽창에 얼굴을 비췄다면 그날 운 다 썼다고 생각하고 바로 닷지하는 게 정신건강과 점수에 이롭다."}], "general_counters": ["판테온", "탈리야", "뽀삐", "렉사이", "말파이트(탑)", "쉔(탑)", "일라오이(탑)"]}
{"champion": "브랜드", "aliases": [], "hard_counters": [{"name": "신드라(미드)", "reason": "하드 카운터. 기절을 걸 수 있는 Q-E는 관통이라 브랜드의 기절보다 적중시키기 쉽고, 핵심 스킬인 Q스킬의 쿨타임도 짧다. 먼 거리에서는 W나 W-E로밖에 견제할 수 없는 브랜드와는 달리 Q를 난사하다가 E로 기절을 걸 수도 있는 신드라가 브랜드를 압도하기 쉽고, 신드라가 거리를 주지 않으면 신드라를 상대로 킬을 따내는 것은 불가능에 가깝다. 근접하더라도 신드라의 궁극기가 브랜드의 궁극기보다 단일 대상 피해가 우월하다."}], "general_counters": ["블리츠크랭크", "노틸러스", "파이크", "쓰레쉬", "제라스", "애니비아", "조이", "빅토르", "제드", "피즈", "샤코", "에코", "블라디미르"]}
{"champion": "블라디미르", "aliases": ["블라디"], "hard_counters": [{"name": "피들스틱", "reason": "전통의 카운터. 리메이크 전이나 후나 빨대를 끊을 수단이 없어 딜교환이 불가능하며, 블라디가 싫어하는 공포와 침묵을 전부 가지고 있다. 한타 파괴력도 블라디보다 전혀 꿀리지 않는다."}, {"name": "트린다미어", "reason": "블라디의 리메이크 전에는 거의 극상성 수준으로 불리했고 리메이크 이후 + 난입 룬 추가 이후로는 조금 숨통이 틔였지만 그래도 여전히 불리하다. 트린이 분노를 쌓고 회전베기로 들어오면 웅덩이를 안 쓰고 버틴다는 선택지는 없다. 미친 DPS와 치명타 로또 때문에 딜교환 성립이 불가능하기 때문에 웅덩이를 안 쓰면 체력이 펑펑 깎여나간다. 게다가 회전 베기와 피의 웅덩이 스킬 쿨타임 차이도 압도적으로 나기 때문에 주도권이라곤 도무지 쥘 수가 없다. 점화를 들고 가면 그래도 맞대응할 여지가 있지만 트린도 유체화-점화 같은 룬을 들고 오면 답도 없다. 트린도 노코스트에 자체 유지력 스킬을 보유하고 있기 때문에 유지력과 소모전으로 라인전을 풀어나가는 것도 불가능하고 어떻게든 잘 사린다고 해도 트린이 철거 룬과 첫 귀환 이후에 티아멧을 준비하여 무지성으로 라인을 밀고 철거 운영 + 오버파밍에 돌입하면 라인 푸시가 딸리고 CC기와 이동 스킬이 없는 블라디로 트린을 응징할 방법이 전혀 없는 것도 문제. 우주의 추진력과 존야의 모래시계가 나오고 스킬 가속이 갖춰지면 트린 상대로 얼마든지 버틸 수는 있지만 트린이 고수라면 거기까지 도달하는 것조차 어려운 편이며 무지성 사이드 운영도 막을 재간이 없고 심지어 합류 속도 역시 트린이 몇 배는 빨라서 게임 자체를 어지럽게 만든다."}, {"name": "아칼리", "reason": "최악의 하드 카운터. 일단 기본 스펙 차이가 심하다. 화력도 강한 데다 도주/추격 기동력이 정신 나간 수준인데다 장막으로 피의 격노를 쉽게 파훼할 수 있으며 지속딜이 뛰어난 아칼리를 2초 무적만으로 막는 것은 불가능하다. 아칼리의 표창곡예(E)를 웅덩이로 회피할 수 있지만 그게 끝이다. 후반 때 한타에서 비벼 볼 만하지만 블라디가 왕귀하기 전에 한타고 뭐고 그런 거 없다. 이동기가 없는 블라디는 아칼리의 장난감에 불과하다. 실제 승률이 6:4로 아칼리가 더 높으며 라인에서 안 만나길 빌거나 픽률이 낮은 챔피언이 아니니 밴을 넣는 것을 추천한다."}], "general_counters": ["초가스", "모데카이저", "퀸", "리븐", "클레드", "렝가", "레넥톤", "아트록스", "신 짜오", "암베사", "요릭", "가렌", "나서스", "다리우스", "럼블", "문도 박사", "올라프", "세트", "애니비아", "오리아나", "제라스", "조이", "카시오페아", "신드라", "럭스", "아리", "아우렐리온 솔", "오로라", "탈리야", "흐웨이", "직스", "벨코즈", "리산드라", "말자하", "라이즈", "퀸", "갈리오", "탈론"]}
{"champion": "블리츠크랭크", "aliases": ["블츠", "블리츠", "블랭", "블크"], "hard_counters": [{"name": "레오나", "reason": "라인전 구도만으로 따지면 알리스타보다 더 어려운 극상성이다. 일단 여진+일식이 발동되면 몸이 굉장히 단단해서 다른 스킬이 없을 때 끌어도 녹이기가 어려운데, 레오나를 끌면 오히려 천공의 검의 사정거리를 확보할 수 있으니 원딜에게 곧장 달려들어 지옥을 선사한다. 게다가 6레벨 이후에는 당기는 순간 원딜이나 블리츠크랭크 중 하나는 총합 3.25초의 하드 CC기를 먹고 죽는다. 그나마 천공의 검의 사거리가 짧은 편이라 적 원딜을 당겨서 상대하면 되지만 레오나도 그걸 뻔히 알기 때문에 계속 앞을 가로막을 것이다. 또한 라인전 뿐만이 아니라 한타 구도에서도 레오나를 끌면 레오나가 이니시를 쓰기 더 쉽게 해주는 원흉이 된다."}, {"name": "알리스타", "reason": "출시 당시부터 언제나 블리츠크랭크의 담당일진을 맡아왔으며, 블리츠크랭크의 화신 매드라이프도 공인한 하드 카운터 챔피언이다. 블리츠크랭크가 알리스타를 끌면 블리츠크랭크나 원딜, 혹은 둘 다 공중에 뜨고 한 명이 상대방 포탑으로 토스를 당하고 원딜을 끌어도 득달같이 달려와서 방해한다. 한타에서는 잘못 당기면 막강한 피해감소 궁극기로 딜을 버티고 아군을 단체로 공중에 띄울 수도 있다."}], "general_counters": ["갈리오", "노틸러스", "렐", "브라움", "아무무", "자르반 4세", "자크", "탐 켄치", "라칸", "샤코", "하이머딩거", "니코", "시비르", "루시안", "트리스타나", "이즈리얼", "칼리스타"]}
{"champion": "비에고", "aliases": [], "hard_counters": [{"name": "람머스", "reason": "만나면 닷지해도 될 정도의 극상성. 평타 기반, 피흡 챔피언인 비에고의 특성상 람머스의 W와 도발은 매우 치명적이다. 한타에서 람머스가 비에고를 마크하면 정말 아무것도 할 수가 없으며, 초반 정글 교전조차도 비에고의 승리를 장담할 수 없다."}, {"name": "워윅", "reason": "밴 대상 압도적 1순위. 다른 육식 정글러들은 얼추 성장하면 1대1은 가능하지만 워윅만큼은 절대 불가능하다. 일단 워윅은 대부분 버버두 3캠프를 돌리는데, 이걸 빠르게 먹고 바로 카정을 가서 정글링을 하는 비에고는 이걸 당하면 매우 힘들게 된다. 정글 유지력은 말할 필요도 없고 초반 맞딜도 비에고와는 비교가 안 되는 수준이다. 후반에도 하드 CC기의 존재로 인해 포커싱당하기 쉬운 것도 덤. 게다가 은신해 숨어도 피의 사냥으로 찾으면 그만이라 도망치기도 까다롭다."}, {"name": "말파이트(탑)", "reason": "모든 평타 기반 AD 챔피언의 카운터. 퍼뎀이 있긴 하지만 결국 물리 피해라서 엄청난 방어력 때문에 말파이트에게 흠집조차 내기 벅찬 건 물론 기본 공격 위주인 비에고는 지면 강타의 공격 속도 감소도 매우 치명적이다. 적의 AP 챔프를 뺏는 게 말파를 이기는 가장 쉬운 방법일 정도. 거기다 말파이트를 뺏어도 궁극기가 없기 때문에 별 쓸모가 없는데다 한타 기여도도 당연히 말파이트의 압승이다. 주 라인이 다르다는 게 그나마 위안거리."}, {"name": "일라오이(탑)", "reason": "극상성. 모든 근접 챔프들의 카운터로 비에고도 예외는 아니다. 스킬을 다 맞히면 강력한 일라오이에게 직선으로 돌진하는 비에고 같은 챔프로는 답이 없다. 일단 망령의 나락으로 진입할 때 일라오이의 영혼의 시험을 맞을 수밖에 없으며, 맞는 순간 맞딜 자체가 성립되지 않는다. 그나마 6렙 전에는 일라오이가 약하기 때문에 비에고가 유리하지만, 6렙 이후에는 물몸 비에고는 일라오이 촉수에 박살난다. 그리고 일라오이를 지배해도 궁극기가 없기 때문에, 아무 짝에도 쓸모가 없는 것은 덤."}], "general_counters": ["렉사이", "리 신", "녹턴", "니달리", "우디르", "그레이브즈", "볼리베어", "잭스", "오공", "트런들", "마스터 이", "판테온", "레넥톤(탑)", "나서스(탑)", "쉔(탑)", "아칼리(탑)", "티모(탑)", "암베사(탑)"]}
{"champion": "빅토르", "aliases": [], "hard_counters": [{"name": "다이애나", "reason": "초반에는 어떻게 비벼 볼 만하겠지만 문제는 6렙 이후, 거리를 많이 벌리지 않으면 피하기 힘든 Q의 피해는 물몸인 빅토르에게 큰 부담이고 E로 들어와 킬 각을 본다면 중력장과 궁의 침묵으로는 슬로우가 걸려 저지하지 못한다. 뚜벅이인 빅토르는 운이 좋아도 점멸을 빼고 살아가는 수준"}, {"name": "아칼리", "reason": "빅토르를 물기 좋은 최상급 기동성에, Q를 무력화하는 장막도 있다. 초반 라인전이 약하다는 단점이 있긴 하지만 마법 저항력과 체력은 높은 편이라 물몸 챔피언보다 몰아내기가 더 힘들다. 장막 때문에 이렐리아처럼 한타 상황에서 포커싱하기 쉬운 적도 아니고, 벽도 여러 번 넘을 수 있어 빅토르는 좀만 잘못하면 죽는데 아칼리는 잘못 들어와도 킬 캐치력이 부족하고 즉발 CC가 없는 빅토르를 상대로는 어지간하면 산다. 콩콩이, 주문작열, 운명의 재를 채용하자. 지속 피해를 받게 되면 아칼리가 장막에 들어가 있어도 계속 실루엣이 보이게 된다."}, {"name": "에코", "reason": "아케인 스토리의 재현. 빅토르는 붙는 챔피언에게 매우 약한데, 에코는 돌진이 2단이라 사거리가 긴 편이며, 패시브로 인해 치고 빠지는 능력 역시 좋다. 에코의 E 돌진은 사거리가 길어 거리를 안 주기도 힘들고, 중력장은 단독으로 에코의 기동력을 묶을 순 없다. 견제력은 빅토르가 우위지만 말 그대로 견제력만 우위일 뿐, 라인 푸시는 오히려 에코가 더 빨라 선공권이나 합류 주도권까지 에코에게 있다. 에코 또한 강력한 성장성을 가지고 있어서 같이 큰다 해도 안심할 수 없다."}, {"name": "키아나", "reason": "빅토르 최악의 카운터. 초반 라인전부터 빅토르를 압도하는 능력치+뛰어난 기동력의 암살자+빅토르보다 훌륭한 유지력+궁극기 때문에 강제 이니시가 가능함 등 빅토르에게 있어서 최악의 카운터라고 봐도 손색이 없다. 그나마 렝가는 이제 빅토르와 라인에서 마주칠 일이 거의 없기라도 하지, 키아나는 주 라인이 빅토르와 겹치는 데다가 아이템이 나오기 전까지는 주도권이 전혀 없는 빅토르를 시종일관 위협할 수 있기 때문에 초반부터 주도권을 그대로 넘겨주게 된다. 빅토르가 중력장을 써보려고 해도 키아나의 이동기와 은신 때문에 혼자서는 사실상 잡기도 힘들며 반면 빅토르는 키아나에게 한 번 포커싱당하면 십중팔구 못 살아남는다. 중후반 한타 기여도마저 키아나가 궁극기 때문에 전혀 꿀리지 않기 때문에 그야말로 빅토르가 완벽하게 압도당하는 픽."}, {"name": "올라프(탑)", "reason": "빅토르 최악의 상대. 그 어떤 구간에서도 빅토르가 절대 이길 수 없다. 초반 단계에서는 무한 Q의 슬로우로 이동기 없는 빅토르의 머리를 부수고, 중반 교전에서는 궁극기를 통한 CC기 무시로 달려와 도끼로 내려찍으며, 후반 단계에서는 이미 올라프가 마저를 챙기고 달려들어 썰린다. 탑에서 만나면 초반부터 킬을 헌납하고 썩을 것이고, 미드-탑으로 엇갈려도 탑에서 성장한 올라프를 만나면 애매한 사거리 때문에 올라프의 도끼를 맞으면 달려오는 올라프한테 썰리고 미드 성장과 관계없이 교전에서 박살나기 쉽다. 극 후반 한타에서야 비로소 빅토르가 그나마 할 일이 많지만, 그 전에 올라프가 모든 한타를 때려 부수고 고속도로를 뚫어서 게임을 끝내려 할 것이기 때문에 만나면 닷지하는 게 편한 상성."}], "general_counters": ["제드", "카사딘", "아리", "제라스"]}
{"champion": "뽀삐", "aliases": [], "hard_counters": [{"name": "워윅", "reason": "워윅의 돌진기인 Q와 무한의 구속(R)은 저지 불가여서 굳건한 태세에 막히지 않는데 이것만으로도 워윅이 우세를 잡는다. 또 대미지가 퍼센트로 경감되어서 뽀삐는 워윅을 잡기 힘든 반면 워윅은 하이브리드 피해와 강한 전투 지속력으로 무난하게 이긴다. 궁극기로 날리려고 해도 무한의 구속을 쓰거나 Q를 써서 피할 수 있으며 저지 불가가 달려서 굳건한 태세로 진입을 막는 뽀삐의 장점도 퇴색된다."}, {"name": "갱플랭크", "reason": "기본이 브루저에 평타 고정딜 패시브도 있어서 근접전이 약하지 않고, 어쩌다 실수해서 벽꿍 각을 내줘도 귤만 까먹으면 바로 탈출이 가능하다. 무엇보다도 뽀삐보다 더 긴 사거리에서, 더 짧은 쿨타임을 가진 착취 Q로 뽀삐의 체력을 계속 갉아먹어서 뽀삐의 라인전 강점이 아예 지워진다는 게 치명적이다. 술통의 방관 때문에 갱플 자체가 탱커를 잘 잡는 챔프라는 것도 문제."}, {"name": "블라디미르", "reason": "초반이 약하지만 그래도 뽀삐보다는 견제력이 우위라 크게 체감되지 않는다. 돌진기는 없는 데다가 뽀삐의 스킬을 피의 웅덩이(W)로 피할 수 있고 라인 유지력, 성장성, 한타 기여도 어느 하나 뽀삐에게 밀리는 점이 없다. 뽀삐로는 블라디미르를 압박하는 게 쉽지 않고 결국 블라디미르의 성장을 허용할 수밖에 없게 된다."}, {"name": "모르가나(서폿)", "reason": "밴 대상 1순위. 뽀삐의 모든 하드 CC기를 칠흑의 방패 하나로 완벽하게 무력화한다. 뽀삐의 주력 화력은 AD이기 때문에 마법 피해만 막는 블랙 실드를 뚫을 수가 없으며 모르가나는 돌진기가 없기 때문에 굳건한 태세가 효율이 없어진다. 또 돌진 의존도가 높은 뽀삐에겐 모르가나의 어둠의 속박도 대단히 성가시게 다가오는 것도 덤. 그나마 뽀삐의 작은 충돌 판정이 매우 큰 이점으로 작용하는 상대라는 게 불행 중 다행"}], "general_counters": ["가렌", "다리우스", "트런들", "올라프", "나서스", "요릭", "우디르", "초가스", "스카너", "나르", "라이즈", "말파이트", "럼블", "카르마", "하이머딩거", "탐 켄치", "문도 박사"]}
{"champion": "사미라", "aliases": [], "hard_counters": [{"name": "닐라", "reason": "챔피언 설계 자체가 사미라 맞춤형 카운터 수준이다. 사미라가 아무리 지표가 미쳐 날뛰고 OP 티어까지 올라가도 닐라를 상대로는 항상 45~46% 정도의 상대 승률을 유지할 정도로 매우 불리한 상성이다. 닐라의 평타와 Q는 투사체가 아니므로 사미라의 장막을 전부 뚫을 수 있으며, 닐라는 아군에게도 써지는 E 스킬을 두 번 충전할 수 있어 사미라가 접근하건 도주하건 쉽게 빠지거나 쫓아갈 수 있다. 닐라의 W로 인해 사미라는 스타일을 쉽게 쌓을 수 없어 궁극기를 돌리기 힘들며, 정말 힘들게 궁극기를 켠다고 해도 맞궁을 켜버리면 바로 끊겨버린다. 유일하게 사미라의 W에 막히는 스킬은 닐라의 E-Q로 연계된 Q인데, 닐라는 사미라와 달리 이 연계를 자주 사용하지 않고 E평Q평처럼 평캔용으로 사용하기에 사실상 아무것도 막을 게 없다. 설상가상으로 사미라와 자주 조합하는 탱 서폿인 레오나, 블리츠크랭크, 노틸러스의 경우에는 닐라의 W로 강화 평타에 포함된 하드 CC기까지 면역이 되어버리며, 그걸 닐라 본인의 서포터에게도 적용시켜버리니 완전 답이 없는 상성이 된다. 가장 답이 없는 점은 아래의 다른 하드 카운터 챔피언들과 달리 닐라는 바텀 라이너라 라인전을 터뜨려 카운터를 무력으로 뚫는다는 전략조차 통하지 않는다는 점. 그나마 닐라는 특유의 이질적인 플레이 스타일로 인해 유저층이 적다는 게 다행."}, {"name": "블리츠크랭크", "reason": "사미라의 하드 카운터 중 하나. 하드 CC기만 로켓 손(Q), 강철 주먹(E)으로 두 개에 침묵인 정전기장(R)까지 지옥불 난사를 끊을 수단이 세 개나 있다. 로켓 손은 논타겟이라 무빙으로 피할 여지가 있고, 투사체 판정이라 원형 검무로 막을 수 있더라도 평타 강화, 즉 타게팅인 강철 주먹, 즉발 광역기인 정전기장은 어쩔 도리가 없다. 심지어 그나마 대처하기 쉬운 로켓 손도 이미 궁을 켜버린 상태라면 속수무책이다. 궁 시전 중엔 원형 검무도 못 쓰는 데다가 스타일 중첩 쌓는 데 이미 써서 쿨이 돌고 있을 가능성이 높고, 이속도 느려져서 그랩에 맞기도 쉬워지기 때문이다. 게다가 사각지대에서 인형뽑기로 잘라먹는 플레이도 게임 내내 성가신 요소다. 다만 라인전에서는 핵심 스킬인 로켓 손을 원형 검무로 막을 수 있어서 편한 상대이다."}, {"name": "레오나", "reason": "블리츠크랭크 이상의 하드 카운터로, 원형 검무로 천공의 검을 막아낼 수 있고 이렇게 막히는 경우엔 다행히 레오나의 돌진도 씹히지만 유리한 건 그게 다다. W를 켠 레오나의 탱킹력은 상당하기 때문에 사미라가 쉽사리 잡기 어렵고, 궁극기인 흑점 폭발로도 사미라를 쉽게 억제할 수 있다. 무엇보다도 가장 큰 문제는 쿨타임이 5초밖에 안 되는 즉발 타게팅 기절인 여명의 방패(Q). 근접전이 강제되는 사미라 특성상 레오나의 사거리에 노출될 수밖에 없기 때문에 라인전부터 한타까지 마킹당하고 딜 각을 잡기가 어려워지며, 쿨타임도 거의 비슷해서 지옥불 난사도 돌리는 족족 쉽게 차단당하는 것은 당연지사."}], "general_counters": ["시비르", "야스오", "칼리스타", "케이틀린", "징크스", "직스", "제라스", "하이머딩거", "스웨인", "알리스타", "잔나", "갈리오", "뽀삐", "룰루"]}
{"champion": "사이온", "aliases": [], "hard_counters": [{"name": "세트", "reason": "출시 직후에는 사이온의 견제보다 세트의 체젠이 훨씬 높아서 견제를 해도 아무 의미가 없고 오히려 대량 학살 강타 차징을 안면 강타로 캔슬하며 일방적으로 처맞는 구도였기에 극카운터 수준이었으나 체젠 너프가 심하게 당하고 체급이 낮아진 탓에 그나마 숨통이 좀 트였다. 초반에 안면 강타를 계속 맞아주면 체력 관리도 안되고 심하면 킬까지 내줄 수 있으므로 안면 강타를 허공에 빼도록 계속해서 앞뒤 무빙을 해주는 것과 강펀치(W)를 영혼의 용광로(W)로 흡수하는 것이 핵심이다. 사실 라인전은 초반에 조금 주의하고 첫 귀환 이후에 파수꾼의 갑옷을 뽑아오면 세트의 딜을 대부분 경감시킬 수 있기 때문에 라인전은 버틸 만하지만 진짜 문제는 대미 장식(R). 대미 장식에는 대상의 추가 체력 계수가 있기 때문에 선천적으로 추가 체력이 높은 사이온에게는 매우 치명적이다. 정확히 말하면 사이온 본인은 버틸 수는 있어도 아군 물몸 딜러들에게 매우 치명적이다. 한타로 접어들면 전열에서 대미 장식으로 사이온을 잡아올려 후열의 딜러진들에게 엄청난 광역딜을 꽂아넣는데 패시브로 체력이 계속해서 차오르는 사이온을 세트가 들고 던져버리면 아군 물몸 딜러들은 체력이 3/4는 우습게 날아가며 곧바로 전장 이탈을 시킬 정도로 상성이 상당히 좋지 않다."}, {"name": "다르킨 학살자 케인", "reason": "케인의 로그인 화면에서도 다르킨 학살자가 사이온의 몸을 찢고 나올 정도로 공인된 카운터다. 다르킨 케인의 주력기인 Q 스킬은 최대 체력 비례 피해라서 사이온과 싸움을 좀 길게 하다 보면 순식간에 사이온의 체력을 거덜내버리며, 그만큼 사이온이 CS를 파밍하고 체력을 높이며 성장을 하면 할수록 다르킨 케인에게 얻어맞는 피해량도 엄청나게 증가한다. 일단 기본적으로 케인은 정글로 가기 때문에 사이온과 맞라인전을 할 일이 없으며, 몸이 약한 데다 뚜벅이인 초반 사이온은 케인에게 정수 모으기 딱 좋은 챔피언이여서 초반엔 갱킹 압박에 시달리고 후반엔 다르킨으로 변신한 케인에게 포션으로 전락해버린다. 붙으면 무조건 지기 때문에 다가오지 못하게 막아야 하지만 접근기가 2개나 있고 일단 접근을 허용하면 궁을 쓰지 않는 이상 도망도 못 친다."}, {"name": "애니비아", "reason": "주 라인이 서로 달라 만날 일은 드물지만 미드 사이온을 골랐을 때 애니비아가 후픽으로 나온다면 마음 편히 닷지하자. 벽과 기절로 대량 학살 강타가 끊기는데다 6렙 이후에는 리그 오브 레전드 최강의 푸시력으로 미드 타워에 라인을 박아넣는다. 만약 애니비아가 블루를 받았다면 미니언을 먹으려는 사이온에게 무한 디나이를 시전할 수 있다. 더 큰 문제는 소규모 교전과 한타인데, 사이온의 핵심 스킬인 멈출 수 없는 맹공이 지형 생성 스킬인 결정화에 완벽하게 카운터당한다. 당연히 궁극기와 일반 스킬을 교환한 꼴로 사이온이 손해이며 벽에 박힌 사이온은 점멸이 없다면 상대팀의 집중 포화에 무조건 죽어야 한다."}], "general_counters": ["가렌", "다리우스", "카밀", "레넥톤", "아트록스", "요릭", "트런들", "볼리베어", "문도 박사", "올라프", "판테온", "탐 켄치", "이렐리아", "클레드", "워윅", "그웬", "모데카이저", "베인", "바루스", "피오라", "크산테", "요네", "럼블", "블라디미르", "사일러스", "초가스", "나르", "일라오이"]}
{"champion": "사일러스", "aliases": ["사일"], "hard_counters": [{"name": "흐웨이", "reason": "라인전 극상성. 흐웨이는 사일러스의 라인전 약점을 후벼파는 챔피언이다. 기본적으로 흐웨이의 라인 푸시력은 미드에서도 최상위권이며, 모든 스킬이 사일러스의 Q보다 길고, 1대1이 강한 편이고, 궁극기 또한 슬로우를 통한 연계를 전제로 만들어져있는 등 사일러스가 불편한 점이 많다. 가장 큰 문제는 사일러스의 E²억압이 흐웨이의 EQ암울한 형상에 끊긴다는 것. 특히 흐웨이의 EQ는 공포라서 아리의 매혹과는 다르게 일단 맞으면 멀어질 수밖에 없다. 스킬 메커니즘의 문제이기 때문에 후반 가서 이기는 것도 아니라 사이드에서 사일러스가 상대 메이지를 피해야 하는 기묘한 상황이 연출된다. 다른 챔피언에게서 뺏은 궁극기나 갱킹, 기습 등으로 변수를 내서 잡아내야 한다."}, {"name": "애니비아", "reason": "아래에 후술할 궁극기를 활용하기 어려운 챔피언이기도 하다. 얼음 폭풍 자체가 사일러스의 한타 포지션과 스킬셋과 전혀 어울리지 않는 데다가 마나 소모량이 굉장히 높기 때문이다. 거기에 애니비아의 스킬셋은 진입이 필수적인 사일러스의 한타 자체를 카운터친다. 라인 클리어도 굉장히 빠른 여러모로 미드 사일러스 최악의 하드 카운터."}, {"name": "카사딘", "reason": "마스터 이랑 비슷한 상성으로, 상대 승률 45%대의 하드 카운터이다. 균열 이동이 별 의미가 없다는 것은 둘째치고 카사딘의 성장을 막는 것이 불가능하다는 게 문제다. 사실 균열 이동은 1회성 궁극기라고 해도 공짜 점멸을 얻을 수 있기에 마냥 쓸모가 없진 않지만, 호구로 유명한 초반 카사딘을 사일러스는 확실하게 말려놓기 힘들 뿐더러 카사딘이 궁극기를 배운 이후부터는 사슬을 적중시키기도 어렵다. 성장성 역시 카사딘이 한참 위에 있어서 아무리 후반 사일러스가 3초에 가까운 국왕시해자의 흡혈력으로 어지간한 챔피언들과의 대인전을 이긴다고 해도 카사딘은 그 흡혈량을 뛰어넘는 3레벨 궁극기 풀중첩을 1초마다 박아대기 때문에 얼마 못 버티고 밟혀 죽는다."}, {"name": "클레드(탑)", "reason": "어디서 마주쳐도 악몽 같은 라인전과 팀원들의 원성을 보장한다. 교전 사거리가 짧은 사일러스는 클레드의 덫날리기(Q)에 지속적으로 노출된다. 특히 라인이 밀린 상태라면 클레드는 E-Q 콤보로 거리를 좁히며 덫을 물리기에 무조건 끌려간다고 봐야 한다. 사일러스가 도주를 뒤로 쓰면 거리가 벌어지긴 하는데, 상술했듯 클레드도 돌진기를 가진 챔피언이라 덫이 안 끊어질 가능성이 더 높다. 문제는 덫에 끌려가면 폭딜+둔화+치유 감소 40%라는 사일러스가 싫어하는 모든 옵션이 종합 선물 세트로 걸린다는 것. 이것만 해도 게임 내내 사일러스의 역할을 크게 제한할 수 있는데, 심지어 클레드는 다리우스도 울고 가는 근접전의 스페셜리스트다. 6레벨 이후 궁극기가 찍히면 다이브와 로밍 플레이가 매우 강력해져서, 클레드가 라인을 비우면 다른 라인을 휘젓고 있을 가능성이 높다."}, {"name": "일라오이(탑)", "reason": "그야말로 악몽 같은 라인전을 보장한다. 탑 챔피언 가운데서도 최고 수준의 기본 스탯을 가진 챔피언이 일라오이다. 어설프게 초반 딜교를 걸면 손해만 보기 쉽다. 게다가 사일러스는 라인 푸시가 좋지 않고, 진입이 직선적이며 오래 비비는 근접전을 선호하는 챔피언으로 그야말로 일라오이가 잡아 패기 좋은 스타일만 집대성한 챔피언이다. 게다가 이런 탑 챔피언들은 정녕 대화가 안 통할 것 같다면 Q를 선마해서 파밍에 집중할 수 있기라도 하나, 일라오이는 Q로 원거리 견제가 가능해서 큰 의미는 없다. 6레벨 전까지는 꽤 무력한 챔피언이라 적절히 스킬을 피해가며 딜교환을 걸어볼 수 있지만, 6레벨 이후부터 사일러스는 일라오이에게 죽도록 얻어맞게 된다. 특히 궁극기인 믿음의 도약이 대단히 쓸모없는 점이 치명적이다. 사일러스가 믿음의 도약을 훔쳐서 득을 볼 만한 점은 0.5초짜리 저지 불가 하나밖에 없다. 적 다수에게 적중시켜 크라켄을 방불케 하는 촉수들을 뽑아도 그 촉수는 오로지 영혼의 시험으로 뽑은 영혼이나 혹독한 가르침에만 반응하기 때문에 사일러스가 쓰면 그냥 꿈틀거리는 병풍에 불과하다. 가급적 선 진입은 자제하고 그랩을 도주로 피한 뒤 딜교를 거는 식으로 운영해야 승산이 있다. 물론 이런 식으로 손가락을 놀려봤자 다른 곳에서 궁극기를 훔치지 않는 한 솔킬 따기는 어렵다."}, {"name": "엘리스(정글)", "reason": "말이 필요없는 정글 사일러스 극악의 카운터. 초반 교전 능력은 말할 것도 없고, 정글링 안정성이 바닥을 뚫고 지하까지 처박혀있는 사일러스 입장에서 상대 픽창에 엘리스가 나타나는 순간 그 게임 내내 밑도 끝도 없는 무한 카정이 기다릴 것이니 그냥 닷지하는 게 속 편할 것이다. 게다가 거미폼을 강탈해봤자 써먹기도 어려우니 정글 사일러스를 할 거면 엘리스는 필밴하고 하자."}], "general_counters": ["벡스", "탈리야", "아칼리", "야스오", "오리아나", "애니", "카시오페아", "말자하", "아지르", "신드라", "아크샨", "조이", "라이즈", "피오라", "요릭", "다리우스", "올라프", "아트록스", "볼리베어", "잭스", "워윅", "세트", "우르곳", "문도 박사", "그웬", "트런들", "판테온", "레넥톤", "가렌", "트린다미어", "다이애나", "탐 켄치", "나서스", "베인", "신지드", "뽀삐", "제이스", "리븐", "초가스", "퀸", "티모", "하이머딩거", "모데카이저", "마스터 이", "비에고"]}
{"champion": "샤코", "aliases": [], "hard_counters": [{"name": "그레이브즈", "reason": "하드 카운터. 샤코의 구조상 후반까지 무난하게 가면 절대로 이길 수 없다. 그레이브즈의 후반이 매우 강하기에 후반까지 버틸 생각은 하지 말고, 어떻게든 할 만한 초반에 승부를 봐야 한다. 샤코는 2레벨, 3레벨 구간이 매우 강하므로 박스 설계를 잘 해서 정글링을 빠르게 돌고 카정을 들어가 1대1로 싸워야 한다. 이 과정에서 샤코가 레벨이 높으면 당연히 이기고, 동렙이라 하더라도 칼날비와 점화를 채용하는 샤코기에 결국엔 이긴다. 하지만 초반에 격차를 벌리지 못하거나 그레이브즈가 킬을 주워 먹으면 답이 없으므로, 그냥 밴하는 게 좋다."}, {"name": "렉사이", "reason": "샤코의 분신에게 딜을 쏟은 게 아니라면 맞딜은 상대가 안 되고, 은신으로 도망쳐도 렉사이는 진동 감지와 공허의 돌진으로 샤코의 위치를 파악하고 추격할 수 있다. 게다가 샤코가 분신을 만들어도 그 전에 본체가 돌출에 맞았다면 본체에 돌출의 쿨타임이 도는 게 보이기 때문에 이걸 보고 렉사이와 팀원들이 본체를 쉽게 구분하고 대처할 수 있다."}], "general_counters": ["렝가", "피들스틱", "아무무", "신 짜오", "유미(서폿)", "룰루(서폿)", "하이머딩거(서폿)"]}
{"champion": "세나", "aliases": [], "hard_counters": [{"name": "제라스", "reason": "하드 카운터. 여기 서술한 챔피언 중 사거리가 제일 길고, 패시브가 마나 회복이라 견제가 멈추지 않는다."}, {"name": "파이크(서폿)", "reason": "돌진기와 그랩을 모두 다 가지고 있는 최악의 하드 카운터. 본인이 세나를 플레이할 생각이라면 말할 필요도 없이 밴 대상 1순위다. 파이크가 짜증 나는 이유는 블리츠크랭크나 쓰레쉬와 달리 그랩이 즉발로 나가는 것이 아닌, 그랩의 시전 시간을 유저가 직접 정할 수 있다는 것 때문. 그로 인해 이렇다 할 이동기나 상대와 거리를 벌릴 수 없는 세나 입장에서 파이크 상대로 그랩 심리전 싸움에서 오로지 무빙에만 의존해야 하기 때문에 무조건 불리할 수밖에 없다. 점멸 한번 빠지면 그냥 라인의 반 이상을 나갈 수가 없을 정도. 게다가 6레벨 이후에는 체력이 조금만 까이면 실드고 나발이고 곧바로 처형이 날아오기 때문에 궁극기조차 카운터 당한다. 시야 장악 측면이나, 로밍, 합류전 모두 파이크가 훨씬 우위에 있기 때문에 게임 내내 휘둘릴 수 있는 상대다."}, {"name": "엘리스(서폿)", "reason": "고치로 세나를 묶어버리고 접근해서 폭딜로 터트려버리는 하드 카운터. 심지어 속박을 줄타기로 가뿐히 피해버리기 때문에 접근을 막는 게 불가능하다. 시야 장악이나 합류전도 당연히 엘리스가 압도한다."}], "general_counters": ["바루스", "케이틀린", "애쉬", "직스", "진", "자이라", "브랜드", "럭스", "벨코즈", "블리츠크랭크", "노틸러스", "쓰레쉬", "레오나", "아무무", "말파이트(탑)", "문도 박사(탑)"]}
{"champion": "세라핀", "aliases": [], "hard_counters": [{"name": "블리츠크랭크", "reason": "최악의 하드 카운터. 일단 자체 생존력이 낮은 세라핀은 블리츠크랭크의 그랩은 언제나 위협적이며 심지어 W 스킬의 보호막 또한 궁극기의 보호막 파괴 특성 때문에 얄짤없이 한 방에 삭제된다. 거기다 블리츠크랭크에게는 W 스킬의 이속 증가가 있기 때문에 느릿느릿한 세라핀의 스킬들을 피하기가 쉽다. 아무리 세라핀이 무빙을 잘해서 그랩을 피한다 해도 아군 원딜이 끌려가 버리면 블리츠가 얻는 여러 방면의 이득을 세라핀 혼자서 커버하기가 벅차다는 것이 가장 치명적인 문제다. 그나마 다행인 점은 블리츠가 내구도 관련으로 대폭 하향을 먹은 뒤로 픽률도 낮아졌고 카이팅이 좋은 원딜 대신 끌려주면 역공으로 역전을 노릴 수는 있다. 또한 앞서 설명한 내구도 이슈로 제대로 점사하기만 하면 블리츠를 오히려 역공시킬 수도 있다."}, {"name": "갈리오", "reason": "미드와 서포터 양쪽 다 극악의 하드 카운터. 전장의 돌풍(Q) 견제는 내구력이 약한 세라핀에게 초반부터 아픈 딜이 들어가며, 맞견제를 하려고 해봤자 갈리오에게는 듀란드의 방패(W)의 마법 배리어 때문에 딜이 제대로 안 들어간다. 가장 최악의 경우는 세라핀이 갈리오에게 조금이라도 거리를 주는 순간 갈리오는 칼같이 E-W-Q 콤보를 세라핀에게 먹이는 것. 정말 아프다."}, {"name": "제라스", "reason": "사거리가 긴 챔피언 중 극 하드 카운터에 속한다. 제라스는 압도적으로 사거리가 긴데다가 딜에 치중되어있는 메이지 챔피언이라 세라핀의 스킬이 아예 닿지 않는 사거리에서 견제해온다. 다른 유틸폿 또한 제라스를 상대하기 힘든 것은 마찬가지지만 세라핀은 아군을 보호할 유일한 W의 쿨타임이 제라스의 모든 스킬보다 길어 제라스의 딜을 커버하기 특히 어렵고 모든 스킬 발동 속도가 세라핀보다 훨씬 빠른지라 견제조차 통하지 않는다. 초반 화력이 강한 원딜과 함께 오면 더욱 힘들어지므로 유일한 해답은 궁극기로 어떻게든 묶거나 라인이 터지기 전에 갱을 부르는 것뿐이다."}], "general_counters": ["쓰레쉬", "레오나", "렐", "파이크", "노틸러스", "럭스", "자이라", "브랜드", "벨코즈", "시비르", "사미라", "바루스", "이즈리얼", "애쉬", "세나", "진", "케이틀린"]}
{"champion": "세주아니", "aliases": ["세주"], "hard_counters": [{"name": "트런들", "reason": "모든 탱커 챔피언들의 카운터지만 세주아니에게 특히 더 강한데, 기둥의 둔화 효과를 무시할 수 있다는 점만 빼면 모든 면에서 불리하다. 세주아니의 유일한 탱킹 스킬인 혹한의 분노(P)는 일정 시간 동안 피해를 입지 않으면 일정량의 방마저를 얻는 효과인데 트런들의 진압(R)은 적이 가지고 있는 현재의 방어력과 마법 저항력을 뺏기 때문에 패시브가 활성화된 세주아니에게 진압을 사용하면 세주아니의 패시브가 켜진 탱킹력을 그대로 가져오면서 세주아니는 패시브가 벗겨지니 이중으로 탱킹력이 감소되는 결과를 낳는다. 만약 여진과 패시브가 동시에 켜진 상태에서 진압을 맞으면 세주아니의 방마저가 마이너스가 되는 대참사가 벌어진다. 따라서 트런들을 상대하는 세주아니들은 울며 겨자 먹기로 봉풀주나 칼날비 등을 사용해야 한다. 거기에 트런들은 기둥을 활용한 초반 교전 설계에도 일가견이 있는데, 조용히 성장을 바라는 초식 탱커 정글러인 세주아니 입장에선 그야말로 메커니즘부터 운영까지 카운터 당하는 최악의 상성이다. 실제 대회에서도 세주아니가 유행할 때마다 세주아니만 보고 정글 트런들이 기용될 정도로 세주아니의 대표적인 카운터다."}, {"name": "케인(다르킨 학살자)", "reason": "진화만 한다면 트런들 이상으로 열받는 상성. 애초에 최대 체력 비례 피해를 2단씩 주는 주력기를 짧은 쿨타임마다 써대는 낫질에 체력이 많은 탱커일 뿐인 세주아니는 체력이 팍팍 깎여나갈 수밖에 없으며, 세주아니는 덩치가 큰 챔피언이라서 다르킨의 낫의 에어본에 얻어맞고 붕 뜨기 쉽다. 아군 팀원들의 도움이 없이 세주아니 혼자만 남게 된 상황에서 1대1 상황으로 마주치면 그냥 다르킨 케인에게 장난감처럼 일방적으로 얻어맞으면서 가지고 놀아지는 신세다. 케인의 성장을 억제하는 방법이 있으나, 케인이 싸워줄 리가 없고 싸운다 해도 케인은 도주력이 좋아 치고 아니다 싶으면 그림자의 길(E)로 튈 수 있어 결국은 다르킨 정수만 준 꼴이 된다."}, {"name": "올라프", "reason": "프렐요드에선 같은 부족이지만, 게임 내에선 악명 높은 하드 카운터다. 세주아니의 튼튼한 방어력으로도 역류의 방어력 감소 효과와 무모한 강타의 고정 피해를 버틸 수가 없다. 6레벨 이후엔 상황이 더 안 좋아지는데, 세주아니의 모든 방해 효과가 라그나로크에 원천봉쇄된다. 라인전부터 사이드까지 세주아니가 올라프를 상대로 할 수 있는 것은 별로 없고, 올라프가 사이드로 빠져있을 때 세주아니 쪽에서 빙하 감옥을 필두로 상대 본대에 강제 이니시를 걸어야 한다."}], "general_counters": ["녹턴", "렝가", "엘리스", "문도 박사", "모데카이저(탑)", "일라오이(탑)", "다리우스(탑)", "그웬(탑)"]}
{"champion": "세트", "aliases": [], "hard_counters": [{"name": "볼리베어", "reason": "브루저 계열에서 세트 최악의 하드 카운터. 시간이 흐를수록 점점 볼리베어가 유리해진다. 게다가 볼리베어는 딜템이 아닌 탱템 세팅에 가속 위주로 템을 올리기 때문에 스킬 쿨이 긴 세트와 달리 딜교가 자주 이루어지고 거리 조절에 실패해 스킬 쿨일 때 딜교가 걸리면 세트가 일방적으로 손해를 볼 수밖에 없다. 유지력은 세트가 유리하지만 그것뿐이고 전투 지속력은 볼리베어의 압승이고 이후에도 볼리베어의 회복량을 뚫기 어렵다. 그리고 만약 상대 볼리베어가 균열 생성기와 내셔의 이빨을 가는 딜 볼리베어라면 맞다이 자체가 불가능해 킬을 조금이라도 따이면 풀피 다이브에 당해 죽을 정도로 격차가 심해진다. 그나마 다행이라면 한타 자체는 볼리베어보다 세트가 좋다. 상대가 탱 볼베이고, 상대 볼리베어가 폭풍을 부르는 자(R)로 접근한다면 바로 대미 장식(R)으로 적진을 붕괴시킬 수 있고, 한 명만 기절시키는 볼리베어의 번개 강타(Q)와 달리 세트의 안면 강타(E)는 광역 기절이 가능하기 때문이다. 이러니 최대한 라인전에서 킬을 주지 않고 한타를 보는 게 알맞다."}, {"name": "레넥톤", "reason": "볼리베어와 비슷한 브루저 계열의 하드 카운터 기본 체급이 높고 노코스트에 자체 피흡도 있어서 유지력도 좋은 데다가, 무자비한 포식자(W)의 분노 추가 효과인 보호막 파괴로 세트의 강점인 강펀치(W)의 보호막을 무용지물로 만들며 무엇보다 레넥톤의 이기적인 치고 빠지기 딜교환을 세트 입장에서 붙들어놓기가 어렵기 때문에 까다로운 편이다. 2레벨까지는 세트가 우위지만 스킬이 다 찍힌 3레벨부터는 레넥톤이 확실히 유리해지며 6레벨부턴 강신(R)으로 레넥톤의 체급이 크게 상승해서 함부로 싸움을 걸지 않는 게 좋다. 레넥톤이 강신(R)을 사용했을 때의 추가 체력 때문에 대미 장식(R)의 대미지가 높아져 한타 때 상대 딜러진들을 박살낼 수 있다는 장점이 있기는 하지만 엄청 큰 효율이 나오는 것은 아니다. 그렇기에 레넥톤이 약한 1~2레벨에 최대한 주도권을 가져가야 한다. 또 레넥톤은 후반 유통기한이 매우 심한 챔피언이기에 아예 작정하고 경험치만 먹으면서 후반을 봐도 된다."}, {"name": "트위스티드 페이트", "reason": "미드와 달리 탑에 오는 트페는 스펠도 유체화와 점멸에, 룬은 기발을 들어 기동성이 좋아 세트가 쫓아가는 건 불가능하고, 트페의 패시브인 사기 주사위(P) 때문에 반반만 가도 돈 차이가 나며, 접근을 해도 골드 카드에 기절당해서 아무것도 못하는 바보가 된다. 다른 마나 챔들처럼 투기장의 투지(P)의 체젠으로 버티며 상대의 마나를 먼저 바닥내는 전략도 블루 카드 때문에 불가능하고 골드 카드의 최대 2초 기절 때문에 한타도 좋고 운명(R)의 뛰어난 로밍 능력 때문에 다른 라인까지 터질 수 있어서 사실상 상대가 탑 트페라고 판단되면 닷지를 하는 게 팀에 이로울 정도이다."}, {"name": "하이머딩거", "reason": "자주 나오진 않지만 나오게 되면 세트의 악몽이 되는 챔피언 중 하나다. 일단 하이머딩거의 E의 슬로우와 기절, R 강화포탑 평타의 슬로우가 세트에겐 상당히 골칫거리다. 붙기만 하면 세트가 지지는 않지만 라인전에서 파밍 자체가 힘들고 가끔 하이머딩거 원챔 유저 중엔 탈진을 기용하는 유저도 있는데, 이렇게 나오면 솔로킬은 진짜 평생 못 딴다고 봐야 한다. 나름 후반 밸류도 괜찮은 하이머딩거에게 성장을 방해받고 고통받으며 내내 라인전을 진행해야 한다는 것 자체가 꽤나 불쾌한 점으로 다가온다. 뚜벅이면서 하루종일 들이받으며 어떻게든 라인전 우위를 점해야 하는 세트와 들어오는 상대에게 카운터 격 챔피언인 하이머딩거는 어떻게 보면 라인전이나 한타나 태생부터가 극상성이다. 상대법으로는 어떻게든 안면 강타(E) 거리를 확보하고 R 강화포탑이 깔렸을 땐 대미 장식(R)으로 강화포탑 구역에서 강제로 이탈시켜 싸움을 진행해야 한다. 그래도 후반 한타 밸류는 세트가 조금 더 좋고 상대의 앞라인 챔프를 통해 대미 장식(R) 진입 각이 잘 나왔을 땐 하이머딩거가 뭘 해보기도 전에 풀투지 상태에서 안면 강타(E)-강펀치(W) 확정 콤보로 폭사시켜버릴 수 있다."}], "general_counters": ["판테온", "올라프", "워윅", "일라오이", "요릭", "케인(다르킨 학살자)", "트린다미어", "우르곳", "트런들", "나서스", "모데카이저", "클레드", "아트록스", "럼블", "베인", "그레이브즈", "신지드", "나르", "케넨", "퀸", "리븐", "제이스", "케일", "스몰더", "오로라"]}
{"champion": "소나", "aliases": [], "hard_counters": [{"name": "노틸러스", "reason": "최악의 하드 카운터. 노틸러스의 그랩은 다른 그랩 챔들과는 달리 쿨타임이 짧아 위협에 자주 노출될뿐더러 그랩의 피격 판정도 넓어 안 그래도 피격 판정이 큰 소나를 더욱 쉽게 물 수가 있다. 소나에게는 궁극기를 제외하면 하드 CC기가 없어 접근하는 노틸러스를 막을 방도가 없기에 그랩에 걸리게 되면 소나를 그 자리에서 시체로 만들어 버리며 본체 역시 태생이 탱커인 데다 타이탄의 분노(W)의 실드까지 있어 몸집도 튼튼해 잘 안 죽는다. 거기다 아무리 소나에게 점멸이 있다 쳐도 노틸러스의 궁극기인 폭뢰는 타겟팅인지라 소나에게 작정하고 궁극기를 쓴다면 사망은 반은 확정이라고 봐도 무방하다."}], "general_counters": ["벨코즈", "자이라", "브랜드", "럭스", "니코", "하이머딩거", "흐웨이", "블리츠크랭크", "파이크", "레오나", "렐", "알리스타", "아무무", "드레이븐", "닐라", "진", "바루스", "케이틀린"]}
{"champion": "소라카", "aliases": [], "hard_counters": [{"name": "자이라", "reason": "씨앗에서 피어나는 가시 발사 꽃의 견제 범위는 소라카의 Q 견제 이상으로 광대하며 미니언을 관통하는 속박과 광역 하드 CC기까지 있기 때문에 소라카를 손쉽게 위협할 수 있다. 이 분류에서 가장 답이 없는 초하드 카운터."}, {"name": "흐웨이", "reason": "세라핀과 비슷한 부류로 흐웨이의 초반 라인전은 소라카와 비슷하게 강력하고, 특히나 상대가 서폿 흐웨이와 궁합이 좋은 애쉬, 진, 바루스 등 같은 사거리가 길고 라인전이 강력한 챔피언들이면 선공권은 흐웨이에게 있다고 봐도 무방하다. 암울한 형상(EQ) 또한 파괴의 아귀(EE)로 소라카를 쉽게 위협할 수 있으며, 반사의 웅덩이(WW)는 즉발 지속 광역 보호막이기 때문에 즉발 침묵 장판은 아무런 소용이 없다. 한타를 가더라도 흐웨이가 잘 커서 치감 템을 잘 챙겼다면 소라카의 모든 장점들을 지우고, 소라카의 포지셔닝을 지독하게 망가뜨릴 수 있다. 만약에 아군 서포터가 소라카일 때 아군이 흐웨이를 올려놓지 않거나 상대 팀이 흐웨이 픽이면 밴 아니면 닷지를 권고한다."}], "general_counters": ["블리츠크랭크", "아무무", "쓰레쉬", "노틸러스", "스웨인", "레오나", "알리스타", "소나", "세나", "세라핀", "제라스", "브랜드", "벨코즈", "럭스", "바루스", "진"]}
{"champion": "쉔", "aliases": [], "hard_counters": [{"name": "하이머딩거", "reason": "극 카운터. 다른 원거리 견제력이 좋은 챔피언들은 딜이라도 약하지, 하이머딩거는 원거리 견제력도 강력해서 진입도 까다롭고, 6렙을 찍었다면 2:1의 구도가 아닌 이상 절대로 못 들어간다. 들어가봤자 로켓포 찜질 맞고 그대로 증발한다."}, {"name": "스웨인", "reason": "아래 모든 조건을 만족하는 하드 카운터. 우선 AP 스킬 딜러인 스웨인 앞에서 W는 없는 스킬이며, 쿨이 긴 그림자 돌진이 유일한 돌진기인 쉔은 스웨인의 스택 농사를 쉽게 허용할뿐더러, 라인 푸시력, 견제력, 후반 기댓값 모든 부분에서 스웨인이 압도적이다. 1대1이 그리 강하지 않은 스웨인이지만 쉔의 2% 부족한 딜로는 궁 켠 스웨인을 사이드에서도 절대 이길 수 없고, 한타력은 비교하는 게 실례일 정도로 밀린다. 라인전 이후 치감을 가려고 하면 평타를 치지 않는 스웨인에게 덤불 조끼의 치감을 묻히기도 힘들다."}, {"name": "일라오이", "reason": "쉔을 뽑았는데 일라오이가 나오면 그냥 닷지가 정답이다. 초반 정글러 개입 없이는 단독으로 이기는 것이 불가능하다. 그나마 1렙 딜교를 잘해놓아서 선 2렙 찍고 기습 킬 각을 볼 수는 있으나 이것도 초반만 그렇고 아무리 킬을 먹어도 일라가 6렙이 찍히고 템이 나오면 나올수록 쉔 혼자서 일라를 막는 것은 불가능하다. 일라오이는 혼자서 쉔 궁을 끊지는 못하지만 어차피 일라는 한타보다는 사이드 + 타워 철거 및 일대다 전문 챔피언인지라 아래쪽이 완전히 답도 없이 터지는 게 아닌 이상 묵묵히 타워만 밀어대면서 자기 성장에만 집중해도 쉔 상대로 게임 이기기가 쉬운 편이다."}], "general_counters": ["제이스", "티모", "나르", "케넨", "퀸", "럼블", "카시오페아", "베인", "갱플랭크", "그웬", "블라디미르", "케일", "나서스", "가렌", "다리우스", "문도 박사", "판테온", "신지드", "피오라", "스카너", "초가스", "모데카이저", "트런들", "뽀삐", "케인(다르킨 학살자)"]}
{"champion": "쉬바나", "aliases": [], "hard_counters": [{"name": "트런들", "reason": "초반 맞딜과 카정의 위험도 있지만 후반에도 궁으로 방마저를 빼앗아 버리기 때문에 한타 때 진입이 어려워지고 맞딜도 트런들이 궁이 있다면 진다. 탑에서 만날 경우엔 정밀 룬으로는 거의 답이 없고, 난입을 들어야 겨우겨우 교전 회피를 하며 E로 CS만 챙겨먹을 수 있는 하드 카운터이다."}, {"name": "킨드레드", "reason": "킨드레드 특성상 패시브 스택을 쌓기 위해 필연적으로 초반에 카정이 들어온다. 그러나 6레벨 전, 극단적인 뚜벅이에 CC기도 없는 쉬바나로 킨드레드의 카정을 저지할 방법이 없으며 추격할 방법도 없다. 초반 정글링 유지력이나 속도 모두 쉬바나보다 한 수 위이기 때문에 쉬바나만의 장점인 빠른 정글링을 통한 극초반 구간 넘기기 역시 잘 통하지 않는다. 성장성도 정글러 중 최고 수준에 궁극기로 쉬바나의 캐리를 방해할 수 있어 후반을 가도 쉬바나가 유리하지 않으며, 쉬바나가 킨드레드보다 유리한 부분은 대치 구도에서 할 수 있는 게 더 많다는 것 말고는 없다."}, {"name": "마스터 이", "reason": "마스터 이는 초반에 망쳐놔야 되는데 초반 약캐라고 무시하면서 대놓고 카정, 역갱 등을 가면 300원을 주고 집으로 바래다 달라고 하는 것이다. 마스터 이는 초반 몹들을 대충 건너뛰고 3렙 갱을 갈 수 있으며 명상이라는 훌륭한 자체 회복기가 있다. 여기는 1렙부터 60%의 피해를 회복하고 피해 감소 효과도 있으니 같은 CC기가 없는 쉬바나는 명상으로 체력 회복한 마스터 이의 자원이 될 뿐이다. 프리한 상황의 마스터 이는 오브젝트 다 챙기고 갱을 다니고 킬을 허용하는 순간 한타까지 영향력을 발휘하는 미친 챔프가 되어버린다."}], "general_counters": ["렉사이", "신 짜오", "벨베스", "판테온", "헤카림", "올라프", "일라오이(탑)", "트린다미어(탑)"]}
{"champion": "스몰더", "aliases": [], "hard_counters": [{"name": "트위치", "reason": "대표적인 바텀 스몰더의 카운터. 후반 강하다고 유명한 원딜들도 트위치 앞에서는 한수 접고 들어간다. 선공권 자체가 트위치에게 있기에 스몰더 입장에서는 오히려 시간이 지날수록 더더욱 불리하다."}, {"name": "제라스(미드)", "reason": "스몰더 상대 승률이 6할에 달할 정도로 하드 카운터다. 흉악하게 긴 사거리와 마나만 확보되면 스킬을 쉴 새 없이 돌리는 탓에 좀처럼 Q 스택을 쌓기가 어렵다. 일단 접근해서 때리기도 상당히 버거운데 라인 클리어가 빨라 막타류 Q 스택을 쌓는 것도 곤란해진다. 스몰더의 괴랄한 후반 포텐셜을 엄청나게 지연시킬 수 있으며 스몰더가 어느 정도 성장하더라도 긴 사거리로 인한 대치 장점, 포킹에서의 이점, 그리고 근본적으로 제라스 또한 후반 기대치가 상당히 높다는 점으로 인해 상대가 까다로운 챔피언이다. 일단 225스택을 쌓고 4코어가 나오는 시점부터는 이야기가 달라지지만 사거리 차이로 딜교 손해를 보는 상황은 어차피 반복된다."}, {"name": "아우렐리온 솔(미드)", "reason": "유일하게 시간이 스몰더의 편이 아닌 상성. 손에 꼽는 왕귀력을 자랑하는 스몰더지만 아우솔은 그 스몰더를 왕귀력으로 찍어누른다. 아우솔 역시 패시브 스택을 쌓으며 무한히 성장한다는 점은 스몰더와 공유하지만, 스몰더는 E로 인한 순간적인 대처력과 Q의 체력 비례 피해가 고정 피해라는 점을 제외하면 아우솔에게 모든 면에서 열세다. 전반적인 스킬 사거리 자체는 스몰더가 좀 더 길지만 가장 중요한 Q가 아우솔의 스킬 사거리보다 짧아서 실질적으로 스몰더가 딜 각을 잡으려면 아우솔의 사거리 안에 들어가는 셈이라 자체적인 스킬셋 상성이 아우솔에게 밀리고, 화력적으로도 스택이 충분히 쌓인 Q의 체력 비례 마뎀은 스몰더의 Q와 비교해도 꿇리지 않는 살벌한 딜을 자랑한다. 그나마 아우솔은 라인전이 스몰더와도 비교도 안 되게 안 좋다는 게 위안이지만 스몰더도 라인전 보고 뽑는 픽은 아니고, 서로 주 라인도 달라서 큰 의미가 없다. 혹여나 아우솔이 나왔다고 맞밸류로 미드 스몰더를 고르는 경우가 있는데 라인전 상성마저 아우솔의 Q, W를 끊을 수 없기에 스몰더가 밀리며, 서로 똑같이 성장하더라도 아우솔은 특이점과 유성/천상 강림이라는 장판기 겸 CC기로 무장한 데다 별가루로 스킬 범위까지 무한히 증가해 화력 이상으로 딜링의 편의성이 중요해지는 후반부에 접어들수록 물몸 원딜에 대한 억지력이 매우 강해지는데, 스몰더도 여기서 예외는 아니다. 그나마 스몰더는 벽 넘기 기술이 있긴 하지만 라일라이와 자체 둔화가 붙어있는 아우솔의 장판기를 벗어나기도 힘들고, 벗어난다고 해도 한타 진영 자체를 뒤덮을 수 있는 아우솔의 강화 궁극기는 스몰더가 절대 피할 수 없다."}, {"name": "빅토르(미드)", "reason": "스몰더는 왕귀가 끝나야 제 성능이 발휘되는데, 보통 그때쯤이면 빅토르는 흉악한 원딜 절단기가 되어 있다. 아무리 스택을 더 쌓아봐야 사거리가 짧아 선공권은 빅토르에게 있고, 스몰더는 빅토르의 공격을 버텨낼 하드웨어도, 피할 수단도 없다. 빅토르를 평타 사거리에 들이기도 전에 빅토르 ER 맞고 드래곤 통구이가 된 스몰더를 목격할 수 있다"}, {"name": "판테온(탑)", "reason": "상대 승률 34%의 극상성. 탑에서 만나면 주도권도 없고 스택도 제대로 못 쌓는다. 탑 스몰더가 뚜벅이 브루저 챔피언들 상대로 스택을 편안히 쌓을 수 있다는 장점이 완전히 퇴색되는 것이다. 고속 연사포가 나오기 전 스몰더의 Q의 사거리는 550이고, 판테온의 방호의 도약의 기절 사거리는 600이다. 심지어 짧은 창 사거리 또한 600이라서 서로 Q 교환을 하면 초반 방어력이 끔찍하게 낮은 스몰더의 체력만 왕창 깎인다. 조금 무리해서 Q 스택 좀 쌓겠다고 앞에 나와서 Q를 던지려고 하는 순간 방호의 도약에 얻어맞고 반피가 나간다. 판테온이 반응이 늦어서 방호의 도약을 박지 못해도, 초중반 스몰더의 빈약한 견제력으로는 판테온을 죽이기는커녕 미니언 어그로에 라인만 망쳐질 뿐이다. 스몰더가 고속 연사포가 나오고 스택을 착실하게 쌓는 순간 판테온 따위와는 밸류 차이가 크게 벌어지지만, 그 전에 판테온의 라인전부터 얻은 이득으로 스노우볼을 굴리기 시작하면 스몰더 입장에서는 아군에게 위험 핑 찍기 말고는 대처 방법이 전혀 없다. 판테온은 탑에서도 로밍까지 가능하기 때문에 아래 하체 팀원들도 부담감이 매우 심해진다. 미드라면 라인이 짧아 판테온에게 추격당해 죽을 일은 거의 없지만 판테온은 그냥 스몰더가 최악으로 약한 초반에 상대 정글을 괴롭히고 아군 바텀에 투자하면 그만이다."}], "general_counters": ["징크스", "트리스타나", "세나", "바루스", "나피리", "탈론", "제드", "아칼리", "르블랑", "요네", "카타리나", "피즈", "이렐리아", "다이애나", "사일러스", "야스오", "조이"]}
{"champion": "스웨인", "aliases": [], "hard_counters": [{"name": "올라프", "reason": "라인전 한정 하드 카운터로 기본 스펙 차이부터 극심한데다 멀리서 날아오는 역류(Q)의 높은 둔화는 뚜벅이 스웨인에게 쥐약이다. 속박명령으로 끌고 오는 건 오히려 올라프한테 최적의 딜교 자리를 마련해주는 자살행위나 다름없고 6레벨 이후에는 모든 방해 효과를 무시하는 라그나로크(R) 때문에 뭐 해보지도 못하며 저항하더라도 체력이 떨어질수록 강력해지는 올라프의 딜에 찢긴다. 난입으로 도끼를 최대한 잘 피해보자."}, {"name": "요릭", "reason": "견제력, 유지력, 맞다이, 운영까지 모두 스웨인을 압도하는 스웨인 최악의 하드 카운터. 안개 망령들이 스웨인의 Q 한 방에 청소되지 않는 게 크다. 마나 소모가 큰 기술을 공짜로 나오는 구울에 막 쓰기도 뭐한데, 구울을 안 지우면 E라도 한 대 맞는 순간 피가 걸레짝이 되고, 이동기가 없는 스웨인 특성상 요릭의 벽은 굉장히 치명적이다. 스웨인의 견제는 회복으로 쉽게 버티는 것은 덤. 게다가 요릭의 맞다이는 브루저 사이에서도 막강한 편이기에 메이지인 스웨인으로 덤비는 건 자살행위다. 때문에 안정적으로 스택 쌓기도 힘든데, 교전 상황에서 강점을 발휘하는 스웨인을 망령, 안개 여왕, 심하면 전령까지 대동한 스플릿으로 카운터 쳐버린다. 요릭의 기동력은 최하위권이므로 갱 콜을 적극적으로 하는 것이 좋다."}, {"name": "코그모(원딜)", "reason": "베인과 함께 바텀 스웨인 최악의 카운터, 베인보단 6렙 이전에 할 만하나, 베인보다 라클과 견제가 훨씬 뛰어나 이득 보기가 힘들다. W의 퍼뎀은 자연스럽게 체력이 높은 스웨인에게 악재로 다가오며, 라인전 딜교환도 W 때문에 까다로우며, 궁을 배운다 한들 W의 퍼뎀 때문에 몸이 버티질 못한다. 6렙 이후 가장 이상적인 상대법은 속박명령을 맞혀 W를 유도한 뒤, 속박명령이 생체마법 폭격보다 쿨이 짧은 걸 이용하여 E 쿨이 돌아오면 다시 재진입하여 W가 돌아오기 전까지 킬 각을 보는 방식이다. 그러나 이 방식도 W가 돌아오기 전까지 마무리하지 못하면, 주로 유틸폿과 조합되는 코그모 특성상 역관광 당하는 경우가 굉장히 많다. 뚜벅이인 점을 이용해 갱으로 말린다 한들, 2코어만 떠도 딜이 나와서 승기를 잡을 만큼 스노우볼을 굴리지 못했다면 후반 캐리력과 기대치가 압도적으로 높아 매우 까다롭다. 그 어떤 패치 때에도 항상 상대 전적이 가장 열위인 챔프이다."}], "general_counters": ["레넥톤", "렝가", "이렐리아", "잭스", "요네", "신지드", "뽀삐", "모데카이저", "나서스", "문도 박사", "사일러스", "가렌", "에코", "피즈", "카사딘", "르블랑", "신드라", "아지르", "흐웨이", "애니비아", "루시안", "바루스", "제라스", "베인", "알리스타", "블리츠크랭크", "아무무", "마오카이", "자크", "쓰레쉬", "레오나", "노틸러스", "파이크"]}
{"champion": "스카너", "aliases": [], "hard_counters": [{"name": "트런들", "reason": "문제는 스카너의 탱킹 능력치를 뭉텅이로 뺏어가는 진압. 스카너처럼 아이템 스탯 빨로 탱킹을 하는 탱커에게 진압은 사실상 사형 선고나 다름없고, 스카너도 예외는 아니라 라인전에서 아무리 재미를 봐도 한타에서 진압을 맞고 폭사당하는 그림이 심심찮게 나온다. 스카너의 체력과 방마저를 빨아먹고 생기가 돌아와서 날뛰는 트런들은 덤이다."}, {"name": "올라프(탑&정글)", "reason": "초반 딜교는 스카너가 Q 선마를 한다고 이길 수 있는 상대가 아니며, 그렇다고 6레벨에 포탑 킬 각을 보자니 CC기를 전부 무시하는 궁극기가 존재한다. 또한 올라프의 고정 피해는 스카너가 단단해져도 아프게 들어오며, 스카너의 견제는 올라프가 자체 피흡으로 버텨버린다. 처음부터 끝까지 이길 수 없는 상대이므로 이쉬탈의 격돌의 둔화 불가로 드러눕는 게 편하다. 정글일 때는 라그나로크(R)로 스카너의 CC를 무시할 수 있는 시점이 오기 전인 초반에 갱을 찔러 성장을 망쳐두는 편이 좋다. 6렙 이후 올라프는 최악의 경우 갱킹 온 스카너까지 덩달아 잡아 더블킬까지 이어버릴 수 있는 극상성이다."}, {"name": "모데카이저(탑)", "reason": "모든 탱커들의 악몽이자 프로 경기에서도 스카너의 카운터픽으로 등장하는 문도 이상의 하드 카운터. 라인전 단계부터 스카너 못지않은 견제와 나쁘지 않은 유지력을 가지고 있는 데다, 체력템 위주로 올리는 스카너에게 패시브의 체력 비례 도트 딜과 기본적으로 보유한 마법 관통력은 치명적이다. 게다가 스카너의 높은 한타 기여도를 궁극기로 원천 차단해버린다. 그나마 초반 라인전에서 낮은 모데카이저의 체급을 노려서 무리하는 모데카이저를 잡아낼 수는 있지만 스카너 역시 라인전 체급이 높은 편은 아니라 무리했다간 더 큰 위험에 노출될 수도 있고 이로 인해 성장성이 더 뛰어난 모데카이저를 상대로 시간이 지날수록 버거워진다. 15시즌 기준 스카너는 탑보단 정글로 가게 됐고 이로 인해 보통 스카너가 모데카이저를 상대로 라인전을 하기보단 갱킹을 하는 입장이 되어서 초반이 약하다는 단점은 찌르기 더 쉬워졌지만 문제는 중후반 이후의 모데카이저를 상대할 가능성이 더 높은데 이 시점의 모데카이저는 성장이 망하지만 않으면 충분히 스카너를 마킹하고 죽음의 세계(R)에서 잡고 나올 수 있는 정도의 화력을 갖추기 때문에 상당히 위협적인 상대다."}], "general_counters": ["케인(다르킨 학살자)", "문도 박사", "올라프(탑", "일라오이(탑)", "볼리베어(탑)", "워윅(탑)", "레넥톤(탑)"]}
{"champion": "시비르", "aliases": [], "hard_counters": [{"name": "드레이븐", "reason": "평타 의존도가 높은 챔피언인데다, 설상가상으로 라인전도 무척이나 센 챔피언이다. 막을 스킬이 E나 궁밖에 없고, 드레이븐의 무지막지한 평타딜은 주문 보호막에 안 막히기 때문에 사실상 딜교를 걸 생각을 해선 안 된다. 또한 킬을 먹어서 돈을 버는 공격적인 스노우볼링에 특화되어있는 챔피언인데다 템 빨 역시 잘 받아서 라인전에서 두세 킬을 준 순간 아프지만 버틸 만했던 평타딜이 순식간에 평타 두세 방에 전광판으로 보내버리는 딜로 돌변한다. 쫓아올 때 은근히 빠른 챔피언이라 일단 딜 각을 줘 버리면 궁 켜고도 도망가기 쉽지 않은 건 덤. 그나마 후반엔 광역딜 위주인 시비르가 낫긴 하지만, 그전에 드레이븐이 다 터트리고 다니는 게 문제."}, {"name": "트위치", "reason": "트위치는 궁극기로 긴 사정거리의 프리딜이 가능하며 후반 한타에서 트위치의 기습적인 광역 폭딜에 시비르는 맞딜은커녕 궁 쓰고 도망가는 거 외엔 할 수 있는 게 없다. 그렇다고 초반에 박살내기엔 시비르도 마땅히 라인전이 강하지 않은 것도 문제다. 또한 독약 병(W)은 장판형 둔화 스킬이라 주문 방어막으로도 막을 수 없으며, 특히 매복(Q)으로 은신하다 독약 병(W)으로 둔화 걸고 시비르에게 불리한 교전을 강제로 유도할 수 있다는 점도 까다롭다. 트위치의 궁 각과 암살 각을 최대한 주지 않도록 하며 여유 부리지 말고 가능한 게임을 빨리 끝내는 게 답이다."}, {"name": "알리스타", "reason": "하드 카운터. 강력한 CC기를 가진 탱커 서포터들을 주문 방어막 하나로 카운터치는 시비르지만 알리스타만은 다른데, 알리스타의 W-Q 콤보는 스킬 두 개의 조합이라 사거리 안에 들어서면 어떻게든 뜰 수밖에 없다. 스킬 두 개가 조합되는 콤보는 레오나도 가지고 있지만 레오나의 천공의 검은 단순 속박이라 후속 기절을 막아낼 수 있는 반면, 알리스타의 W-Q 콤보는 모두 넉백과 에어본을 가진 행동 불능의 하드 CC기이기 때문에 박치기를 막아도 이어지는 분쇄에 뜰 뿐이다. 박치기를 맞고 후속 분쇄를 막는다는 건 알리스타가 W로 민 다음 플Q 같은 방법으로 연계하는 게 늦어버리는 실책 외에는 불가능하며, WQ는 그냥 맞고 E 스턴을 막는 각을 보는 게 최선일 정도. 거기에 궁극기를 켠 알리스타는 시비르가 아무리 때려도 간지럽기만 하고, 시비르는 알리스타를 라인전에서 눌러놓기에도 알맞지가 않다. 대회에서도 시비르의 카운터 픽=알리스타가 가장 대표적일 정도로 자주 고려된다.(아예 시비르를 가져갈 때 십중팔구 알리스타를 같이 가져가거나 아예 밴해버린다.)"}], "general_counters": ["드레이븐", "베인", "애쉬", "트위치", "제리", "칼리스타", "루시안", "소나", "아무무", "자르반 4세(정글)", "올라프(탑", "정글)"]}
{"champion": "신 짜오", "aliases": ["신짜오", "짜오"], "hard_counters": [], "general_counters": ["뽀삐", "판테온", "트런들", "람머스", "아무무", "볼리베어", "워윅", "세트(탑)", "잭스(탑)", "말파이트(탑)"]}
{"champion": "신드라", "aliases": [], "hard_counters": [{"name": "에코", "reason": "하드 카운터. 일단 선공권이 없다고 봐도 무방하다. 2단 이동기인 시간 도약(E)으로 적군 와해를 가볍게 피하는 동시에 신드라에게 접근이 가능하며 딜레이가 긴 신드라의 궁극기는 시공간 붕괴(R)로 손쉽게 카운터칠 수 있다. 존야라는 대처 방안이 있고 후반으로 갈수록 다소 힘이 떨어지는 제드와 달리 에코는 난전에 강하고 변수 창출에 능하며 암살자 챔피언 중에선 성장성이 좋은 편이기 때문에 게임 내내 거슬릴 수밖에 없다. 라인 킬 확률은 물론 승률과 KDA도 항상 밀리는 상대."}, {"name": "피즈", "reason": "상대 승률 41%의 극상성. 장난치기/재간둥이(E)로 신드라의 스킬을 모조리 회피해 버리며, 뛰어난 기동성으로 본인만 치고 빠지는 딜교환을 계속한다. 6레벨 이후에는 미끼 뿌리기(R)를 맞으면 풀피 원콤이 날 수 있기 때문에 피즈의 E가 빠지지 않는 한 E를 절대 쓰지 말자. 뼈 방패도 웬만해선 들어주자."}, {"name": "르블랑", "reason": "상대 승률 39%의 하드 카운터. 왜곡(W)의 존재 때문에 적군 와해를 비롯한 스킬들을 적중시키기 매우 어렵다. 신드라가 리워크 되기 이전, 즉 어둠 구체의 쿨이 짧았을 때는 단독으로 르블랑을 압박할 수 있었지만 리워크 이후로는 오히려 르블랑이 지속적인 압박을 주면서 라인을 반도 나가지 못하도록 신드라를 묶어놓고 로밍을 가거나 아군 정글러를 말려놓는다. 르블랑의 말도 안 되는 갱 호응은 리워크 이전이나 이후나 매우 성가시다. 신드라 장인들도 카운터로 꼽는 챔피언이다."}], "general_counters": ["야스오", "제드", "카타리나", "이렐리아", "아칼리", "다이애나", "아크샨", "아우렐리온 솔", "블라디미르", "카사딘", "조이", "흐웨이"]}
{"champion": "신지드", "aliases": [], "hard_counters": [{"name": "케일", "reason": "둘 다 라인전 약캐로 꼽히지만 케일이 6레벨을 찍는 순간부터는 정글러나 미드의 개입이 없는 이상 신지드가 힘들어진다. 한타로 어떻게 커버친다고 해도 케일의 스플릿 속도는 최상급이며, 딜을 하려고 해도, 케일에게서 도망가려고 해도 신지드는 엄청나게 맞을 수밖에 없다. 같이 파밍을 하더라도 케일의 왕귀력은 롤 최강 수준이며 스킬셋도 신지드에게 하드 카운터인 면이 있기에 신지드 장인들도 케일을 극상성으로 손꼽는다."}, {"name": "제이스", "reason": "신지드 장인들도 인정한 하드 카운터. 원거리에서 견제가 가능한 데다가 초반 스킬이 6개나 되기 때문에 신지드는 제이스의 딜을 버텨낼 재간이 없다."}, {"name": "갱플랭크", "reason": "챔피언 특성상 손을 많이 타지만 숙련자를 만나게 된다면 상당히 골치 아픈 상대. 일단 라인전 단계부터 갱플랭크의 선제공격 & 착취 Q를 내내 맞아야 하며, 넘기려고 다가가자니 화약통을 터트려 둔화를 걸고 자신은 증가된 이속으로 유유히 도망친다. 온힛 계열 스킬이 전무한 신지드 특성상 화약통 싸움도 갱플랭크가 유리한 건 덤. 설령 어찌저찌해서 넘기는데 성공해 끈끈이로 속박을 건다 해도 괴혈병 치료(W)로 풀면 그만이다. 그렇다고 빡빡한 라인전을 피해 도망쳐 로밍을 가자니 포탄 세례(R)에 카운터 당하고, 그렇다고 신지드 특유의 오버파밍을 시도하자니 혀어어어업상(Q)에 붙은 추가 골드 수급으로 무난히 골드를 땡겨와 신지드 쪽이 일방적인 손해를 보게 돼버리면 갱플랭크가 압도적으로 유리해진다. 신지드가 후반이 좋다곤 하나 화약통(챔피언 대상 추가 피해 + 협상의 기본 피해 + 갱플랭크의 공격력 + 주문 검 + 치명타 + 방어구 관통력 40% + 2초 80% 둔화)을 연속해서 광역으로 꽂아 넣을 수 있는 갱플랭크에 비할 바가 못 된다. 이렇듯 숙련자의 갱플랭크는 라인전, 한타, 운영 모든 면에 불리한 하드 카운터지만 비숙련자 차이가 크고 W가 있다곤 하나 물몸에 뚜벅이인 건 변함없기에 넘기는데 성공했다면 킬 각이 잡히기도 하니 이를 이용해 꾸준히 갱이나 로밍을 불러 최대한 망쳐놓자."}, {"name": "다리우스", "reason": "하드 카운터. 독을 뿌리러 접근하는 순간 둔화와 그랩으로 발이 묶인 후 유체화로 추격당하므로 도주가 불가능하다. 갱을 불러도 정글러의 킬 캐치 능력이 부족하다면 정글러가 갱승당하고 신지드까지 죽는 최악의 결과가 나올 수 있으므로 파밍을 포기하고 경험치만 먹으며 후반을 봐야 한다. 다만 다리우스도 신지드의 기동력을 따라가지 못하기 때문에 라일라이와 접착제를 뿌리며 카이팅을 하면서 라인전 구도를 회피하며 성장만 안 말린다면 한타에서 크게 밀릴 일은 없을 것이다. 다리우스 입장에서도 라일라이와 신속신이 나온 신지드는 추격하기 어렵고, 한타에서도 궁극기가 신지드의 끈끈이에 막히며 탱킹 수단이 Q 회복뿐이라 신지드의 궁극기-Q의 치유 감소 효과가 부담스러운 건 마찬가지기 때문에 신지드가 라인전을 피하고 시간만 끌면 할 만해진다."}, {"name": "가렌", "reason": "라인 킬 확률이 가렌이 거의 70% 가까이 되는 극상성. 신지드가 근접 챔피언에게 유리한 점은 주력 딜링기인 맹독의 자취는 걸어 다니면서 쓸 수 있기에 상대가 스킬 선후딜로 잠깐 멈추는 사이 유유히 거리를 벌리기 용이하다는 점에서 나오는데, 가렌의 주력 딜링기인 심판은 신지드와 마찬가지로 이동에 아무 제약 없이 걸어 다니면서 시전이 가능하기에 신지드와 바짝 붙어 함께 걸어가면서 꾸준히 딜을 넣을 수 있다. 그렇게 신지드는 E-Q, 가렌은 Q-E로 똑같이 딜교를 한다고 치면 가렌은 용기라는 탱킹 스킬로 독을 무력화시킬 수 있기에 라인전에서는 가렌의 딜이 신지드의 딜보다 훨씬 아프게 들어오며, 6레벨 이후에는 신지드가 궁극기를 쓰며 방, 체전을 올려도 데마시아의 정의는 고정 피해를 가하기 때문에 잘못했다가는 바로 솔킬이 나버린다. 한타는 신지드가 더 유리하니 초반을 어떻게든 버텨야 한다. 다만 신지드가 라일라이가 나오면 가렌이 Q로 풀고 싶어도 못 푸는 지속딜 무한 둔화로 최대한 가렌의 E를 안 맞으며 농락이 어느 정도 된다."}, {"name": "클레드", "reason": "칼챔 잡는 칼챔답게 라인전이 정말 파괴적이다. 파밍을 하려면 클레드에게 다가가야 하는 신지드의 특성상 신지드는 파밍을 할 때마다 클레드의 킬 각에 노출되며, 다른 브루저들과는 궤를 달리하는 독보적인 다이브 능력으로 인해 6레벨 이후로는 라인에 서 있는 것 자체가 자살 행위에 가깝다. 로밍도 클레드가 한수 위고, 한타에서도 템트리와 무관하게 아군 딜러를 순식간에 삭제하는 최악의 상대. 라인전 단계에서 우위를 잡을 생각은 하지 말고 클레드가 힘이 빠지고 신지드가 아이템이 하나 둘 나오는 타이밍을 노리는 편이 이롭다."}, {"name": "베인", "reason": "라인전과 한타 모두 극상성이다. 끈끈이를 뿌려도 선고로 밀어낸 뒤 빠져나가고, 추격해올 때는 패시브의 이속으로 끈질기게 추격해온다. 은화살의 체력 비례 고정 데미지는 방마저도 무시하고 신지드를 녹여버릴 수 있다."}, {"name": "문도 박사", "reason": "하드 카운터. CC기 저항 때문에 넘길 수가 없다. 신지드의 극 카운터인 스펠 실드가 패시브로 거의 상시 켜져있기 때문에, E 스킬로 이어지는 딜교환 자체가 성립이 안 된다. 지속 회복력도 뛰어나기 때문에 라인전에서 피해를 누적시켜 우위를 잡는 것도 거의 불가능하다. 왕귀 타이밍도 신지드와 엇비슷하기 때문에 사실상 신지드가 확실하게 우위를 잡을 수 있는 타이밍이 거의 없고, 초근접이 강제되는 신지드는 문도에게 강심 스택 각을 계속 주게 된다. 그나마 궁극기에 치감이 있으니 교전에서 치유 속도에 의존하는 문도의 탱킹을 조금은 억제할 수 있으나, 문도 입장에서는 맞라이너가 지속 AP 딜러인 신지드이니 부담 없이 대자연 등의 아이템을 올리면 신지드 단독으로는 문도를 뚫어내기가 사실상 불가능해진다. 라인전에서 문도 박사의 성장을 억제하는 건 불가능하고 한타 단계에서 신지드가 고점이 더 높다는 점을 이용해, 신지드가 치감을 뿌리고 적진을 헤집으며 어그로를 끄는 사이 아군들이 한타를 잘 해 주기를 바라야 한다."}], "general_counters": ["티모", "퀸", "베이가", "르블랑", "케넨", "라이즈", "하이머딩거", "카르마", "블라디미르", "말파이트", "럼블", "뽀삐", "스몰더", "판테온", "레넥톤", "요릭", "올라프", "스카너", "우르곳", "크산테", "트런들"]}
{"champion": "쓰레쉬", "aliases": [], "hard_counters": [{"name": "블리츠크랭크", "reason": "똑같은 그랩류 챔피언이지만 그랩의 특성과 챔피언의 특성이 달라서 고전하게 된다. 쓰레쉬는 많은 유틸을 가진 서폿계의 리 신이지만 블리츠크랭크는 그냥 한 놈만 걸려라 하고 잘라먹기에 특화되어 있는 챔피언이다. 블리츠크랭크의 로켓 손과 쓰레쉬의 사형 선고가 동시에 적중하는 상황을 많이 보았을 텐데 이는 사형 선고의 긴 시전 시간 때문에 블리츠는 그랩에 맞을 걸 알면서도 가만히 있는 표적인 쓰레쉬를 당겨오기 쉽기 때문이다. 만약 사형 선고만 맞혀서 돌진한다고 해도 블리츠는 쓰레쉬와 다르게 튼튼하고 패시브까지 방어막이라 쉽게 킬을 낼 수 없는 반면, 블리츠에게 돌진해온 쓰레쉬는 그저 좋은 밥일 수밖에 없다. 쓰레쉬의 아이덴티티인 어둠의 통로 또한 블리츠크랭크의 그랩으로 쓰레쉬에게 날아가던 챔피언을 그대로 다시 끌고 오는 상황도 심심치 않게 볼 수 있기에 쓰레쉬는 블리츠크랭크를 상대할 때 게임 내내 고전할 수밖에 없다. 라인전도 녹록지 않은 게, 출시 당시에는 쓰레쉬가 워낙 깡패여서 블리츠가 당기면 오히려 맞딜을 해서 때려잡을 수 있었지만 거듭된 너프로 이젠 쓰레쉬가 끌리면 블리츠의 폭딜에 맞아죽는다."}, {"name": "하이머딩거", "reason": "잘 알려지지 않았지만 봇 및 서포터 하이머딩거는 쓰레쉬를 포함한 모든 그랩류 서포터의 저승사자다. 사형 선고 모션 보고 포탑 설치하면 끝. E라도 맞히겠다고 포탑을 타고 들어가는 건 그냥 자살행위이며 하이머 서폿이면 라인전 내내 포탑 아래에 박혀있게 된다."}], "general_counters": ["카르마", "룰루", "나미", "세나", "제라스", "모르가나", "자이라", "멜", "아무무", "노틸러스", "갈리오", "마오카이", "알리스타", "브라움", "타릭", "시비르"]}
{"champion": "아리", "aliases": [], "hard_counters": [{"name": "리산드라", "reason": "대회에서도 꾸준히 언급되며 나왔던 아리의 하드 카운터. 리산드라가 무난하게 6레벨을 찍게 두면 하드 CC기와 높은 주문력 계수로 아리의 포지셔닝을 극도로 제한할 수 있다. 6레벨 이전이라도 리산드라에게 타겟팅 CC기가 없다면 아리 또한 이동기가 없는 셈이기 때문에 아리가 리산드라보다 라인전 절대 우위에 있는 것도 아니다. 리산드라의 CC에 대응하느라 유틸템 위주로 챙기면 안 그래도 낮은 아리의 딜량은 아예 바닥으로 곤두박질치고, 심지어 리산드라의 이동기인 E는 이동의 때와 여부를 리산드라가 결정하기 때문에 아리가 능동적으로 받아치기도 어렵다. 반드시 정화를 채용하자."}, {"name": "야스오", "reason": "기본 공격과 모든 스킬이 바람 장막 하나에 전부 다 막히며, 우월한 기동성의 질풍검과 1~5레벨 사이의 강력함으로 6레벨을 찍기 전까지 야스오가 우위를 점하며 아리를 바싹 말려죽일 수 있다. 만약 6레벨을 서로 반반을 가서 찍었다 해도 야스오의 에어본을 맞는다면 최소 점멸이나 혼령 질주가 빠지고 빠진다 해도 생존을 보장할 수 없다. 심지어 대회에서도 아리를 상대로 야스오가 1레벨에 E를 찍는 빌드가 개발되고 난 이후에는 아리가 극초반의 감전 딜교조차 기대해 볼 수 없게 되었다. 후반 성장성 역시 야스오가 밀리는 것도 아니다. 아리가 가장 강한 시점인 6~12레벨 시점의 한타나 개활지 교전에서 반드시 이득을 봐야 한다."}, {"name": "문도 박사", "reason": "아리가 상대하기 힘든 요소를 모두 가진 하드 카운터. 저티어에서는 아리 상대로 미드 문도 박아도 될 정도. 어느 상황에서든 아리가 안심할 수 없다. 기본적으로 회복 능력이 뛰어난 탱커라서 아리의 약한 딜로는 잡기가 힘든 데다 어찌저찌 매혹을 걸러 가까이 가면 뼈톱에 맞아 체력이 뭉텅이로 깎여나간다. 거기에 뼈톱을 다 피했다고 가정해도 문도의 근접전 능력은 탱커들 중에서도 뛰어난 편에 속하기 때문에 순식간에 털려나간다. 거기에 매혹을 맞힌다고 해도 패시브로 매혹을 한 번 막아낼 수 있다."}, {"name": "노틸러스(서폿)", "reason": "대회에서 아리의 맞라인 카운터로 리산드라와 르블랑이 대표적이라면 다른 포지션의 카운터로는 노틸러스가 첫손가락에 꼽히고 있다. 일단 닻줄 견인의 판정이 굉장히 좋아서 아리를 잡아채기 쉬우며, 타겟팅 에어본인 폭뢰 때문에 아리는 노틸러스 앞에선 와리가리 치기 어렵다."}], "general_counters": ["나리피", "르블랑", "제드", "카사딘", "카타리나", "피즈", "아크샨", "다이애나"]}
{"champion": "아무무", "aliases": [], "hard_counters": [{"name": "뽀삐", "reason": "진입 봉쇄 분야의 끝판왕이자 하드 카운터 1호. 뽀삐의 W는 저지불가가 없는 모든 돌진기를 카운터 치는 스킬이라 Q가 원천봉쇄 당한다. 기본적으로 체력 탱커라 괜찮을 거 같다 생각하면 절대 안 된다. 뽀삐는 실드량이 볼리베어의 베리어의 약 1.5배 정도 돼서 단단하고 방마저도 올리기에 따기가 불가능에 가깝기에 극초반 아니면 따버릴 기회조차 없다. 가장 가관인 때는 당연히 한타다. 아무무는 한타가 좋지만 뽀삐가 W 켜고 막고 있으면 거슬리는데다 다른 챔피언에 맞아도 뽀삐가 짧게 궁을 누르면 긴 에어본으로 다굴, 길게 누르면 아예 아무무를 집으로 날려버려서 아무무 존재 자체를 부정당하게 한다."}, {"name": "알리스타", "reason": "알리스타 상대론 그 누구를 따는 것도 상상도 해선 안 된다. 챔피언 설계부터가 그랩 폿 및 진입형 암살자들을 카운터치는 스킬셋이라 아무무가 누구를 물든 박치기(W)로 멀리 날리거나 분쇄(Q)로 에어본시켜서 도주의 기회를 만드는 등 진입을 원천 차단하는데다 어찌저찌 기절시켜도 꺾을 수 없는 의지(R)로 바로 해제해서 쿵쾅 콤보를 박으면 단단한 아무무라도 집중 포화를 당하면 죽기 쉬워서 사실상 타릭과 함께 서폿 아무무 최악의 상대로 유명하다."}], "general_counters": ["탐 켄치", "모르가나", "타릭", "올라프(정글)", "그레이브즈(정글)", "킨드레드(정글)", "워윅(정글)", "사일러스(번외)"]}
{"champion": "아우렐리온 솔", "aliases": ["아우렐리온솔", "아우솔"], "hard_counters": [{"name": "요네", "reason": "아우렐리온 솔의 하드 카운터 중 하나로, 초반이 강한 편은 아니지만 아우렐리온 솔은 아예 최약인 데다 상성도 밀려서 게임 내내 두들겨 맞는다. 아우렐리온 솔의 느린 기동력으로는 필멸의 검을 피하기가 불가능에 가깝고 유성도 영혼해방으로 피해 버린다. 운명봉인은 경로가 보이지만 필멸의 검과 마찬가지로 피할 방법이 없다. 여러모로 아우렐리온 솔의 영향력을 아예 없애 버릴 수 있는 하드 카운터 중 하나. 요네는 진입에 궁극기인 운명봉인이 차지하는 비중이 굉장히 커서 존야의 모래시계로 씹는다면 다수 교전에서 변수가 적어지기에 존야의 모래시계를 올리면 좋다."}, {"name": "나피리", "reason": "통계상 나타나는 최고의 하드 카운터. 아우렐리온 솔은 다르킨 단검을 피할 기동력도, 나피리의 추격을 도망칠 방법도 없다. 심지어 암살자 중에서도 성장성이 탑급으로 좋아 후반을 바라보기에도 쉽지 않다. 특히 1대1 상황에서는 굉장히 긴 사거리의 타겟팅 돌진기라는 피할 방법이 없는 돌진기로 아우렐리온 솔을 물어뜯어 죽인다."}, {"name": "판테온", "reason": "라인전부터 아우렐리온 솔에겐 지옥이 따로 없다. 우선 빛의 숨결은 방패 돌격에 막히고 별의 비행은 방호의 도약에 끊긴다. 그렇다 보니 몸이 약한 아우렐리온 솔에게 방호의 도약으로 기절을 건 후 창을 맞춘 다음 방패 돌격으로 견제를 무시하는 딜교를 해 아우렐리온 솔을 말려 죽일 수 있다. 라인전 이후에도 아우렐리온 솔에겐 한숨 돌릴 타이밍 따위는 없는데, 판테온의 궁극기인 거대 유성이 아우렐리온 솔에게 극강의 골칫거리이기 때문이다. 합류 속도 차이는 물론이거니와 사이드에서 파밍하는 아우렐리온 솔을 궁극기로 단 한 번에 처리할 수 있으니 그야말로 극강의 카운터이다."}, {"name": "제라스", "reason": "서폿으로 나와서 라인이 다르면 모를까 같은 미드로 나오면 가히 최악의 하드 카운터 중 하나다. 우선 유효 사거리가 제라스가 한참 길기에 제라스가 우위를 점하는데, 솔은 딜을 Q로 넣으려면 아예 움직일 수 없이 위치가 고정돼서 제라스의 기술을 피할래야 피할 수가 없다. 여기에 이동속도도 매우 낮고 별의 이동은 순간적인 기동성이 매우 떨어져 제라스의 기술을 피할 수 없는 건 매한가지고, 설령 딜 각이 나와서 근접하려 해도 충격 구체를 피할 기동성이 없어서 충격 구체를 맞고 기절에 걸려 근접전이 약한 제라스지만 오히려 근접전에서 솔을 털어먹는다. 궁극기도 느려터진 솔의 이동속도로는 피하기가 매우 어렵고 설령 Q로 딜을 넣고 있는 상황이면 아무것도 못하고 딜을 다 맞을 수밖에 없다. 여기까지만 해도 벅찬데 이 모든 악조건을 다 뚫고 Q를 맞히는 데 성공해도 초반 Q의 대미지는 매우 저열하기 때문에 아무리 몸이 약한 제라스라해도 별 타격이 안 가는데 제라스의 공격 하나하나가 솔에게는 맞으면 체력 1/3이 뭉텅이로 빠져나갈 정도로 딜량 차이도 너무 압도적이다, 여러모로 솔의 하드 카운터이기 때문에 라인전에서 만나면 닷지를 해야 할 정도의 극상성이다."}, {"name": "흐웨이", "reason": "아우솔의 주력 딜링기인 Q는 제자리에서 피해를 주는 구조로, 이 말은 맞히긴 어렵지만 맞혔을 때의 후속 밸류가 큰 QW, QE, EW 등의 과녁이 대놓고 눈앞에 떨어졌다는 말과 같다. 그게 아니더라도 EE 한번이면 Q의 정신 집중이 끊기고 W와 함께 날아오더라도 직선 이동기이기에 QE, EQ 등으로 카운터치기도 쉽다. 아우솔 입장에서는 라인전부터 심하게 고통받으며 극후반을 노려야만 하는 최악의 하드 카운터."}, {"name": "사일러스", "reason": "라인전이 약하다고 평가받는 사일러스지만 아우솔에게는 그야말로 저승사자나 다름없는 라인전 한정 하드 카운터나 다름없다. 우선 도주/억압이 라인전에서 가장 큰 문제인데, 사일러스의 도주/억압은 CC기와 돌진기를 같이 주는 우수한 기술이나 미니언에 막히고 시전 속도가 그리 빠르지 않다는 단점을 가지지만, 아우솔은 느려터져서 사실상 이를 피하는 게 불가능한 수준이고 Q를 사용하는 동안에는 아예 멈춰있기에 과장 좀 보태면 아우솔 한정으로는 준 타겟팅 기술이나 다름없어진다. 여기에 체급 차이도 극심해서 딜교 자체가 성립이 안 되는 수준이고 사일러스도 라인전이 약한 편이지만 아우솔은 그 이상으로 약해 Q 대미지는 간지러운 수준인데 사일러스의 공격은 아우솔에게 매우 아픈지라 라인전에서 완전히 압살당하는 극악의 상성이다. 그나마 다행인 점은 강탈로 궁극기를 뺏어가도 이를 강화할 방법이 없어 별가루 0스택 유성만 사용해 천상강림을 뺏기지는 않지만 사일러스는 일단 돌진기만 두 개인지라 라인전에서 아우솔의 궁을 피하는 게 매우 쉽지만 반대로 아우솔은 0스택 유성이어도 이동속도가 느리고 W는 즉발이 아니라 피하는 게 매우 어렵다. 한타에서는 아우솔이 사일러스보다 우위에 있긴 하나 라인전에서 도저히 상대가 안 되는 수준이라 밴을 하는 것도 괜찮은 선택이다."}, {"name": "탈리야", "reason": "물몸 뚜벅이에 생존기도 없지만 성가신 상대. 빛의 숨결을 쓰는 와중에는 자리가 고정되어 E-W 콤보의 과녁으로 전락하며, 별의 비행으로 로밍이나 도주/갱 회피를 하려고 할 때 탈리야가 대지의 파동을 깔면 아우렐리온 솔은 지뢰를 밟는 순간 그 자리에서 굳어버린다. 로밍을 가려도 해도 탈리야의 재빠른 라인 클리어로 2킬 이상 내지 못하면 역으로 손해를 보는 그림이 나온다. 후반에도 탈리야가 아우렐리온 솔만 대인 마크하면 궁극기 빼고 뭘 하기가 힘든 수준이니 아우렐리온 솔이 가히 원톱급 왕귀챔임에도 후반까지도 거슬리는 상대이다. 솔로랭크 특성상 스탠딩 메이지끼리의 매치업이라 상대 승률이 막 엄청나진 않지만, 미드와 더불어 다른 라인이 터져나가는 걸 보기 싫다면 탈리야를 상대로 아우렐리온 솔을 픽하지는 말자."}], "general_counters": ["카타리나", "에코", "피즈", "이렐리아", "아리", "니코"]}
{"champion": "아이번", "aliases": [], "hard_counters": [{"name": "피들스틱", "reason": "장인들조차 상대하기를 극도로 꺼리는 상성. 앞에 나온 렝가보다도 더 힘들다. 렝가는 단일 암살을 하는 역할을 하지만 피들스틱은 높은 계수에 럼블 뺨치는 깡딜, 스킬이 Q를 제외하곤 전부 광역기라 아이번의 수풀을 역이용해 한타를 터뜨려 버린다. 아이번이 Q를 쓰면 피들스틱의 암살을 막을 수 있지만 피들스틱은 밴시의 장막 등 대응 수단이 충분하며 아이번이 허수아비를 피해 피들스틱 본체에 정확히 Q를 쓸 수 있다는 보장도 없다. 피들스틱의 Q에는 위장 후 스킬 사용 시 공포를 먹이는 효과가 달려있어 아이번이 만든 수풀에 들어가 까마귀 폭풍으로 광역 공포를 먹이고 상대팀의 포화까지 더해지면 아이번의 보호막 따위로는 팀을 절대 보호하지 못한다. 피들스틱은 W가 3렙이 되면 정글링이 엄청 빨라져 오브젝트 싸움도 밀릴 가능성이 높다. 심지어 피들스틱도 아이번 버금가는 장인챔이라 숙련도 차이로 극복하기도 어렵다. 아군이 피들스틱을 마킹 가능한 챔피언을 골라주기를 바라는 수밖에 없다."}], "general_counters": ["렝가", "마오카이", "그레이브즈", "카직스"]}
{"champion": "아지르", "aliases": [], "hard_counters": [{"name": "벡스", "reason": "깡딜도 무시무시한데 스킬셋 자체도 매우 위협적이며, 황제의 진영으로 한 번 막아낸다고 하더라도 공포 때문에 아지르가 대처할 여지가 없이 그대로 터져 버리기 십상이다. 라인전부터 한타까지 지표상으로 크게 밀리는 하드 카운터 중 하나."}, {"name": "르블랑", "reason": "밴 1순위. 2025 시즌 기준, 대다수 상위권 아지르 유저의 고정 밴 카드 대상인 하드 카운터이다. 라인전부터 르블랑의 일방적인 딜교에 대처하기 쉽지 않고 르블랑의 강력한 교전과 로밍으로 팀이 터져나가기 일쑤다. 아지르의 딜링에 있어 가장 중요한 것은 공간 컨트롤인데, 르블랑의 왜곡은 자기 마음대로 병사의 사정거리를 벗어날 수 있는 스킬이기에 답이 없다. 이는 아지르의 와일드 카드인 토스에도 해당되므로, 밴이나 닷지가 속 편하다."}], "general_counters": ["에코", "조이", "키아나", "요네", "이렐리아", "제드", "아리", "베이가", "아우렐리온 솔", "제라스", "탈리야", "신드라"]}
{"champion": "아칼리", "aliases": [], "hard_counters": [{"name": "렝가", "reason": "탑에서 만난다면 6렙 전 라인전은 거의 8 대 2 수준으로 매우 불리하다. 특히 렝가는 장인 유저가 굉장히 많은 만큼 대부분 높은 숙련도를 자랑하는데 렝가가 숙련도에 비례해서 성능이 발휘되는 챔피언이라는 것을 생각해보면 라인전이 사실상 지고 들어가는 셈. 워낙 한 사이클 누킹력과 누킹 속도가 빠른 편이라 장막으로 제대로 대처하기도 어렵고 E와 궁극기에 절대 시야가 달려있어 라인전에선 견제는커녕 부쉬 근처로 접근도 하지 못하고, 딜교를 해도 W의 피해 회복 효과 때문에 아칼리만 손해를 본다. 그나마 아칼리보다 한타 기여도가 저열한지라 한타에서는 유리하겠지만 렝가는 초반에 스노우볼 굴리는 챔피언이므로 아칼리에게 절대 시간을 주지 않는다. 반드시 점화를 채용하자."}, {"name": "클레드", "reason": "최악의 하드 카운터. 후픽으로 클레드가 튀어나오면 닷지를 추천한다. 클레드 Q와 E 스킬은 절대 시야가 달려있고 추격 능력도 뛰어난지라 당연히 딜교환을 이길 수 없다. 클레드가 주문포식자 등의 마저템을 구비하면 그마저도 불가능하다. 정글러를 불러도 클레드는 줄타기에 특화된 챔피언이라 마무리하기가 어려울뿐더러 심심찮으면 갱승이 나고, 역갱까지 당하면 정글러는 물론 그대로 라인도 터진다. 렝가와 마찬가지로 라인전 이후 한타 페이즈에선 아칼리가 우위를 점하는 몇 안 되는 탑 챔피언이지만 그마저도 동성장 시에만 해당되는 말이며 스노우볼링에 특화된 챔피언인지라 솔킬을 몇 번 따였다면 유통기한은 둘째치고 클레드가 로밍으로 다른 라인으로 폭파시키는 게 가장 큰 문제다. 스플릿 능력이 매우 차이나기 때문이 아칼리가 잘 컸어도 스플릿과 다른 라인이 터진 걸 수습할 능력이 되질 못한다. 브루저 중에 드물게 아칼리 베테랑들도 인정한 카운터다."}, {"name": "일라오이", "reason": "기동력 제외하고 일라오이 상대로 유리한 구간이 단 하나도 없는 하드 카운터. 초반에 아칼리가 유리하지만 일라오이가 맞딜해 줄 이유가 없다는 것이 문제. 6렙 이후부터 후반까지 일라오이가 스플릿, 교전 등등 아쉬운 점이 없다 보니 승리를 장담하기가 어렵다."}, {"name": "트위스티드 페이트", "reason": "상대 승률 43%에 달하는 최악의 상대. 아무리 트페가 라인전이 허약하다고는 하지만 기본적으로 원거리 챔피언에 아칼리도 무결처형을 배우기 전에는 화력이나 폭딜이 뛰어나지 않고 유지력도 그렇게 좋지는 않아서 6렙 전 지표부터 밀린다. 6렙 전도 문제인데 시간이 지날수록 트페는 와일드카드 딸깍 한 번으로 라인을 한 방에 다 지우는 반면 아칼리는 오연투척검을 2~3번씩 써가면서 서커스를 해야 겨우 라인을 지울 수 있기 때문에 라인 관리 능력부터 아예 상대가 안 되며 항상 트페만 선턴을 가져가게 되는 것이 제일 문제다. 이것이 문제가 되는 이유는 게임 굴리는 능력이 탁월한 트페에게 계속해서 선턴을 내준다는 것은 트페 하나 때문에 탑과 바텀이 계속해서 사려야하는 골치 아픈 상황이 만들어지기 때문이고 이는 탑과 바텀뿐만 아니라 정글에게도 영향을 주는 등 게임 전반적으로 트페의 움직임 하나에 팀원 모두가 고통받는 상황이 만들어질 수 있다는 것이 가장 큰 문제다. 특히나 티어가 오를수록 이런 선턴을 활용한 움직임 하나가 미드 차이를 만들어내며 무기력하게 게임을 내주는 결과가 꽤 많이 나온다는 것을 생각하면 상당히 골치 아프다. 게다가 아칼리는 하드 CC기도 없어서 트페가 바로 앞에서 대놓고 궁을 타도 저지할 수단이 없으며 전술했듯이 라인 클리어 능력이 넘사벽으로 차이가 나는 탓에 라인전 종료 후, 사이드 운영 및 합류 속도조차 압도적으로 밀린다. 중반 이후로 넘어가더라도 궁극기의 절대 시야 때문에 장막을 활용한 어그로 핑퐁이 불가능해 아칼리의 장점이 반 토막 나며, 근거리 암살자인 아칼리에게 확정 스턴은 매우 거슬리며 절대 시야와 연계되어 장막을 펼치자마자 궁극기-스턴 콤보로 한 번에 터질 수 있어 라인전을 이기기도 쉽지 않은데 라인전을 이기더라도 게임을 지는 상황도 자주 나온다."}, {"name": "베이가", "reason": "아칼리가 날뛰던 시절에도 베이가는 하드 카운터급까지는 아니지만 라인전부터 압살하기는 상당히 힘든 준 카운터로 여겨져 왔다. 아칼리가 아무리 높은 기동성과 딜교에 유리한 면모를 보이지만 결국은 점멸 판정이 아닌 일반적인 이동기를 쓰기 때문에 지평선에 막힌다는 한계가 있기 때문이다. 이동기를 쓰다가 지평선을 밟으면 그 자리에 멈춰서 기절하기 때문에 딜교에서 손해를 보게 된다. 한타 가서는 장막을 펼치면 그 위치에 그대로 지평선을 걸쳐 못 나오게 만드는 상황까지 펼쳐진다. 때문에 지평선이 걸쳐지는 게 보이면 표창곡예로 진입하지 말고 후퇴해서 지평선의 범위 밖으로 나가는 게 좋다. 그러나 베이가도 결국엔 물몸에 생존기가 부실한 뚜벅이 메이지인지라, 암살자인 아칼리의 표적이나 다를 바 없어 지평선이 빠진 베이가는 아칼리의 폭딜에 순식간에 도륙나기도 쉽다. 결국 서로의 실력이 비등비등하다는 가정 하에는 라인전 딜교보다는 로밍 등의 운영으로 이득을 챙기거나 한타 때에 승패가 결정나는 상성이라 볼 수 있다. 무엇보다 베이가의 무한한 성장성 때문에 게임이 후반으로 접어들면 암살하려 들어갔다가 네 자릿수 데미지 궁극기 맞고 역으로 폭사할 수 있으니 시간을 줘서는 안 된다."}], "general_counters": ["그라가스", "럼블", "리 신", "피들스틱", "레넥톤", "마오카이", "스카너", "나서스", "문도 박사", "퀸", "가렌", "탐 켄치", "갈리오", "스웨인", "나피리", "리산드라", "말자하", "벡스", "탈리야", "아지르", "카사딘", "흐웨이", "아리", "키아나"]}
{"champion": "아크샨", "aliases": [], "hard_counters": [{"name": "나피리", "reason": "하드 카운터 중 하나. 기본적으로 서는 라인이 같아서 자주 만나는데다 암살자인 것도 까다로운데, 나피리의 QQ는 아크샨의 딜교환보다 더 멀리서 빠르게 수행할 수 있어 아크샨의 장점인 이기적인 딜교환을 못 하게 만들며, 하술할 녹턴의 궁극기와 마찬가지로 W의 대상이 되면 갈고리를 타도 끝까지 쫓아가므로 라인전도 안 되고 교전도 안 된다."}, {"name": "이렐리아", "reason": "라인 클리어도 빠른데다 4스택을 쌓은 후 들어오는 초반 딜교는 매우 아파서 상대하기 힘든데, 이렐리아가 아크샨에게 Q로 붙은 상태로 갈고리를 타면 굉장히 잘 끊기는 편이기에 매우 까다롭다. 거기다가 챔피언 특성상 쉽게 녹지도 않고 어느 정도 딜을 버틴 후에 들어오게 되는데, 이때 물몸 아크샨이 E를 맞으면 바로 이렐리아한테 킬을 헌납할 수 있는 등 상대하기가 엄청나게 까다롭다. 가급적이면 밴을 추천하는 챔피언."}, {"name": "오공(탑)", "reason": "대 원거리 AD 결전병기. 라인전에서 만난다면 닷지를 고려해야 할 수준. 아크샨의 평타 사거리는 500으로 오공의 E 사거리인 625와 차이가 매우 많이 나는 편으로, 라인전에서 평타를 칠 수가 없는 수준이다. 평타를 치려고 다가가는 순간 E로 딜교를 거는 오공을 막을 방도가 없다. 심지어 오공은 패시브에 방어력 증가와 체젠이 붙어있어 흠집조차 낼 수 없다. 또한 아크샨의 궁극기는 오공의 분신으로 전부 막을 수 있다. 오공이 아크샨에 대한 이해도가 조금이라도 있으면 갈고리를 걸고 이동할 때 궁극기를 사용해 돌진을 끊어버릴 것인데 이렇게 궁극기에 띄어지는 순간 아크샨이 자력으로 오공을 떨쳐낼 수단이 아예 없기 때문에 죽었다고 봐야 한다."}, {"name": "올라프(탑)", "reason": "가급적이면 닷지를 추천하는 챔피언. 아크샨의 평타 사거리는 500으로 올라프의 역류(Q) 사거리는 425~1000이라 2배 차이가 나는 편으로, 아크샨에게 순식간에 붙을 수 있는 챔피언에도 속한다. 게다가 체력 회복, 공격 속도 증가, 보호막으로 버티기, 낮은 체력에서 더욱 강해진다는 특징으로 인해 세트 이상으로 유지력이 말도 안 되는 수준이기 때문에 전반적으로 올라프에게 완전히 카운터 당한다. 올라프의 유일한 순간 폭딜 고정 피해인 무모한 강타(E)와 쿨타임이 짧고 무한 슬로우로 맞견제할 수 있는 역류(Q)로 아크샨의 포지셔닝을 지독하게 망가뜨릴 수 있다. 그나마 시간은 아크샨의 편이긴 하나 올라프는 절대로 후반을 가게 두지 않을 것이다. 올라프의 유통기한은 어디까지나 대규모 한타 및 대치 구도에서 가정 하이고, 순수 1대1로는 후반에도 불편한 건 아크샨이며 여과 없이 찢길 각오를 해야 한다."}], "general_counters": ["이렐리아", "다이애나", "야스오", "판테온", "레넥톤", "아트록스", "잭스", "말파이트", "워윅", "람머스"]}
{"champion": "아트록스", "aliases": ["아트"], "hard_counters": [{"name": "이렐리아", "reason": "전통의 대표 카운터. 칼날 쇄도(Q)로 미니언 사이를 여기저기 돌아다녀 Q를 맞히기 정말 힘들다. 이렐리아가 어떤 미니언에 탈지 예상해서 Q를 맞힐 위치를 설계 해놓거나 아군 미니언과 거리를 벌려둬야 한다. 라인전 단계에서 이겨놨더라도 이렐리아에게 몰락한 왕의 검이 나온 이후로는 그냥 맞딜 자체를 피하는 것이 좋으므로 결국 한타로 승부를 봐야 하 는데, 한타는 아트록스의 영역이기도 하거니와 덤불 조끼와 판금 장화가 나오면 맞딜도 편해지기에 라인전에서 킬만 안 퍼줘도 시간이 지나면 충분히 답이 있다. 흡혈 특성상 상대와의 성장 차이와 맞다이에서의 격차는 비례해서 배로 벌어지기 때문에 이렐리아의 갱 회피가 떨어지는 점을 노려 갱킹으로 킬을 한 번만 따도 숨통이 확 트인다."}, {"name": "암베사", "reason": "스킬을 사용할 때마다 이동하기 때문에 사실상 근접해서 싸우는 칼리스타나 다를 게 없기 때문에 아트록스가 Q를 맞히는 건 거의 불가능한 수준이며, 암베사는 후반으로 갈수록 성장성이 아트록스를 상회하기 때문에, 후반으로 갈수록 더욱 상대하기 힘들어진다. 한타도 암베사가 아트록스에 비해 밀리지 않으므로 사실상 아트록스를 라인전과 한타 모두 카운터 칠 수 있는 몇 안 되는 챔피언이다."}, {"name": "신지드", "reason": "기본적으로 초반 라인전이 심각하게 약한 챔피언이기 때문에 이 단계에서는 문제가 발생하지 않는다. 하지만 Q에 모든 딜링이 달려 있는 아트록스에게 궁극기와 패시브의 빠른 이속과 빠른 2티어 신발을 선호하는 신지드는 갈수록 잡기 힘든 상대가 된다. 설상가상으로 던져넘기기(E)로 아트록스의 Q 각을 흐트러뜨리거나 초강력 접착제(W)로 E까지 봉인시키면 Q를 맞히는 것은 거의 불가능에 가깝다. 또한 신지드의 궁극기에는 기본적으로 치유 감소 효과가 달려있어서 6레벨 이후 깜짝 킬 각이 잡히기도 한다. 물론 아트록스 역시 한타에서 파괴력 있는 브루저로 분류되지만, 대놓고 왕귀형 챔피언인 신지드를 상대로는 후반 한타 영향력이 상당히 밀리는 편이다. 실제 통계상 아트록스의 라인 킬 확률은 신지드보다 항상 크게 앞서지만 상대 승률은 45%를 넘은 적이 거의 없을 정도의 극카운터이다. 심지어 신지드는 아트록스를 보면 처음부터 오버파밍 전략으로 아예 상대조차 안 하는 경우가 많고, 이걸 따라가자니 결정력이 딸리는 아트록스 입장에서는 작정하고 도망가는 신지드를 절대 못 잡는다. 오히려 잡겠다고 끈질기게 따라갈수록 독기에 범벅이 되어 깜짝 킬 각을 내주는 불상사가 터질 수 있어서, 신지드의 오버파밍을 허용할 수밖에 없다."}], "general_counters": ["피오라", "브라이어", "베인", "카밀", "아칼리", "오공", "판테온", "워윅", "트린다미어", "클레드", "올라프", "일라오이", "크산테", "오로라"]}
{"champion": "아펠리오스", "aliases": ["아펠"], "hard_counters": [{"name": "직스", "reason": "아펠이 개사기였던 '그 시절'에도 대회에서 종종 나온 카운터 픽. 비원딜 중에서 라인전이 그렇게 세진 않지만 사거리 차이가 많이 나기 때문에 중력포를 제외하면 메이킹이 어려운 아펠리오스 입장에선 서포터의 도움 없이는 킬 각을 잡기 어렵다. 무난하게 가는 경우 직스 특유의 엄청난 라인 클리어와 준 글로벌 궁극기의 영향으로 아펠리오스는 손발이 묶이기 쉬우며 정면 승부를 하려고 해도 뚜벅이인 아펠리오스에게 폭약과 지뢰의 지역 장악 능력은 매우 부담이 되며 팔 길이 차이가 너무 심해서 아펠리오스가 딜을 해보지도 못하고 포킹의 희생양이 되는 경우가 많다."}, {"name": "야스오", "reason": "최악의 하드 카운터. 애당초 원거리 딜러나 마법사들의 천적이라고 악명이 높은 야스오인데, 아펠리오스는 특히나 야스오에게 약하다. 아펠리오스의 대부분의 스킬이 바람 장막에 막히고, 야스오는 장막이 없어도 질풍검을 이용하여 스킬들을 피할 수 있기 때문이다. 특히나 반월검 스택만 쌓이면 근접 브루저를 넘어 탱커까지 가볍게 녹여버리는 DPS를 가지지만 바람 장막 앞에서는 반월검 스택도 전부 증발해 버리니 더더욱. 아펠리오스는 한타 구도에서 힘을 발휘해야 하는 챔피언인데, 야스오가 장막으로 스킬을 막아주고 궁으로 접근하면 순식간에 아펠리오스의 존재감이 약해질 수밖에 없다. 게다가 아펠리오스는 뚜벅이이기 때문에, 야스오에게 이러한 플레이는 어렵지 않다. 결국 비슷한 실력일 경우 야스오가 우위를 차지하기 쉽다. 다만 예외로 맞라인일 시 1레벨에는 아펠리오스가 유리하니까 그때 최대한 망쳐두자."}], "general_counters": ["케이틀린", "미스 포츈", "바루스", "애쉬", "드레이븐", "스몰더", "사미라", "트위치", "브라움", "갈리오", "노틸러스", "레오나", "렐", "알리스타", "아무무", "바드"]}
{"champion": "알리스타", "aliases": ["알리"], "hard_counters": [{"name": "사일러스", "reason": "라인전에서는 상대할 일이 없지만, 알리스타의 궁극기가 사일러스와 너무 지나치게 잘 맞아서 하드 카운터로 분류되는 케이스. 원래도 뛰어난 전투력과 지속력을 자랑하는 챔피언인데, 여기에 꺾을 수 없는 의지로 하드탱킹까지 시전하면 그야말로 완전체가 되어버려 막기가 정말 어려워진다. 라인전 단계에서 처참하게 망해 버리면 그나마 낫겠지만, 잘 큰 상태에서 훔치면 답이 없는 수준. 대회에서 알리스타의 픽률을 크게 떨어트린 원흉으로, 솔랭에서도 사일러스가 노픽 노밴이면 알리스타를 고르는 걸 망설이게 할 정도이다."}], "general_counters": ["룰루", "모르가나", "뽀삐", "샤코", "잔나", "마오카이", "브라움", "벨코즈", "브랜드", "자이라", "제라스", "럭스", "갈리오", "그라가스", "타릭", "탐 켄치", "애쉬"]}
{"champion": "암베사", "aliases": [], "hard_counters": [{"name": "뽀삐", "reason": "극상성. 이동기 기반 챔피언의 카운터 하면 절대 빼놓고 얘기할 수가 없는 천적. 그야말로 숨도 못 쉬는 라인전을 경험할 수 있다. 패시브 평타 짤짤이와 Q에 달린 퍼뎀 때문에 탱커치고 높은 딜량을 가졌으면서 W만 켜면 패시브는 아예 사용조차 할 수 없고 어쩌다 실수로 벽꿍을 당하거나 고정되기라도 하면 Q 2타까지 고스란히 맞아 압도적인 딜교환 손해를 보며, 타겟팅 CC기에 에어본 궁극기까지 보유해서 라인전이든 소규모 교전이든 한타든 암베사를 완벽하게 마크할 수 있다. 모든 지표가 암베사를 압도하는 극 카운터이며, 탑뿐만 아니라 정글과 서폿도 가능한 멀티 포지션 챔피언이기 때문에 맞라인전이 아니더라도 게임 내내 암베사를 견제한다."}, {"name": "나서스", "reason": "칼리스타와 유사하게 쇠약을 걸면 돌진 속도가 느려지며, 기력 관리를 책임지는 패시브 평타의 발동 또한 방해받는다. 더군다나 암베사의 부실한 라인전 능력으론 나서스를 말려놓는 것도 불가능하며 시간도 나서스의 편이기에 볼리베어 못지않은 극상성이다."}, {"name": "레넥톤", "reason": "암베사의 대표적인 하드 카운터. 카이팅을 하며 싸워야 하는 암베사이지만 딜교를 시도하면 레넥톤은 확정 CC기인 무자비한 포식자(W)를 이용해 암베사의 발을 묶어놓고 일방적으로 때린 뒤 빠지거나, 피가 빠진 암베사를 자르고 토막내기로 끝까지 추격할 수 있다. 착취 카이팅 갉아먹기로 라인전을 버티려고 해도 레넥톤은 라인 유지력이 탑 챔피언 중에서도 최상급이기 때문에 궁을 찍기 전까지 유지력 수단이 없는 암베사가 천천히 말라간다. 무엇보다 가장 큰 문제는, 강화된 무자비한 포식자로 배척의 보호막을 제거한다는 것. 실드로 탱킹을 하는 암베사는 탱킹 수단 하나가 없는 셈이라 분노W+궁 콤보에 다이브 방어도 안 된다. 암베사의 R은 맞딜이 아닌 접근용 스킬이라 궁극기의 파워도 레넥톤이 훨씬 강하기에 초중반 내내 주도권을 내줘야만 한다. 후반 포텐셜은 암베사가 높긴 하지만 레넥톤을 상대로 암베사가 포텐셜이 나오는 타이밍까지 무난하게 성장하기는 매우 어려우며 레넥톤도 거듭된 상향으로 과거만큼 후반에 힘이 꺾이지 않아 라인전부터 교전까지 레넥톤에게 휘둘리며, 설령 레넥톤이 망했어도 한타에서도 원딜한테 진입한 암베사를 레넥톤이 확정 스턴과 보호막 제거로 마킹할 수 있기 때문에 암베사의 포텐셜과 별개로 게임 내내 휘둘린다. 그만큼 극상성이다 보니 대회에서도 암베사를 할 때는 레넥톤을 밴하는 경우가 많다."}, {"name": "볼리베어", "reason": "하드 CC기를 보유하고 있으며 라인전부터 맞딜로 찍어눌리는 극상성이다. 초반이 약한 암베사로는 볼베에게 큰 피해를 주기도, 딜을 감당하기도 어려우며 암베사의 패시브는 스킬마다 딜레이가 있고 한번에 크게 이동하는 스킬이 아니기에 거리 조절을 실수한다면 바로 잡혀서 타겟팅 하드 CC기와 스킬 연계에 머리가 터져버린다. 사리면서 파밍하자니 쿨타임이 긴 Q2를 제외하고 사거리가 긴 스킬이 없어 그것도 불가능하다. 잘 버텨서 후반을 가도 잘 성장한 볼리베어는 암베사에게 사이드를 밀리지 않으며 15시즌 채용률이 높은 사이드 템트리라면 오히려 사이드에서도 압도당한다. 그나마 사이드 템트리의 볼리베어의 경우 한타에선 꽤 힘이 빠지는 편이라서 사이드보다는 팀파이트 위주로 게임을 풀어나가는 것이 좋다."}], "general_counters": ["마오카이", "워윅", "이렐리아", "올라프", "일라오이", "오공", "잭스", "세트", "판테온", "트런들", "쉔", "초가스", "칼리스타"]}
{"champion": "애니", "aliases": [], "hard_counters": [{"name": "애니보다 팔이 긴 챔피언", "reason": "애니의 평타 사거리가 길긴 하나 이들의 스킬 사거리는 애니를 압도하므로 견제 구도가 길어질수록 애니만 불리해진다. 그나마 팀원의 도움을 받아 이들을 무는 데만 성공한다면 애니가 빠르게 녹일 수 있는 유리몸이라는 점이 위안이나 반대로 애니 혼자서는 점멸 없이 이들을 따낼 수단이 전무하다는 뜻이기도 하다."}], "general_counters": ["니코", "럭스", "벨코즈", "빅토르", "신드라", "애니비아", "오리아나", "제라스", "흐웨이", "직스", "갈리오", "나피리", "다이애나", "스웨인", "카사딘", "키아나", "아우렐리온솔", "카시오페아"]}
{"champion": "애니비아", "aliases": [], "hard_counters": [{"name": "제라스", "reason": "밴 대상 1순위. 충격 구체(E)를 제외한 모든 스킬이 냉기 폭발보다 사거리가 길어 제라스가 일반 장화 하나 사서 냉기 폭발을 피할 이동속도를 가진다면 애니비아는 그냥 두들겨 맞으며 미니언을 받아먹는 것 말고는 아무것도 할 수 없는 상태가 된다. 가장 힘든 건 제라스도 라인 클리어 능력이 뛰어나 애니비아의 라클 후 로밍을 다니는 플레이가 원천 차단되어 스노우볼을 굴리기 힘든데다 어찌 로밍을 가도 제라스는 굳이 가지 않고 사거리에서 궁극기로 폭격을 해버릴 수 있기에 가도 이득을 굴리기 매우 힘들다. 즉, 그야말로 애니비아를 치킨으로 구워버린다."}, {"name": "이즈리얼", "reason": "이즈리얼은 사거리가 애니비아보다 길고 유일한 이동기인 비전 이동(E)은 순간이동 판정을 보유하고 있기 때문에 냉기 폭발을 맞히기가 쉽지 않다. 물론 애니비아의 패시브 때문에 이즈리얼이 킬 각 잡기 힘든 건 사실이지만 벽을 세우는 결정화는 비전 이동으로 손쉽게 빠져나갈 수 있어서 서로가 킬 각이 잘 안 잡힌다. 거기에 이즈리얼이 작정하고 쿨감 위주 아이템과 헤르메스의 시미터 등의 생존 템 위주로 챙겼다면 비전 이동의 쿨이 극단적으로 줄어드는데 애니비아 단독으로는 이즈리얼을 저지할 수 없고 최악의 상황이면 게임 내내 도저히 답이 없어지게 된다. 사실상 대치 구도에서 애니비아를 이즈리얼이 쉽게 능가할 수 있고 로밍도 진입과 후퇴 능력이 좋은 이즈리얼이 한 수 위이며, 이즈리얼의 대치와 로밍으로 전 라인이 터져나갈 위험성이 크다. 이즈리얼 쪽이 라인전에서 사고만 안 터지면 중반 존재감에선 이즈리얼이 훨씬 유리한 상성이다."}], "general_counters": ["벨코즈", "조이", "직스", "흐웨이", "카사딘"]}
{"champion": "애쉬", "aliases": [], "hard_counters": [{"name": "트리스타나", "reason": "픽률이 낮아서 그렇지, 애쉬 입장에서는 언제나 전통의 하드 카운터. 트리스타나가 유독 힘든 이유는 2~3렙부터 들어오는 긴 사거리의 돌진기 로켓점프, 그를 동반한 둔화와 강력한 폭딜을 이속 버프 하나 없는 뚜벅이 애쉬 입장에서 점멸을 쓰는 걸 제외하고 감당이 불가능하기 때문이다. 이런 트리스타나와 비슷한 극초반 폭딜이 나온다고 평가받는 원딜 챔프는 드레이븐, 칼리스타, 루시안 뿐인데 이 중 드레이븐과 칼리스타는 폭딜을 내는데 있어서 이동속도 의존도가 높기 때문에 애쉬의 긴 사거리의 W와 600 사거리 평타 둔화로 떨쳐내거나 되려 애쉬 본인이 카이팅을 통해 역으로 팰 수 있는 여지도 있고, 루시안은 돌진기 거리가 짧기 때문에 W로 사전부터 거리를 좁히면서 싸움을 피할 수라도 있다. 반면 트리스타나는 로켓점프가 루시안의 앞대쉬보다 훨씬 길고 빠르기 때문에 애쉬의 평타와 W로도 차단할 방법이 없다. 한마디로 애쉬가 사거리와 둔화를 비롯한 CC를 통해 다른 원딜에게 갖는 우위들을 트리스타나만 초반부터 몽땅 파훼할 수 있는 것이다. 마법의 수정화살을 배우는 6렙 이후에도 트리스타나가 정화를 들면 여전히 점멸이 없으면 킬 자판기 신세를 못 벗어나는데 하필 트리스타나 자체가 정화 효율이 높아서 애쉬 상대로 정화를 들 확률은 더욱 높다. 게다가 후반 캐리력까지 트리스타나가 훨씬 좋다."}], "general_counters": ["바루스", "진", "블리츠크랭크", "파이크", "노틸러스", "렐", "알리스타", "아무무", "바드", "올라프(탑", "정글)", "람머스(정글)", "말파이트(탑)", "사일러스(미드)"]}
{"champion": "야스오", "aliases": ["스오"], "hard_counters": [{"name": "일라오이", "reason": "초반 라인전 주도권은 야스오한테 있고, 영혼 그랩을 막을 수 있지만 유리한 건 그게 끝이다. 야스오의 방어 능력치로는 일라의 딜을 감당하기 어려우며, 장막보다 영혼 일라 E 쿨이 훨씬 빠르다. 6렙 후에는 E를 끌리면 어지간히 실력 차가 나지 않는 한 이기지 못하며, 후반까지 가도 미니언 없이 싸우면 매우 불리하다. 한타로도 조합이 좋지 않은 한 일라한테 우위를 점할 수 없다. 그나마 위안거리는 일라는 초반 약캐인지라 말리기는 쉽다는 점이지만 그마저도 일라오이가 초반에 사리며 CS를 챙기면 굉장히 곤란해진다."}, {"name": "레넥톤", "reason": "하드 카운터 1. 야스오는 패시브의 쉴드와 투사체를 지우는 바람 장막, 질풍검의 뛰어난 기동성을 대가로 원딜 이하의 방어 능력치를 가졌다. 그리고 레넥톤은 저 모든 강점을 전부 없는 강점으로 만들어버리면서 야스오의 낮은 능력치를 완벽히 후벼파는 답이 없는 상성이다. 레넥톤의 강화 W엔 보호막 파괴가 붙어있기 때문에 패시브와 철갑궁 쉴드는 방어에 전혀 도움이 되지 못한다. 6렙 이후부터는 포탑 안에서 작정하고 사려도 정글러의 도움 없이 혼자서 풀피 다이브가 가능하다. 기적같이 딜교환을 잘해놔도 기본 능력치부터 비교가 안 되고 야스오에겐 없는 초반 유지력까지 갖췄다. 그나마 레넥톤은 한타가 안 좋은 유통기한 챔피언이라지만 후반까지도 레넥톤의 폭딜과 확정 기절은 야스오에겐 치명적이다. 만약 주변에 미니언이 없다면 풀템전 일대일 구도에서도 지고, 미니언이 있다 하더라도 질 가능성이 높다. Q 한 번 돌리면 미니언이 싹 지워지는 건 덤. 게다가 앞서 언급한 카운터 브루저들 중에서도 미드에 출현할 가능성도 높은 상대. 그나마 3레벨을 찍기 전엔 야스오가 유리한 편이고 이때 최대한 이득을 봐 놓아야 한다. 레넥톤은 지속 전투를 하기보단 스킬 콤보를 통해 히트 앤드 런을 하므로 탈진을 들어 콤보 1턴을 버텨내면 딜교 이득을 크게 볼 수도 있다. 이점을 최대한 활용해보자"}, {"name": "판테온", "reason": "하드 카운터 2. 레넥톤과 비슷하게 길게 누르는 혜성의 창(Q)을 제외하면 투사체가 없는데다가 이쪽은 진입해 CC기를 거는 것에 스킬 2개를 쓰는 레넥톤과 달리 방호의 도약(W) 하나로 둘 다 가능하고 방패 돌격(E)의 존재로 후속 딜교환 또한 차단당하기에 매우 껄끄럽다. 6레벨 이후에 궁극기로 로밍을 다니는 것도 야스오가 따라가기엔 무리가 있다. 몰락한 왕의 검을 두르면 야스오의 대인전도 강해지지만, 판테온이 작정하고 판금장화를 구비하고 똑같이 몰락한 왕의 검을 들고 오면 사이드 1대1도 뚫릴 걱정을 해야 한다. 심지어 인식과는 다르게 시간이 지나면서 유통기한이 오는 쪽은 판테온이 아니라 야스오이기 때문에, 야스오는 초반이 자신보다 훨씬 더 강한 판테온을 상대로 초반 이득을 봐야 한다는 모순적인 상황에 처한다."}, {"name": "람머스", "reason": "아무리 질풍검(E)이 있다고 해도 람머스의 추격으로부터 야스오가 살아남기는 힘들다. 람머스의 갱킹 진입을 뿌리칠 스킬도 없기 때문에 일단 구르기에 맞고 도발에 걸리면 데스는 반 확정이다. 기본적으로 람머스는 AD 챔피언들의 하드 카운터인 데다가, W와 가시 갑옷 때문에 때려도 본인이 더 아프다. 심지어 투사체 공격이 단 하나도 없어서 바람 장막(W)도 가볍게 무시한다."}, {"name": "르블랑", "reason": "하드 카운터 3. 스킬 연계의 핵심인 악의의 인장(Q)과 환영 사슬(E)이 바람 장막(W)에 막히는데도 압도적으로 털리는 특이한 케이스인데, 왜곡이 야스오의 모든 딜교 메커니즘을 카운터친다. 치고 빠지는 게 자유롭고 장막 안쪽에서 폭딜을 욱여넣을 수 있는 스킬 특성상 근접 지속딜러인 야스오가 맥을 전혀 못 추리게 만든다. 야스오의 패시브 보호막은 찰 때마다 그냥 평타로 주기적으로 삭제해 버리면 그만. 때문에 르블랑-야스오 라인전 구도는 원거리 대 야스오가 맞나 싶을 정도로 처참한 대결이 되며, 실제로 라인 킬 확률 60:40에 가까운 통계를 보인다. 최상위 야스오 플레이어 프제짱조차도 고정 밴할 정도다."}, {"name": "자야", "reason": "바텀 야스오 기준으로 OP.GG 통계 기준으로 라인 킬 확률과 승률이 밀리는(각각 43:57, 48:52) 의외의 상성. 물몸 뚜벅이 원거리 딜러에게 천적 수준으로 강한 야스오지만 자야만큼은 예외다. 자야는 상대가 들어오는 것을 받아치는 데 특화된 챔피언이기 때문. 물론 Q와 평타, 궁극기가 바람 장막에 의해 막히긴 하나, 궁극기는 생존용이기에 막아봤자 큰 의미가 없고, 야스오의 특성상 결국 딜교를 하려면 장막 타이밍을 제외하면 자야의 속박에 노출되게 된다. 이렇게 되면 결국엔 장막이 빠진 상태에서 근접 공격 수단과 돌진기밖에 없는 야스오를 자야가 카이팅하게 되면 심하면 킬로 이어지고 아니더라도 스펠이 빠지게 되는 손해가 나게 된다. 6렙 이후 라인전과 한타에서도 결정적인 상황에서 궁을 통해 야스오의 궁 각을 차단할 수 있는 건 덤. 또한 라인전에서 경우에 따라 야스오를 확실히 압도할 수 있다고 평가받는 원딜로는 루시안, 칼리스타가 있는데 이들은 후반으로 가면 힘이 빠지는 데 비해 자야는 후반 캐리력도 뛰어나다. 물론 어느 정도의 손싸움이 있긴 하나, 원거리 딜러 중 가장 까다로운 상대."}], "general_counters": ["가렌", "다리우스", "세트", "트런들", "신 짜오", "올라프", "볼리베어", "모데카이저", "우디르", "오공", "트린다미어", "암베사", "신지드", "클레드", "카밀", "리븐", "그라가스", "워윅", "뽀삐", "말파이트", "잭스", "나서스", "오리아나", "벡스", "말자하", "탈리야", "아칼리", "블라디미르"]}
{"champion": "에코", "aliases": [], "hard_counters": [{"name": "사일러스", "reason": "미드든 정글이든 공통적으로 만날 수 있는 최악의 하드 카운터다. 압도적인 체급 차이와 높은 AP 계수의 타겟팅 돌진 겸 회복기 국왕시해자 때문에 초반부터도 교전 성립이 힘든데, 사일러스가 시공간 붕괴를 강탈한 상황이라면 타인의 개입이 없다는 가정하에 사일러스는 완벽한 에코의 상위 호환으로 변모한다. 궁극기를 생존 및 도주기로 쓰는 상황이 대부분인 에코와는 달리 사일러스는 CC기와 국왕시해자로 적에게 더 오래 붙을 수 있기 때문에 활용도가 더 높아, 서로 포지션이 달라도 마주치는 것조차 안 그래도 뛰어난 사일러스의 교전 능력을 빛낼 생존기 겸 광역 딜 스킬 하나를 조공하게 된다. '타겟팅 돌진 겸 회복'을 통한 전투 능력이 사일러스의 강점이자 약점이지만, 치유 효과 감소 아이템을 구비하고 사일러스의 이동기가 빠진 타이밍에 평행 시간 교차로 기절시키고 시작하는 입롤이 아닌 이상 맞딜을 지기 때문에 치유 효과 감소 아이템도 상대법은 아니다. 따라서 라인에서 만났다면 맞딜보다 라인 클리어 위주로 운용하다가 정말 좋은 각에만 싸워야 하고, 정글에서 만났다면 억압을 최대한 피해 국왕시해자를 두 번 돌리지 않는 선에서 내빼야 한다."}, {"name": "아크샨", "reason": "견제력과 카이팅이 탁월하여 라인전이 매우 강력해 시간의 톱니바퀴가 원거리 미니언을 한 번에 정리해 주기 전까지 어찌할 방도가 없다. 라인 클리어 능력이 에코보다 뛰어나므로 라인전에 한해서는 아크샨이 실수하지 않으면 에코 혼자서 이기는 게 불가능한 수준이다. 라인전 이후로도 단순 교전에서는 에코의 변수 창출력이 우위일지언정 아크샨의 아군 부활은 유일한 것을 넘어 선을 넘은 유틸리티다. 마법사의 최후와 궁합도 좋아서 1~2 코어로 마법사의 최후를 가 버리면 암살은커녕 맞딜조차 불가능해진다."}], "general_counters": ["르블랑", "벡스", "아리", "애니비아", "카사딘", "판테온", "갈리오", "아칼리", "야스오", "이렐리아", "말자하", "가렌", "모데카이저", "그레이브즈", "리 신", "샤코", "신 짜오", "벨베스", "마스터 이"]}
{"champion": "엘리스", "aliases": [], "hard_counters": [{"name": "피들스틱", "reason": "얼핏 보면 초식 정글이라 쉬운 상대일 수 있으나 실상은 통계에서 하드 카운터급으로 승률이 밀리는 구도이다. 원콤에 피들스틱을 죽이지 못한다면 공포와 흡수에 의해 역관광 당하기 쉬우며, 초반에는 엘리스가 우위인 구도임은 확실하나 조금이라도 운영에 차질이 생기는 순간 뛰어난 한타 기여도와 빠른 정글링 속도를 가진 피들스틱에게 순식간에 뒤처지게 된다. 직접적인 대결 구도가 아닌 전체적인 게임 운영에서 매우 까다로운 상대."}], "general_counters": ["녹턴", "오공", "올라프"]}
{"champion": "오공", "aliases": [], "hard_counters": [{"name": "워윅", "reason": "최악의 카운터. 라인전 1대1 승리는 꿈도 못 꾼다. 착취와 파쇄격으로 갉아먹으려 시도해도 지속적인 흡혈로 인해 전혀 견제가 의미가 없고 강력한 공격 능력치 덕분에 맞딜이 전혀 밀리지 않는다. 궁극기를 사용해 폭딜로 한방에 처치하려 시도해도 E의 피해 감소 덕분에 순간 탱킹 및 오공의 돌진에 대처할 수 있다. 워윅의 모든 공격 스킬들은 마법 피해이기 때문에 패시브의 방어력 증가도 무용지물이 된다. W의 기동력으로 타 라인 개입 및 합류가 빠르며 분신을 이용한 전법도 간파당하기 쉽다. 워윅은 또한 한 대상을 집중 마크하기 좋은 챔프다 보니 오공의 진입을 받아치기도 좋다. 하드 CC기도 2개나 되기 때문에 CC기 연계로 오공이 궁극기로 진형을 망가뜨리기 전에 오공이 먼저 제압당할 수도 있다. 다만 선공권 자체가 압도적인 편은 아니며 한타에서는 오공이 한 수 위므로 라인전만 어떻게든 넘긴다면 오공이 유리해진다."}, {"name": "스웨인", "reason": "극초반이 강하지도 않고 성장형 챔피언이지만 매우 힘든 상대. 오공이 만나는 스웨인은 탑에서 맞라인전을 서거나 상대 미드에서 보는 경우일 텐데, 우선 당연하지만 스웨인은 AP 메이지라 오공의 패시브가 쓸모가 없다. 게다가 스웨인의 패시브 덕분에 다른 메이지들보다 유지력이 꽤나 나쁘지 않은 편인 데다가, 스웨인의 그랩에 끌리면 W를 확정으로 맞아 절대 시야로 분신이 드러나며, 혹여나 분신이 맞았더라도 분신은 챔피언 판정이기 때문에 스웨인에게 그대로 스택을 헌납한다. 가장 큰 문제는 스웨인의 궁극기인데, 스웨인의 궁은 가한 피해만큼 흡혈을 하는 게 아니라 그냥 챔피언이 맞는다면 AP 계수로 회복을 하는 것이기 때문에 분신을 사용하면 스웨인의 피흡을 늘려주는 꼴이다. 당연하지만 스웨인의 궁극기 또한 계속 피해를 입히기 때문에 모습이 계속해서 드러나며, 한타 기여도도 오공 못지않게 강하기 때문에 여러모로 힘든 상대다."}, {"name": "쉬바나", "reason": "숨겨진 하드 카운터. 쉬바나의 기본 능력치가 워낙 좋은지라 오공이 맞라인전에서 크게 재미를 보기가 힘들며, 쉬바나의 약점인 부실한 CC기야 오공도 궁극기에만 CC기가 있는지라 크게 비교되는 약점은 아니며 쉬바나가 작정하고 AP를 가게 되면 오공의 부실한 마법 저항력으로 인해 오공이 브레스 한방에 터질 수도 있다. 이쪽도 그나마 마법 저항력을 구비해두면 중후반부터는 오공이 다시 제압할 기량이 있긴 하다."}], "general_counters": ["마오카이", "말파이트", "모데카이저", "쉔", "오른", "일라오이", "자크", "우디르(날개 돋친 폭풍)", "초가스", "사이온", "나서스", "탐 켄치", "뽀삐", "올라프", "레넥톤", "클레드", "판테온", "럼블", "신지드", "하이머딩거", "그라가스", "티모", "헤카림", "녹턴", "샤코", "피들스틱", "스카너", "다이애나"]}
{"champion": "오로라", "aliases": [], "hard_counters": [{"name": "카사딘", "reason": "굉장히 까다로운 상대다. 카사딘은 패시브에 자체적으로 10%의 마법 피해 감소 효과가 있기 때문에 초반부터 후반까지 AP 누커들을 상대로 딜을 버텨내는 능력이 탁월해서 잡아내기 쉽지 않다. 중반이 넘어서면서 아이템이 뜨기 시작하면 카사딘이 오로라를 압도하고, 영역전개 따위는 균열 이동으로 코 후비며 뛰어넘기 때문에 승부를 걸어 볼 만한 구간은 초반 라인전뿐인데 앞서 말했듯이 카사딘의 패시브로 인해 견제를 해도 딜이 시원찮으며 카사딘이 도란의 방패를 들고 와 작정하고 사린다면 말려놓기도 굉장히 어려워진다. 카사딘은 초반 교전 능력이 형편없기 때문에 교전을 많이 내서 이득을 취하는 것이 중요하다."}, {"name": "카시오페아", "reason": "같은 인파이팅형 메이지 분류지만 오로라보다 훨씬 DPS가 높으며 치고 빠지는 플레이는 카시오페아의 독기의 늪에 막힌다. 그나마 심리전으로 독기의 늪을 피하더라도 카시오페아가 Q를 맞추면 치고 빠지는 타이밍에 QEE 정도만 맞춰도 오로라 QEQ 대비 딜교가 크게 밀리지 않는 편. 즉 맞대결은 상대가 안 되고 치고 빠지는 플레이의 심리전도 상당히 불리한 상성."}, {"name": "이렐리아(탑)", "reason": "탑 한정으로 까다로운 상성. 이렐리아의 콤보 시작인 쌍검 협무를 회피하기 쉬워서 라인전은 우위지만 탑에서는 이렐리아가 유지력과 부시 암시야 등으로 버티다가 Q 스킬로 미니언을 타고 오로라에게 접근하는데 성공하면 오로라가 딜교에 크게 불리하고 라인을 밀어야 하는 구도상 갱 압박에 취약한데 이렐리아 상대로 다이브 압박도 어렵다. 사이드 구간에 들어서면 이렐리아에게 이기기 굉장히 어려우니 한타 쪽으로 풀어 나가자."}, {"name": "제라스", "reason": "기본 스킬의 사거리부터 궁 사거리, 라인 클리어, 딜량까지 모든 면에서 오로라를 압도하는 극상성. 잘 맞추는 제라스의 경우 라인전 내내 일방적으로 두들겨 맞으면서 강제로 CS 단식을 할 수 있다. 이 때문에 안 그래도 불리한데 성장 차이까지 나 버리게 되면 오로라 입장에선 별 수가 없다. 로밍으로 게임을 풀어보려 해도 제라스의 궁극기 사거리 때문에 로밍을 가서 풀어보기도 쉽지가 않다."}], "general_counters": ["벨코즈", "애니비아", "신드라", "흐웨이", "니코", "럭스", "조이", "아리", "아지르", "라이즈", "리산드라", "말자하", "벡스", "아크샨", "카타리나", "제드", "아칼리", "에코", "키아나", "이렐리아", "렝가", "탐 켄치", "녹턴", "갱플랭크", "판테온", "카밀", "신지드", "클레드", "오른"]}
{"champion": "오른", "aliases": [], "hard_counters": [{"name": "피오라", "reason": "다양한 CC기로 무장한 오른에게 응수(W)의 존재는 매우 치명적이며, 약점을 공격하면 적용되는 고정 피해는 말할 것도 없다. 심지어 오른이 견제용으로 날린 용암 기둥의 넉백을 이용해 응수를 능동적으로 발동시키는 수준의 피오라라면 정말 답이 없다. 이렇기에 후반으로 갈수록 오른이 피오라를 단독으로 막는 것은 사실상 불가능하다. 그러나 피오라가 초중반부터 탱커를 뚫어낼 수 있는 챔피언은 아니고, 한타 기여도가 너무 떨어져서 오로지 스플릿을 통한 외줄타기에 의존하는 챔피언이므로 피오라가 취약한 중반 한타 타이밍에 게임을 끝내는 것이 관건이 된다. 또한 Q 딸깍으로 체력을 뭉탱이로 날려버리는 신파자가 삭제되어 예전처럼 아예 답이 없는 수준의 카운터는 아니게 되었다. 다만 카밀과 다르게 원래부터 급소라는 패시브로 충돌 판정이 큰 오른에게 체력 비례 고정 피해를 잘 때려 박던 챔프였기에 여전히 상대하기 많이 좋아진 건 아니다."}, {"name": "모데카이저", "reason": "전사 중 최상위권의 성장성과 패시브의 최대 체력 비례 장판으로 오른의 탱킹력을 뚫어내는 것이 가능하며, 죽음의 세계(R)로 오른의 한타 기여도를 제한하고 심지어는 오른의 능력치조차 강탈하는 카운터로 분류된다. 라인전 구도에서도 오른의 장점인 일방적인 딜교환이 불가능하며, 노 코스트 챔피언인데 회복기까지 있기 때문에 유지력조차 모데카이저가 우위에 서 있다. 모데카이저가 다소 취약하다고 평가받는 초반 라인전도 정직한 맞딜로 오른이 이기는 것은 불가능에 가깝다. 불꽃 풀무질(W)로 시전 모션이 큰 모데카이저의 궁극기를 무시하는 것이 어렵지는 않지만 숙련된 모데카이저는 오른의 저지불가를 의식해 궁극기를 단독으로 사용하지 않고 죽음의 손아귀로 오른의 불꽃 풀무질을 뺀 후 궁극기로 싸움을 걸어오기 때문에 핵심 딜링기인 불꽃 풀무질이 빠진 오른은 진실의 방에서 맞아죽을 가능성이 매우 높다. 케이닉 루컨이 나오기 전까지는 섣불리 불꽃 풀무질을 사용해서는 안 된다. 다만 모데카이저가 마관이 있다 한들 이는 중후반에서나 빛을 보는 옵션이고 죽음의 손아귀 스킬 레벨이 다 찍히기 전에는 오른이 무식하게 저항력만 올려도 모데카이저가 잘 뚫어내지 못하는 데다가 모데카이저가 다이브를 잘하는 챔프는 아니기 때문에 포탑에서 사리며 파밍하는 구도로 끌고 간다면 무난히 갈 수 있다."}, {"name": "그웬", "reason": "어쩌면 피오라나 모데보다 더 악랄한 극악의 카운터, 일단 모든 공격에 퍼뎀이 들어가는 것도 모자라 불꽃 풀무질을 쓰면 제자리에서 못 움직이기 때문에 그웬의 Q를 정타로 맞고 고정 딜에 체력이 갈려나가며, 무엇보다 오른의 장점인 갱 호응 및 콤보도 신성한 안개와 돌격 가위로 가볍게 피해 버린다. 그렇다고 후반까지 버티자니 그웬도 모데카이저 못지않게 성장성이 좋은 건 물론이고 타워를 끼고 버티려 해도 그웬의 막강한 고정 피해와 유지력에 오른이 너덜너덜해진다."}, {"name": "카밀", "reason": "오른이 까다로워하는 요소들을 골고루 갖춘 카운터 중 하나이며, 카밀은 E, R을 통한 갱 호응 및 회피 능력이 좋아서 초반에 강하게 압박하기도 어렵다. 무난히 성장한 카밀은 Q 2타의 온힛 고정 피해로 오른의 체력을 순식간에 깎아내리며 착취와 W의 퍼뎀, 뛰어난 기동성으로 스플릿 구도에서도 우위에 서는 만큼 어느 하나 까다롭지 않은 부분이 없다. 오른이 세운 기둥에 와이어를 사용할 수 있고 궁극기로 오른의 궁을 씹을 수 있는 건 덤. 카밀의 E를 이용한 와이어 돌진이 에어본과 불안정 상태 평타에 끊기기 때문에 그 점을 파고들어야 갱 호응이든 도주든 활로가 있다. 역시 피오라와 마찬가지로 무자비한 고정 피해를 꽂아넣는 신파자가 삭제되어 예전처럼 아예 답이 없는 상황은 벗어났다."}], "general_counters": ["뽀삐", "신지드", "카시오페아", "모르가나", "쉔", "가렌", "세트", "베인", "트런들", "케인(다르킨 학살자)", "일라오이", "럼블", "다리우스", "워윅", "잭스", "이렐리아", "볼리베어", "블라디미르", "요네", "케일", "문도 박사", "암베사"]}
{"champion": "오리아나", "aliases": ["오리"], "hard_counters": [{"name": "신드라", "reason": "대회에서 자주 보인 대표적인 카운터. 오리아나의 Q가 신드라의 Q보다 사거리가 조금 길긴 하지만, 신드라의 Q가 시전 속도가 더 빠르며, 신드라의 QE 사거리가 월등히 길어서 계속 얻어맞게 된다. 신드라의 초반 라인전 능력이 리워크 이후 약해졌기에 신드라의 QE보다 오리아나의 QW 쿨타임이 짧은 것을 이용하여 초반 주도권을 가질 수는 있지만, 신드라가 분노의 조각을 40개 획득하여 어둠 구체를 2개 저장할 수 있게 되는 순간부터 신드라에게 주도권이 온다. 한타 구도에서도 두 챔피언 모두 구체로 지역 장악 능력에 일가견이 있으나, 오리아나의 Q보다 신드라의 QE 사거리가 길어서 오리아나는 E로 수동적으로 이니시에이터에게 구체를 달아서 궁극기로 이니시를 해야 하는 반면 신드라는 QE로 더 먼 사거리에서 이니시에이팅이 가능하기에 상당히 불편하다."}, {"name": "아우렐리온 솔", "reason": "무상성으로 유명한 오리아나지만, 천상계에서는 아우솔의 밸류로 카운터친다. 리워크 이후에는 초반에 완전히 누르지 않으면 중반부터는 역으로 밀린다. 사거리가 비슷하기에 오리아나가 작정하고 파밍만 하는 아우솔의 성장을 크게 말리기는 힘들다. 6레벨이 될 경우 궁극기의 사거리로 갱 호응이 가능하고 레벨이 쌓이면 라클이 좋아져 견제를 넣을 시간이 없으며, 별가루 파밍이 어느 정도 될 경우 궁극기를 안 쓰고 아우솔을 이기는 것은 당연히 불가능하며, 따라서 아우솔은 자신이 질 싸움을 W로 피할 수 있다. 반대로 오리아나가 도망가면 날아오면서 공격할 수 있다. 한타에서는 아우솔의 궁 사거리가 오리아나보다 훨씬 길고, 뚜벅이인 오리아나는 천상 강림이 떨어지면 점멸을 쓰지 않으면 맞는다. 즉, 한타에서도 아우솔에게 선공권이 있다. 이를 막으려면 아우솔을 따라가서 죽일 챔피언과 함께 기동전을 해야 하는데, 오리아나는 이런 구도에서 매우 약해 정석적인 한타 구도를 만들어야 하는 챔피언이며, 아우솔은 W로 인해 기동전 구도가 나와도 빠르게 추격 또는 합류할 수 있어 정석적 한타 구도에 비해 불리하다뿐이지 아우솔보다 기동전이 더 부실한 뚜벅이 메이지가 기동전을 시도하는 것은 자신의 영향력을 버리고 아우솔의 영향력을 좀 낮추는 물귀신 작전일 뿐이다."}], "general_counters": ["피즈", "에코", "카타리나", "카사딘", "다이애나", "이렐리아", "제드", "벨코즈", "브랜드", "아우렐리온 솔", "제라스", "조이", "신드라"]}
{"champion": "올라프", "aliases": [], "hard_counters": [{"name": "아칼리", "reason": "진입과 도주가 모두 자유자재인 엄청난 기동력, 기본 공격을 통한 딜과 피흡을 원천 봉쇄하는 황혼의 장막(W) 때문에 시작부터 골치 아픈데 궁극기를 배우면 기동력과 킬 캐치력이 급상승해서 더 답이 없다. Q 선마로 도끼만 던지는 플레이를 하자니 양쪽 다 도방 재바를 들고 와서 어지간한 견제는 무시할 수 있고, 미니언을 평타로 먹으려면 아칼리 Q 사거리 안에 들어갈 수밖에 없는데, 마나 챔 대 기력 챔 구도상 필연적으로 올라프의 마나가 먼저 떨어진다. 그렇게 초반을 어영부영 넘어가고 궁이 생긴 이후로는 올라프의 강력한 대인전을 반도 발휘하지 못하고 아칼리의 연막과 표창곡예에 실컷 농락당하다 궁극기로 머리통이 따인다. 아칼리의 후반전 기여도가 그렇게 좋은 것은 아니지만 당연히 올라프보단 낫고, 암살자들 중에서는 상위권이기 때문에 시간만 끌자는 플레이도 여의치 않다. 픽률도 낮지 않은 챔피언이니 그냥 밴을 하는 게 좋다. 탑 올라프 장인 우주최강올라프는 하이머딩거의 경우처럼 유성 룬을 채택한 뒤 끊임없는 Q 견제로 아칼리를 라인에서 먼저 몰아낸 뒤 체력 관리에 집중하며 파밍과 채굴을 하는 식으로 성장 격차를 벌려나가는 것이 좋다고 조언하고 있다. 그러나 유성을 채택하면 정복자에 비해 맞딜이 매우 약해진다는 것은 감안해야 한다. 해당 장인의 조언은 어디까지나 라인전에서 아칼리를 상대로 우위를 잡아야 할 때 유효하며, 아군 조합이 아칼리에게 강하거나, 정글이 리 신이나 피들스틱처럼 아칼리를 잘 잡는 챔피언일 경우 굳이 라인전을 이겨야 할 필요가 없으니 정석 룬대로 들고 마방을 먼저 올려서 우직하게 버티는 것도 방법이다."}, {"name": "피오라", "reason": "맞딜 자체는 이기지만 피오라가 싸움을 회피할 수단이 많고, 짧은 딜교를 하면 응수의 슬로우와 공속 감소가 너무 치명적이다. 6렙부터는 할만하지만 이마저도 피오라가 템을 어느 정도 띄우면 Q를 우르프 모드마냥 쉴 새 없이 써서 도주도 잘하고, 치고 빠지기에 당하다 힐 장판이라도 켜지면 맞딜도 이긴다는 보장이 없어진다."}, {"name": "트린다미어", "reason": "회전 베기(E)라는 수준급 이동기를 보유하고 있고 노 코스트에 유지력마저 올라프에게 밀리지 않는다. 6레벨 이후에는 5초 동안 불사 상태가 되는 궁극기 때문에 일기토가 성립하지 않는데 트린의 기동성에서 도망칠 수도 없다. 성장성은 당연히 트린다미어가 우위이기 때문에 골치 아픈 상대. 이론 상으로는 란두인 + 판금 장화 정도로 방템을 떡칠해 5초 프리딜을 버텨낼 수 있는 방어력을 챙기고, 궁이 끝난 트린을 다시 추격할 수 있는 기동력을 갖추면 이길 수는 있다. 그러나 1코어로 순수 방템을 올려야 한다는 점에서부터, 라인전은 몰라도 팀 단위에선 올라프의 파워가 많이 약해지므로 손해다. 그래도 일단 라인전만 본다면, E 스킬을 먼저 마스터하고 파수꾼-란두인, 선닌탑 빌드를 올리면 라인전은 꽤 할만해진다. 심지어 2코어도 연이어 얼심 등의 방템을 올린다면 맞다이를 이길 가능성도 생기지만, 이렇게 되면 트린 하나만 마킹할 수 있고, 이후 중후반 페이즈에서 노딜 고기방패가 되기 때문에 매우 곤란해진다."}, {"name": "하이머딩거", "reason": "여타 다른 근접 챔피언들처럼 라인전 내내 포탑과 W의 포화를 맞아야 하며 도끼를 맞혀 들어가려고 해도 수류탄의 기절 때문에 뚜벅이인 올라프는 더욱 접근하기 힘들다. 다른 원거리 견제형 챔피언들은 카이팅을 주력으로 이득을 보기 때문에 도끼의 슬로우와 라그나로크를 갖춘 올라프에게 역으로 상성을 물리지만, 딩거는 위험하다 싶으면 그 자리에서 궁극기를 포함한 4포탑을 깔고 딜로 찍어누르려고 하기 때문에 6렙을 찍어도 상성이 뒤바뀌지 않는 드문 견제형 챔피언이다. 그나마 하이머딩거는 유지력이 물약 외에는 전무하며 패시브로 이속이 20% 빨라져봐야 뚜벅이라 도끼를 맞히기는 생각보다 쉽다. 어차피 맞딜할 일은 없고, 딩거는 피 압박보단 라인 압박에 특화되어 있어 피관리가 어렵지 않으니 그냥 4:6 정도의 평화협정을 맺고 얌전히 W 켜고 미니언 파밍에 열중하면서 유지력으로 격차를 벌리는 것에 집중하자. 멜모셔스의 아귀가 나온 순간부터는 하이머딩거의 AP 딜이 모조리 보호막에 흡수당하고 그 상태의 10% 모든 피해 흡혈로 인해 피해를 막으며 잡을 수 있기 때문에 선 멜모셔스도 좋은 선택이다."}, {"name": "난입", "reason": "올라프의 실질적인 하드 카운터 룬. 올라프는 역류의 쿨 초기화로 상대방을 도망치지 못하게 하면서 강제로 근접전을 강요하고 우월한 전투 지속력으로 상대를 죽이는 게 주요 전법인데 이 모든 건 난입이 한번 터지면 모두 무효화된다. 올라프의 CC기는 역류의 둔화 하나인데 난입이 터진 순간 난입의 이속 증가와 둔화 효과 감소에 의하여 올라프가 접근할 방법이 없어진다. 유통기한이 심해서 초중반에 반드시 성과를 내서 스노우볼을 굴려야 하는 올라프 입장에서는 죽을 맛. 올라프의 밥인 티모마저도 난입 룬을 드는 순간 까다로운 상대로 돌변한다. 물론 역류 하나 때문에 난입을 채택하기에는 딜로스가 너무 심하게 발생하는 관계로 잘 채택하지는 않는다는 게 위안 거리다. 만약 난입을 들었다면 곧 맞싸움을 회피하는 성장형 챔피언임이 대부분이므로, 유성 등을 이용해 Q 포킹 맞견제를 해 라인에서 쫓아내는 플레이를 하는 것이 추천된다."}, {"name": "존야의 모래시계", "reason": "올라프의 실질적인 하드 카운터 아이템. 궁극기와 W의 버프에 크게 의존하는 올라프는 상대가 경직으로 딜 타이밍을 흘려버릴 경우 급격하게 힘이 빠진다. 1대1이든 한타 도중이든 킬각 잡기가 극도로 까다로워지니 진입 전에 상대의 존야 유무를 미리 체크해두는 게 좋다."}], "general_counters": ["잭스", "클레드", "요릭", "트런들", "일라오이", "가렌", "마스터 이", "킨드레드", "니달리", "샤코", "케인"]}
{"champion": "요네", "aliases": [], "hard_counters": [{"name": "레넥톤", "reason": "탑 요네 밴 대상 1순위이자 초 하드 카운터. 만약 탑 요네인데 상대가 레넥톤을 뽑으면 그냥 닷지하거나 탈주하는 게 속 편할 것이다. 레넥톤이 이동기인 E를 배우기 전에는 사거리 차이로 이득을 보기 쉽지만 3레벨이 되는 순간 구도가 완전히 뒤바뀐다. 레넥톤의 강화 W에는 보호막 파괴가 있기 때문에 요네의 라인전 딜교 핵심이자 부족한 체급을 보완해주는 보호막을 무효화하고, 레넥톤이 3레벨이 되는 순간 자르고 토막내기로 진입하여 일방적으로 폭딜을 넣은 후 다시 후퇴하기 때문. 야스오와 달리 요네의 보호막은 능동적으로 사용할 수 있어 영혼 가르기를 아끼면서 딜 교환을 할 수는 있으나, 레넥톤 입장에선 보호막이고 뭐고 E-평-W-평-Q-E만 해도 방어 능력치가 허약한 요네가 레넥톤의 폭딜에 찢겨나가는 것은 매한가지다. 더군다나 레넥톤은 물몸 근접 챔피언을 잡는 데 도가 텄기 때문에 한 번이라도 킬을 허용하게 되면 구도가 완전히 무너져 풀피에 타워를 끼고 있더라도 레넥톤이 강신을 키고 스킬 콤보를 때려 박으면 아무런 저항도 못하고 죽는다."}, {"name": "잭스", "reason": "레넥톤과 함께 탑 요네의 하드 카운터로 군림하는 2황. 기본 공격을 회피하는 반격과 방마저 모두를 올려주는 무기의 달인으로 인해 초중후반 모두 요네가 불리하다. 물론 반격을 영혼해방으로 사거리 밖으로 벗어나서 회피할 수는 있으나 요네의 진입, 회피, 딜링, 추격을 모조리 담당하는 고밸류 스킬을 회피 한 번에 소모해야 것은 그만큼 요네에게도 손해를 강요한다. 딜링 능력도 요네에게 크게 밀리지 않으며, 기본적인 스펙 차이와 탱킹 능력까지 갖추는 템트리 때문에 요네와의 근접 딜링에서 절대적인 우위를 지닌다. 대부분의 전사들과는 다르게 잭스는 게임이 길어질수록 대인전 능력이 극에 달하기 때문에 중후반을 기약하며 버텨본다 한들 자살행위다. 다만 코어가 뽑히기 이전 극초반 상황에서 요네가 Q나 E로 반격을 회피한다면 의외로 맞딜 자체는 준수하다. 잭스 또한 극초반에 반격을 믿고 겁 없이 들어갔다가 요네가 회피해 버리면 이후 딜교환에서 요네에게 지는 경우가 종종 있다. 즉 요네는 오히려 잭스가 그나마 약한 초반에 어떻게든 온몸 비틀기로 기회를 잡아 무조건 솔로킬을 낸 후 그대로 스노우볼을 굴려 성장 차이를 크게 벌려야 한다. 잭스가 판금 장화만 가져와도 상대가 안 되며 광휘의 검까지 갖춘다면 그 이후로는 절대로 못 이긴다."}, {"name": "르블랑", "reason": "미드 요네의 초 하드 카운터. 원거리에 기동성까지 뛰어난데다 폭딜과 CC로 무장해 일방적인 딜교를 구사하는 르블랑은 요네를 완전히 압도한다. CS 하나하나에 견제가 날아오며 발끈해서 덤볐다간 목줄이 씌워진 채로 일방적으로 두들겨 맞고 돌아와야 한다. 스킬의 발동 속도가 느리고 타겟팅 스킬이 전혀 없는 요네는 게임 내내 르블랑의 압도적인 기동력에 휘둘리게 된다. 최악은 갱 호응으로, 요네는 도주력이 나빠서 갱을 당하면 십중팔구 손해로 이어지나 르블랑은 우습게 살아나간다."}, {"name": "아칼리", "reason": "미드 요네 하드 카운터 2. 프로 대회에서조차 요네를 하기 위해서 필밴을 요구할 정도로 상성이 확실하다. 초반 요네의 허접한 딜로는 절대로 아칼리를 이길 수 없다. 일단 장막의 존재 자체로 인해 필멸의 검을 도무지 맞힐 수가 없고 아칼리만 일방적으로 딜교를 구사하기 때문에 상당히 어렵다. 아칼리의 종합 딜량은 다른 암살자들은 쌈 싸먹는 수준이며, 특유의 트릭키한 스킬셋으로 요네의 스킬을 회피하기도 쉽다. 비슷한 스킬셋을 가진 야스오는 바람 장막(W)으로 오연투척검(Q)과 표창곡예(E)를 막을 수 있고, 아칼리가 장막 속에 숨어도 E-Q 콤보로 원형으로 타격이 가능해서 아칼리와의 딜교환이 나름 수월하지만 요네는 영혼 가르기(W)가 아니면 장막 안의 아칼리를 공격하기가 매우 어렵고 아칼리의 스킬에 대처하기도 힘들다. 얌전히 수그린 채 받아먹고 주문포식자를 뽑은 후에야 맞딜을 해보는 것이 좋다."}, {"name": "니코", "reason": "메이지 치고는 짧은 교전 사거리를 지녔지만 폭딜이 미드 라이너 중에서도 최강급이라 한 번만 실수해도 즉시 구도가 무너진다. CC기인 E 스킬이 미니언을 관통하기 때문에 요네는 이걸 피할 기동성이 영혼해방을 제외하고는 없다. 게다가 니코는 광역 에어본이라는 뛰어난 군중 제어기를 보유하고 있어 교전이 강한 요네도 승리를 장담하기 어렵다. 하지만 기동성이 전무한 메이지 챔피언이고, 성장성이 요네가 훨씬 뛰어나기 때문에 사이드에서는 유리하다. 초반 라인전을 최대한 무난히 넘기는 것이 관건. 다만 한타는 니코가 좋고 존야가 나오면 단독으로 뚫어내기 힘들어지므로 될 수 있으면 니코가 나오면 닷지를 하는 걸 추천한다. 라인전 열심히 버텨도 니코는 로밍 능력도 좋은 편이라 다른 라인이 죽어 나간다."}, {"name": "벡스", "reason": "하드 카운터. 즉발 공포와 막강한 딜링, 준수한 사거리와 중반 영향력으로 요네를 압도한다. 이동기 챔피언의 카운터랍시고 라인전도 고달픈데 아리와 비슷하게 합류도 더 빠르고 혼자 있는 요네를 노려 죽이기도 쉽다. 악의, 루덴 가리지 않고 힘든 상성이며 광전사 이후 E를 피함과 동시에 파고들면 딜교 이득을 볼 수 있긴 하나 그것도 벡스의 대응에 따라 실패할 수도 있다. 가장 주의할 것은 돌아오는 자리에 궁을 날리는 벡스이다. 이 경우 할 수 있는 것은 W로 하는 발악이나 탈진 걸기 외엔 없다."}, {"name": "아크샨", "reason": "예전 미드 루시안과 비슷한 상성. 라인전만 보면 그 이상이다. 대놓고 유사한 스킬셋을 지닌 동생 야스오가 아크샨의 하드 카운터인 것과는 정반대이다. 초반 라인전이 매우 강력한 원거리 챔피언이라 미니언 웨이브에 접근하기조차 힘들고, 솔로킬을 허용하지 않고 버티더라도 특유의 로밍 능력에 아군들이 죽어나간다. 아크샨이 악당 처단(W)으로 은신하면, 뒤늦게 로밍을 따라가더라도 느릴 수밖에 없고, 아크샨의 로밍을 의식해서 앞으로 섣불리 나갔다간 로밍을 가는 척 미드에 숨어있던 아크샨이 튀어나오기도 한다. 라인전도 고역인데 미드 차이가 나기 일쑤인 상대."}], "general_counters": ["오공", "우디르", "가렌", "세트", "다리우스", "리븐", "워윅", "클레드", "볼리베어", "이렐리아", "판테온", "피오라", "올라프", "트린다미어", "일라오이", "우르곳", "트런들", "제이스", "쉔", "탐 켄치", "말파이트", "럼블", "갱플랭크", "람머스", "나서스", "신지드", "퀸", "오로라", "케넨", "리산드라", "애니", "베이가", "애니비아", "트위스티드 페이트", "블라디미르", "피즈", "제드", "키아나", "탈론", "카타리나", "신드라", "아리", "말자하", "탈리야"]}
{"champion": "요릭", "aliases": [], "hard_counters": [{"name": "트린다미어", "reason": "라인전 구도에서 트린다미어는 망자의 진(W)을 회전 베기(E)로 그냥 벗어나며, 애도의 안개(E)를 맞혀도 회전 베기(E)로 딜 기회가 봉쇄된다. 게다가 트린다미어는 적을 처치하면 추가 분노를 수급하기에 망령들을 잘못 소환했다간 그대로 포션이 되며, 조롱의 외침(W)으로 둔화를 걸고 걸어서 접근하는 트린다미어는 상대하기가 매우 빡세다. 유체화를 켜면 망자의 진(W)를 걸어서 피할 수도 있고 갇혀도 곧바로 회전베기(E)로 넘어오기 때문에 제대로 된 대응이 불가능하다. 트린다미어가 심리전으로 망자의 진(W)을 사용하게 유도했다면 망자의 진(W) 쿨타임 동안 계속 뒤에서 사리고만 있어야 하며 사이드에서는 기동성이 출중한 트린다미어가 언제나 선공권을 가지고, 요릭 입장에서 맞싸움을 어떻게든 이기더라도 트린은 무조건 5초간 살기 때문에 트린다미어 팀원의 백업에 빨려 들어갈 확률이 높다. 반대 상황에서는 요릭의 아군이 백업을 오더라도 요릭이 전혀 호응할 수 없고, 그대로 트린다미어가 빠져나가는 것을 구경해야 한다."}, {"name": "이렐리아", "reason": "밴 대상 1순위. 밴을 까먹었다면 닷지하자. 이렐리아는 요릭의 주력 스킬 E를 회피하기 쉽고, 맞히더라도 날아가던 안개 망령이 이렐리아의 칼날 쇄도(Q)에 즉사한다. 즉 안개 망령을 뽑는 건 이렐리아의 스택과 체력을 채워주는 꼴이다. 요릭이 갱 호응을 위해 망자의 진으로 이렐리아를 가두더라도 이렐리아는 Q 스킬을 망자의 진 밖의 대상에 사용하거나, 빠른 공격 속도를 활용하여 망자의 진을 파괴하여 탈출할 수 있다. 반면 요릭은 이렐리아의 스턴 거리에 항상 노출되어 있는데, 맞으면 큰 손해를 본다. 안개 마녀를 소환하면 안개 마녀에 의해서 망령이 자동 생성되기 때문에 이렐리아가 요릭에게 접근하기 쉬워지며, 안개 마녀를 소환하지 않는다면 궁극기가 없는 챔피언이나 다름없다. 심지어 체력 유지력이 높아 프리징도 쉬운데, 요릭은 챔피언 구조상 강제로 라인을 밀게 된다. 닷지에 실패했다면, 이렐리아의 모든 스킬을 회피함과 동시에 망령을 소환하지 않고, 첫 귀환에 주문검을 구매한다. 그리고 요릭이 후픽을 당했다는 건 다른 아군이 후픽했다는 뜻이니 아군이 이기길 기도하자."}], "general_counters": ["그웬", "오공", "레넥톤", "잭스", "암베사", "클레드", "피오라", "쉔", "초가스", "카시오페아"]}
{"champion": "우디르", "aliases": [], "hard_counters": [], "general_counters": ["모데카이저", "가렌", "다리우스", "세트", "트런들", "볼리베어", "일라오이", "요릭", "클레드", "트린다미어", "잭스", "아칼리", "쉔", "람머스", "나서스", "피오라", "티모", "퀸", "킨드레드", "그레이브즈"]}
{"champion": "우르곳", "aliases": [], "hard_counters": [{"name": "사이온", "reason": "우르곳이 대세 챔피언이었던 시즌 8에도 대표적인 카운터로 꼽혀온 챔피언. 원거리와 근접의 매치업이지만 굉장히 기묘한데, 우르곳은 원거리지만 경멸로 뒤집어 근접전을 벌여야 이득이며 반대로 사이온은 근접이지만 우르곳의 화염의 메아리를 최대한 덜 맞으면서 버티기 위해선 필연적으로 근접전보단 원거리 견제 위주로 해야 한다. 그렇기 때문에 사이온은 우르곳의 사정거리 밖에서 대량 학살 강타(Q)로 일방적인 견제를 하며, 우르곳의 견제는 보호막으로 쉽게 막아낸다. 경멸이 한 번 잘못 빠지면 우르곳은 감속과 기절, 에어본 등 여러 CC와 함께 물리, 마법 피해 가리지 않은 견제를 맞아야 하기 때문에 상당히 신중하게 해야 한다."}, {"name": "문도 박사", "reason": "위의 상대하기 힘든 챔피언 조건에서 심판의 원을 무력화하는 챔피언을 제외한 모든 조건을 충족한다. 높은 둔화율과 긴 사거리를 지닌 뼈톱을 4초마다 던져대며 우르곳의 기동력과 사거리 약점을 찌르고, 패시브의 약간의 체젠과 문도가 주로 드는 도란 방패, 재생의 바람 등의 체젠으로 우르곳의 견제를 버텨낸다. 경멸로 들어가고자 해도 패시브로 씹고 뼈톱을 던지며 우르곳의 추적을 떨쳐내며, 설령 넘겼다고 하더라도 우르곳의 패시브를 통한 순간적인 폭딜을 W로 도로 다시 회복해 버린다. 겨우겨우 피를 깎아 불사의 공포(R)로 처형해 버리려고 해도 잃은 체력에 비례한 회복과 이동 속도를 제공하는 궁극기 때문에 도망갈 수 있다. 심지어 우르곳의 성장성마저도 16레벨 궁극기를 통해 발휘되는 문도의 고점에 비하면 우스울 정도이다. 우르곳의 최고점인 11~13레벨 시점에 극한으로 스노우볼을 굴려 게임을 끝내 버리지 않는 한 승리할 방법이 없다시피한 하드 카운터."}, {"name": "카서스", "reason": "탑 카서스 통계가 잡히던 시절에는 승률이 가장 낮은 하드 카운터였으며 카서스가 정글을 가는 지금도 다르지 않다. 부식성 폭약보다 사거리가 길고 쿨타임은 훨씬 짧은 황폐화(Q)로 일방적인 견제가 가능하며, 특히나 우르곳은 덩치가 커서 황폐화를 피하기 어렵다. 하지만 무엇보다 가장 치명적으로 작용하는 것은 궁극기 상성으로, 한타에서 우르곳이 카서스를 당겨와 처형하는 순간 카서스에게 최고의 묏자리를 깔아 주는 꼴이 되어 한순간에 역적이 될 수 있다"}, {"name": "아무무", "reason": "람머스의 몸 말아 웅크리기만큼은 아니어도 짜증내기(E)가 심판의 원과 완전 상극이다. 받는 물리 피해량을 감소시키는 고유 지속 효과가 있어서 심판의 원의 피해량도 대폭 줄어들고, 짜증내기의 쿨타임이 심판의 원에 맞을 때마다 줄어들기 때문에 우르곳을 상대로 거의 난사하다시피 사용할 수 있다. 덕분에 맞딜을 할 경우 오히려 우르곳만 계속해서 손해를 보는 기묘한 광경을 볼 수 있다. 한때 우르곳이 대세 챔피언이었을 때는 이것만 보고 아무무를 탑에 보내는 강수를 두는 경우도 있었을 정도."}, {"name": "람머스", "reason": "평타에 맞을 경우 마법 피해를 반사하는 몸 말아 웅크리기가 심판의 원에도 여지없이 적용되기 때문에, 교전 중에 람머스의 도발에 맞는 순간 우르곳의 체력이 엄청난 속도로 빠진다. 덤불 조끼를 빠르게 올리면 우르곳이 초당 3회씩 빠르게 자해하기 때문에 분명 때리기만 했는데 딜교를 지는 경우가 나올 수 있다. 도발은 이동을 제한하므로 화염의 메아리의 발동도 방해받는 것은 덤. 아무무와 마찬가지로 렙 차가 나도 도무지 이길 수가 없는 극상성이다. 게다가 우르곳은 경멸의 선딜 때문에 굼뜨고 덩치도 커서 람머스의 고속 갱킹을 회피하기 어렵다. 람머스가 우르곳을 박기 전에 경멸로 보호막을 쓴 뒤 심판의 원을 끄는 게 최대한의 발악이다."}], "general_counters": ["퀸", "베인", "아칼리", "마오카이", "잭스", "요릭", "케일", "트린다미어", "모데카이저", "뽀삐", "오른", "볼리베어", "트런들", "어겅", "라이즈", "올라프", "이렐리아", "피오라"]}
{"champion": "워윅", "aliases": [], "hard_counters": [{"name": "볼리베어", "reason": "최악의 상대다. 기본 체급부터 볼리베어가 높고 스킬 구조도 볼리베어가 유리해서 상대하기 까다로운 편이다. 스킬이 다 찍히지 않은 2레벨까지는 워윅이 우세하지만 스킬이 다 찍힌 3레벨부터는 볼리베어가 우세해진다. 3레벨부터는 볼리베어가 기절을 이용해 일방적으로 치고 빠지는 그림이 나와서 항상 볼리베어만 이득을 보기 때문에 굉장히 골치가 아픈 편. 오히려 덤불조끼를 먼저 가는 볼리베어는 스킬 가속이 낮기 때문에 워윅이 이길 여지가 있는데 점화를 채용하고 스킬 가속 세팅을 먼저 하는 볼리베어는 이기기 정말 힘들기 때문에 어지간하면 라인전에서 혼자 이길 생각은 안 하는 것이 좋다. 다만 15시즌 들어 볼리베어는 기존의 가속 위주 세팅이 아니라 워윅의 곰 버전이라 할 정도로 치속에 기반한 공속템들을 다수 가기 때문에 3렙 전에 거세게 압박을 하면 공속템 세팅을 하는 볼리베어는 내구력이 매우 낮아 계속 이길 수 있지만 반대로 이때 압박을 거세게 가하지 못해 한 번 볼리베어에게 솔킬을 내주는 순간 이후로도 정말 이기기 힘들어진다."}, {"name": "갱플랭크", "reason": "모든 CC기를 해제할 수 있는 괴혈병 치료(W)를 가지고 있어 워윅의 공포와 제압을 모두 해제할 수 있다. 심지어 이는 접근해서 워윅이 스킬을 사용했을 때의 이야기고, 접근하는 것조차도 쉽지 않다. 워윅이 접근하기 위해 W를 사용하고 돌진해도 갱플랭크의 혀어어어업상(Q)에 이동 속도 버프가 사라지고, 화약통과 궁극기를 이용한 카이팅은 알아주는 수준이다. 갱플랭크가 다이브에 취약하다는 점을 정글과 함께 잘 공략하면 숨통이 트이지만, 게임이 질질 끌린다면 Q의 패시브인 추가 골드 획득으로 엄청난 속도로 성장하여 워윅을 따라잡거나 추월할 수 있다. 라인전이든, 스플릿이든, 한타에서든 매우 까다로운 상대."}, {"name": "잭스", "reason": "밴 대상 1순위 모든 기본 공격을 무시하는 잭스의 반격(E) 앞에 워윅의 모든 공격이 무력화된다. 야수의 송곳니(Q)와 무한의 구속(R) 모두 기본 공격 판정 스킬이기 때문이다. 물론 6레벨 전까지는 워윅의 막강한 유지력으로 잭스의 부실한 유지력을 파훼해 소모전을 강요할 수 있다. 하지만 잭스 입장에서는 반격(E)을 조금만 생각해서 쓰면 절대 킬각이 잡히지 않아 유지력 이외의 이득을 볼 수 없다. 물론 잭스가 잘 쓴 반격을 워윅의 공포로 흘릴 수는 있으나, 워윅에게 소중한 대미지 경감을 적시에 사용하지 못하게 된다. 심지어 같은 스킬 레벨일 때 잭스의 반격이 워윅의 원시의 포효보다 쿨타임이 더 짧은데, 워윅은 보통 E를 먼저 마스터하지 않지만 잭스는 보통 W 다음으로 E를 먼저 마스터하기 때문에 가면 갈수록 워윅만 손해를 보게 된다. 설령 반격이 빠졌더라도 도약 공격(Q)으로 싸움을 회피할 수도 있어 워윅이 원하는 대로 싸움에 응하지 않는다."}, {"name": "소환사 스펠 점화 + 필멸자의 운명과 같은 치유 감소 아이템", "reason": "위치감 템이라고도 불린다. 상대가 워윅을 잘 안다면 극초반부터 이러한 아이템들을 1코어로 뽑아오는 경우가 잦다. 치유 감소 효과를 적용받는 워윅은 생명력 흡수를 통한 강력한 전투 지속력이 현격히 약화되기 때문에 원시의 포효(e)를 제외하면 탱킹 수단이 없어지게 되어 위험하다. 물론 워윅을 상대로 이러한 아이템들을 전혀 가지 않는 저티어에서나 워윅의 존재감이 재앙처럼 느껴지겠지만, 좀 더 높은 수준이거나 상위 티어로 갈수록 워윅이 그리 좋은 챔피언이 되지는 못하는 이유이다."}], "general_counters": ["갱플랭크", "베인", "케넨", "퀸", "카시오페아", "문도 박사", "일라오이", "잭스", "요릭", "올라프", "가렌", "나서스", "아칼리", "티모", "그레이브즈", "릴리아", "샤코", "케인(다르킨 학살자)"]}
{"champion": "유나라", "aliases": [], "hard_counters": [{"name": "닐라", "reason": "유나라 최악의 하드 카운터다. 닐라의 빠른 레벨링 덕분에 유나라랑 성장 차를 크게 벌릴 수가 있으며 닐라 또한 초반에 강력한 모습을 보이는 데다 무엇보다도 유나라가 얼마나 기본 공격이 빠르든 아프든 닐라는 이 모든 걸 승리의 장막으로 닐라의 아군을 포함해 가볍게 파훼해 버린다. 또한 닐라가 급류로 잽싸게 유나라 쪽으로 파고 들어가 유나라를 위협할 수가 있으며 궁극기의 강제 이니시도 유나라를 위협할 정도로 매우 강력하다. 후반을 노리자니 이쪽도 후반 영향력이 어마어마해 빈틈이 보이지가 않는다. 그나마 위안인 점은 닐라 자체가 픽률이 적은 장인 챔이라 만날 일이 드물다는 점이지만, 동시에 어쩌다 만나게 된다면 뽀록을 기대하기도 전에 지옥을 맛볼 수 있다."}, {"name": "코그모", "reason": "라인전과 후반 밸류 모두 밀리는 하드 카운터. 닐라와 함께 보통 고정밴을 권장한다. 코그모는 W와 R을 이용한 견제 능력이 뛰어난데 그렇다고 맞딜을 하면 코그모의 강력한 W 딜을 못 버티고 사망할 것이다. 코그모는 하이퍼 캐리 챔피언들 중에서도 화력이 약한 구간이 없는 것이 장점이라 모든 구간에서 유나라의 딜링 능력을 상회한다. 유나라가 꾸역꾸역 Q 스택을 쌓고 치명타율을 챙겨 발휘하는 하이브리드 광역 DPS를 코그모는 루난+W 딸깍이면 손쉽게 낼 수 있다. 비주류 챔피언이긴 하지만 닐라보다 픽률도 높고 코그모에게 밀렸을 때의 리스크도 높으니까 밴을 하는 것이 좋다. 그나마 유나라는 라인전이 종료되고 원딜끼리 미드 라인을 막을 때 폭딜을 통한 암살에 능해 코그모의 생존력을 후벼 팔 여지가 있으나, 코그모는 보장된 딜링 능력을 믿고 딜탱템을 한두 개 챙겨 생존력을 보완하는 경우도 많은데다 물몸인 유나라가 W로 팔이 훨씬 길어지는 코그모를 상대로 암살을 시도했다가는 유나라가 먼저 찢어질 가능성도 높다."}], "general_counters": ["애쉬", "드레이븐", "루시안", "바루스", "케이틀린", "트위치", "스몰더", "트리스타나", "알리스타", "제라스", "자이라", "럭스", "브랜드"]}
{"champion": "유미", "aliases": [], "hard_counters": [{"name": "소나", "reason": "타 유틸형 서포터의 경우 반반만 가도 유미의 성능을 따라갈 만한 챔피언이 없지만 서포터 중 독보적인 왕귀력을 가진 소나의 경우 이야기가 다르다. 대부분의 경우 초반부터 후반까지 전 구간 소나의 성능이 유미를 능가하는 편이며, 이 때문에 유미는 소나 상대로 46~47% 정도의 승률을 유지하는 편이다."}], "general_counters": ["갈리오", "노틸러스", "라칸", "레오나", "렐", "마오카이", "블리츠크랭크", "아무무", "알리스타", "쓰레쉬", "파이크", "드레이븐"]}
{"champion": "이렐리아", "aliases": ["이렐"], "hard_counters": [{"name": "세트", "reason": "라인전 단계부터 사이드까지 딜교를 이기는 구간이 단 하나도 없는 최악의 상대. 기본적으로 세트의 패시브 때문에 DPS 측면에서도 불리하며 1렙에 4스택을 쌓고 싸움을 걸어도 세트가 패시브를 활용한 평타 몇 번 치다가 미니언과 함께 이렐리아에게 안면 강타(E)를 넣어주면 맞딜을 진다. 그나마 강펀치(W)를 피해야 딜교를 이길 각이 나오는데 세트 숙련도가 높은 상대를 만나면 이마저도 불가능하다. 아무리 칼날 쇄도로 정신없게 만들어도 세트가 침착하게 평타만 치다가 미니언과 함께 안면 강타(E)를 써서 기절을 걸고 강펀치(W) 연계를 먹이면 무조건 강펀치를 맞을 수밖에 없기 때문. 숙련도가 낮으면 빈틈을 잘 캐치해서 어거지로라도 이길 각을 볼 수는 있으나 숙련도가 조금이라도 있는 세트는 빈틈조차 안 나와서 답이 없다. 한타 단계에서도 이렐리아가 궁을 쓰려 세트 앞에 있는 챔프에게 진입하면 궁으로 잡아채 역으로 상대 진영을 박살 내버리거나, 세트의 뒤에 있는 챔피언을 물면 그대로 궁을 박아 저 멀리 뒤로 보내버려 이렐리아를 한타에서 벗어나게 만든다. 몰왕검이 떠도 세트가 맞 몰왕검을 올리면 세트 쪽이 훨씬 세고 몰왕검이 아닌 브루저 템이어도 세트가 유리하다. 실제로 모든 티어 구간에서 라인전 지표가 압도적으로 압살당하며, 게임 승률도 밀리는 최악의 상대."}, {"name": "볼리베어", "reason": "라인전에서 성장 차이를 내는 게 핵심인 이렐리아보다 더 라인전이 강한 하드 카운터이며, 후반까지 가도 이동기가 없다는 점만 빼면 한타 기여도 면에서도 전혀 밀리지 않는다. 리메이크 전에도 어마어마한 순간 폭딜로 원콤을 내버리는 데다가 스펙 차이도 심해서 상대하기 힘든 챔프였고, 리메이크된 후에는 엄청난 폭딜은 덜어냈지만 덜어낸 것이지 절대 약하진 않고 오히려 전투 지속력이 매우 강해져 싸우는 것 말고는 선택지가 없는 이렐에게 골칫거리인 건 매한가지다. 칼날 쇄도로 정신없게 만들어도 볼베는 번개 강타(Q)만 딸깍 누르면 확정 기절로 이렐을 묶어두고 팰 수 있기 때문에 답이 없다. 3렙 이후 E-Q-W-평에 집공이 터지고 스킬을 받으면 피가 반 토막 나기에 볼리베어에게 선공을 거는 건 자살행위이며, 선공을 하지 않더라도 Q로 이렐리아의 E를 무시하고 쫓아올 거리를 한 번이라도 주면 끝장이고, 맞지 않더라도 E가 빠지면 CS 근처도 못 간다. 오죽하면 침팬지가 플레이해도 이렐은 이긴다는 소리도 있다."}, {"name": "뽀삐", "reason": "탑 이렐리아의 대표적인 하드 카운터. 기본적인 스펙 자체도 뽀삐의 우위인 데다 뽀삐의 W로 칼날 쇄도를 무력화시키면 쿨타임이 초기화되지 않아 아예 접근이 불가능하다. 라인전에서도 딜 교환 성립이 안 될뿐더러 한타에서도 매우 성가신 상대."}, {"name": "람머스", "reason": "초중후반 전부 이렐리아가 상대하기 버거운 하드 카운터. 이렐리아는 기본적으로 4스택의 공속 버프와 각종 적중 시 효과를 베이스로 싸우는 챔피언인데, 람머스는 상대의 공격 속도가 빠를수록 강해지는 챔피언이다. 탱커치고 낮은 체력 수치 의존도와 막강한 반사 뎀 덕에 몰왕이 나와도 1대1은 시도조차도 못하며, 한타에서도 자신을 때려서 손해를 보도록 도발을 걸어버린다."}, {"name": "잭스", "reason": "이렐킹이 고정밴하는 하드 카운터. 라인전도 힘든데 후반 성장성 역시 잭스가 월등하다. 반격 때문에 4스택 이후의 딜 교환을 차단당하고, 타겟팅 돌진기를 가졌기 때문에 반격을 피한다는 보장도 없고 쌍검협무를 회피할 수도 있다. 1레벨 맞싸움은 절대 이길 수 없기 때문에 잭스의 부실한 유지력을 공략하기도 어렵다. 이렇게 잭스가 무난히 6레벨을 찍게 되면 광휘의 검+무기 강화+궁극기의 3타 딜이 더해져 잭스의 Q평W 딜 교환이 엄청나게 아파지게 되어 E를 맞히지 못하면 바로 킬 각이 잡혀버린다. 이렐리아를 상회하는 성장성 때문에 게임 내내 불리하다."}, {"name": "워윅", "reason": "천상계 이렐리아 장인인 이렐킹조차 브론즈 워윅에게도 승리를 장담할 수 없다고 공언한 하드 카운터. 일단 스탠딩 맞다이는 거의 무조건 진다. 워윅은 대부분의 탑 챔피언과의 초반 맞딜 승리가 보장된 챔피언이며, 기본 스탯이 부실하다고 체력이 낮은 워윅에게 함부로 진입했다가는 무시무시한 피흡과 E의 순간적인 탱킹+공포로 역관광당하기 쉽다. 반반을 어찌저찌 간다 쳐도 맞딜은 성장 차이가 나도 워윅이 압살하고 한타를 본다 해도 워윅이 이렐리아를 마크하기 좋기에 벤을 하거나 닷지를 하는 게 정신건강에 이로울 정도."}, {"name": "신 짜오", "reason": "의외의 하드 카운터. 신 짜오는 보통 정글로 기용되므로 잘 만날 일이 없지만, 탑에서 만난다면 굉장히 까다로운 상대다. 우선 신짜오의 맞딜 능력은 이렐리아 못지않게 강하며, E의 도전 대상 장거리 돌진 및 Q의 에어본도 매우 거슬린다. 6레벨 전까지의 초반 구간에서의 맞딜은 갱을 부르지 않는 이상 이길 수 없으며 무난하게 파밍을 하다가 몰락이 뜬 이후에는 비벼 볼 만하다. 초반에 무리하게 딜교를 걸다가 킬을 따이는 순간 신짜오에게 주도권이 완전히 넘어가는 매치업."}, {"name": "르블랑(미드)", "reason": "잡기가 너무나도 어렵다. 조건부로 기동성이 좋은 이렐리아보다 더욱 자유로운 이동이 가능하며, 6레벨 이후에는 W-모방W로 도망가 버리니 1 대 1 미드에서는 극상성에 가깝다. 갱 호응도 직선적인 환영 사슬(E)이 치명적으로 다가오니 기회가 오기 전까지는 파밍에 집중하는 것이 좋다. 성장이 끝나 아이템이 나오고 마법 저항력이 확보되었다면 이렐리아 본인은 죽지 않지만 여전히 혼자서 르블랑을 잡을 순 없으며 르블랑은 환영 사슬로 다굴할 게 뻔하니 계속 까다롭다. 거기다 정상적인 르블랑이라면 그때까지 이렐리아를 가만히 내버려두지 않는다는 것도 문제. 르블랑이 잘하는 유저라면 헤르메스와 마최는 물론이고 여차하면 멜모셔스까지 올릴 각오를 하며 철갑궁이나 이른 몰왕검을 포기하는 템트리를 타서 어떻게든 솔킬을 따이지 않고 갱 호응이나 초반 교전에서 죽지 않도록 해야 한다."}], "general_counters": ["올라프", "레넥톤", "클레드", "탐 켄치", "일라오이", "크산테", "우디르", "말파이트", "쉔", "아칼리", "나서스", "티모", "녹턴", "모데카이저", "트린다미어", "트런들", "가렌", "다리우스", "신지드", "리븐", "카밀", "그라가스", "렉사이", "판테온", "아리", "애니비아"]}
{"champion": "이블린", "aliases": [], "hard_counters": [{"name": "렉사이", "reason": "명실상부 이블린 최악의 하드 카운터로 아무리 이블린이 은신으로 위장한다 해도 렉사이는 땅 밑으로 매복만 해도 진동 감지로 이블린의 위치를 감지할 수가 있으며 렉사이는 정글 챔피언 중 초반 강캐인 데다 기동력도 준수하기에 몸 약한 이블린은 초반에 렉사이에게 한 번 물리게 되면 점멸이 없는 한 죽거나 빈사 사태가 되기 십상이다. 궁극기 상성은 이블린 쪽이 더 좋지만, 어차피 이블린 혼자 산다고 해서 상대 쪽이 이블린 걱정 없이 한타를 맘껏 열어젖히는 걸 막을 수가 없을 뿐더러, 최대한 변수를 만들어야 할 암살자인 이블린이 렉사이에게 발이 묶인 상황 그 자체로 팀 전체에 엄청난 악영향을 끼친다."}, {"name": "샤코", "reason": "초반 갱의 달인이고 후반에는 깜짝 상자의 존재만으로 증오의 가시를 막거나 채찍 유린을 무력화하면서 환각으로 이블린의 딜의 완성인 최후의 포옹을 피하는 등 여러모로 하드 카운터다. 갱보다 무한 카정으로 이블린을 괴롭히는 것도 초반에 샤코보다 약한 이블린 탓에 여간 어려운 일이 아니다."}, {"name": "워윅", "reason": "전통의 하드 카운터. 피의 사냥으로 은신한 이블린의 위치를 찾아낼 수 있으며 이블린 따위는 비교가 안 되는 초반 맞딜 능력과 원시의 포효의 피해량 감소로 거의 이블린의 대부분을 카운터 친다."}], "general_counters": ["신 짜오", "리 신", "엘리스", "그레이브즈", "니달리", "마스터 이", "바이", "판테온", "카직스", "올라프", "킨드레드", "문도 박사"]}
{"champion": "이즈리얼", "aliases": ["이즈"], "hard_counters": [{"name": "칼리스타", "reason": "하드 카운터. 현재 통상적인 모든 원거리 딜러 중에서 대 이즈리얼 맞춤형 카운터 수준으로 각자 메커니즘과 구조에서부터 완벽하게 카운터를 당하는 탓에 아군 서포터가 상대 서포터보다 상성상 우위라도 그 상성을 뒤집어 버릴 정도로 불리한 관계다. 이즈리얼의 핵심 딜링기인 신비한 화살을 패시브로 완벽하게 회피가 가능하기 때문에 신비한 화살을 한 대라도 맞히는 것조차 기적이며, 기본적으로 인파이팅에 특화된 원딜인 칼리스타가 작정하고 들어오면 비전 이동과 점멸을 다 빼고도 죽을 가능성이 계속 생긴다. 시간이 지난다고 무작정 이즈리얼 쪽에서 좋아지지도 않는데, 칼리스타는 아무리 유통기한이 있더라도 기본적으로 평타형 원딜이라서 다른 원딜에게는 일정 시간이 지나면 거의 밀리지만 논타겟 스킬인 신비한 화살 의존도가 높은 이즈리얼을 상대로는 DPS와 유지력에서 끝까지 우위를 점할 수 있다. 게다가 칼리스타도 생각이 있으면 이즈리얼이 라인전에서부터 성장할 시간을 주지 않기 위해 디나이, 프리징을 하면서 성장 차이를 벌릴 것이다. 실제로 천상계 솔로랭크나 대회에서도 선픽 이즈리얼이 나오면 바로 칼리스타를 픽할 정도로 검증된 카운터 챔피언이다. LCK에서 픽 횟수가 가장 많은 챔피언이 이즈리얼이고 밴 횟수가 가장 많은 챔피언이 칼리스타일 정도."}, {"name": "미스 포츈", "reason": "미스 포츈이 까다로운 이유는 라인전도 라인전이지만 평타 지속딜보다는 견제를 위주로 플레이하는 이즈리얼 특성상 선 피바라기를 가는 챔피언 상대로 급속도로 썩어버리기 때문이다. 특히 미스포츈은 선 피바라기를 가는 다른 원딜인 드레이븐과 달리 킬에 집착할 필요가 없고, 파워커브 특성상 이즈리얼에게 약해지는 구간이 없어서 게임 내내 우위를 점할 수 있다. 미스 포츈의 궁극기를 자력으로 끊을 수단도 없는 것은 덤."}, {"name": "카이사", "reason": "대회에서 한쪽이 이즈리얼을 선픽으로 가져오면 후픽으로 카이사를 가져오는 것이 밴픽의 교과서라고 할 수 있을 정도로 자주 등장하는 구도이며, 실제로 이즈리얼과 카이사는 대회든 솔랭이든 일반적으로 45 : 55로 카이사가 우세를 보인다. 카이사는 Q 덕분에 라인 클리어링이 어렵지 않고 성장력과 맞딜이 매우 뛰어나기 때문에 라인전에서 제대로 압박하지 못하면 이즈리얼이 모든 부분에서 열세를 보이며, 중반부에 W 한 번 잘못 맞았다가 비명횡사하기도 그만큼 쉽다. 다만 이즈리얼은 기동성과 사거리가 뛰어나고 카이사는 사거리가 짧은 인파이터형 챔피언이라 W만 맞지 않는다면 난전 대신 대치전을 유도하여 일방적인 딜링 투사 정도는 가능하다. 게임 외적으로 카이사도 이즈리얼 못지않게 라이엇의 사랑을 받는 챔피언인 데다가 LCK, LPL 등에서 주류 픽으로 쓰이는 경향이 많기 때문에 두 챔피언이 전부 상위 티어인 메타도 자주 등장하며 그만큼 맞구도가 굉장히 자주 나오는 편이다."}], "general_counters": ["바루스", "진", "드레이븐", "루시안", "세나", "애쉬", "트리스타나", "베인", "코그모", "트위치", "스몰더", "유나라", "시비르", "직스", "카르마", "제라스"]}
{"champion": "일라오이", "aliases": ["일라"], "hard_counters": [{"name": "케일", "reason": "최악의 하드 카운터 3렙~5렙까지는 어느 정도 이길 만하지만 6렙 이후로는 지옥을 맛보게 된다. 6렙 이후부터는 케일이 원딜이 되기 때문에 거리 자체를 잘 안 주고, 맞춰지는 스킬셋마저 일라오이를 무력화시킨다. 16렙은 말할 것도 없고, 화염파가 생기는 11렙만 되어도, 케일이 일라오이딜을 궁으로 버티고 녹여 버릴 수 있기 때문에 영혼을 뽑아도 케일이 맞딜로 찍어누른다. 그리고 무엇보다 케일의 패시브 (거룩한 승천)에 붙어있는 희열 효과와 W 스킬 (천상의 축복)이 정말 거슬리는데 케일이 16레벨까지 왕귀할 경우 희열을 통한 상시 10% 이속 상향 효과와 천상의 축복을 통한 이동속도 증가와 체력 회복을 끊임없이 하게 되는데 이렇게 엄청난 dps를 가진 원거리 딜러에게 이는 엄청난 버프로, 돌진기의 경우 어느 정도 궤적이나 타이밍을 맞추어서 일라오이가 E를 끌 여지는 있으나 기본 이속 자체가 빨라 버리면 모션 없이 어디로든 자유롭게 움직일 수 있으므로 일라오이가 절대로 E를 맞힐 수 없게 된다. 그나마 얼어붙은 건틀릿을 비롯한 슬로우 효과를 묻히면 효과적으로 영혼을 끌 수 있으나 16레벨까지 왕귀한 케일의 사거리는 625로 엄청나기에 케일이 카이팅 실수를 하는 것이 아니라면 절대로 접근하는 것이 허용되지 않는다. 왕귀한 케일은 한타 기여도도 높기 때문에, 어느 한쪽으로도 일라오이가 유리한 부분이 없다. 그야말로 케일이 대놓고 싸울 생각으로 플레이해도 딱히 유리하지 않은데, 아예 싸움도 때려치우고 라인에서 평소처럼 드러눕기만 해도 일라오이에게 불리해진다. 하드 카운터들 중 가장 까다로운 상대."}, {"name": "베인", "reason": "원거리 딜러 중 최악의 하드 카운터. 기동력이 뛰어나서 E나 촉수를 대부분 피하며, 선고로 일라오이가 W를 쓸 때 밀쳐내서 무력화시킬 수 있으며, 고정 피해를 포함한 높은 DPS로 탱킹도 쉽게 뚫어버린다. 탑 베인이 갱에 취약하다는 단점도 갱 호응이 최악인 일라오이에겐 우위를 점할 수 있는 부분이 아니다. 그나마 위안인 점은 이러한 탑 원거리 딜러들의 공통된 특징으로 상대 팀의 입장에서 베인이 탑에 나올 경우 조합이 망가지는 일이 꽤나 있기 때문에 이를 통한 운영이 가능하다는 것이다. 상대팀 탑이 원거리 딜러를 한다는 자체만으로 상대팀 입장에서는 이니쉬와 앞라인을 설 사람이 줄어드는 것이기에 이 허점을 통한 운영을 팀원들이 잘 해준다면 생각보다 전체적인 게임 흐름은 쉽게 흘러간다. 물론 이것은 전적으로 운영을 비롯한 팀원들의 실력에 달려있으므로 이것이 베인을 상대하기 쉬워진다고 할 수는 없으며, 상대팀의 조합도 잘 짜여 있다면 답이 없다."}, {"name": "하이머딩거", "reason": "승률 70%대를 넘는 마법사 중 최악의 하드 카운터. 일단 포탑이 일라오이의 E를 막는다. 대다수 탑 근접 챔피언들이 싫어하는 하이머딩거인 만큼 일라 입장에서도 딩거의 포탑 푸시는 까다로워한다. 또한, 초반 포탑 푸시 때문에 딩거의 영혼을 빼거나 CS를 먹기 힘들며, E 각이 나온다고 하더라도, 어느 정도 숙련도가 있는 하이머딩거는 포탑을 설치해서 막아버린다. 그렇다고 진입이 쉽지도 않은 것이, 진입 시도를 하면 딩거의 E를 이용한 W와 포탑 레이져 콤보 때문에 진입하기 힘들다. 또한 딩거의 라인전은 강한 편이라 일라 입장에선 갱을 부를 수밖에 없다. 더욱 문제인 것은 라인전을 이기면서 상대 정글을 불러서 일대다 상황을 유도하는 것이 기본 운영법인 일라오이는 갱 호응을 할 만할 스킬이 존재하지 않는 데다, 하이머딩거도 일라오이만큼은 아니어도 1대다 전투력이 꽤 강하고 존야와의 궁합은 오히려 더 좋기 때문에 2대1을 해도 오히려 하이머딩거가 다 잡는 진풍경이 나올 수 있다."}, {"name": "모데카이저", "reason": "하드 카운터 1호 라인전에서 한 번이라도 털려 주도권이 넘어갈 시 시간대에 상관없이 그 일라오이가 맞다이를 진다. 궁극기가 없는 초반에는 서로의 E를 맞히는 쪽이 이기고 빗나가는 쪽이 진다. 그러나 미니언 뚫는 광역 스킬인 모데카이저의 E가 단일 비관통 스킬인 일라오이 E보다 맞히기 쉬우며, 모데카이저는 근접 챔피언인 일라오이를 상대로는 죽음의 손아귀(E)가 빗나가 봤자 패시브가 조금 늦게 켜지는 손해밖에 없는 반면, 일라오이는 영혼의 시험(E)이 빗나가면 딜교환 능력이 크게 감소하기 때문에 둘 다 빗나간 상태라면 모데카이저가 유리하다. 따라서 동 실력 기준이라면 모데카이저가 유리하다. 6렙 이후로는 일라오이가 궁을 먼저 쓰면 죽음의 세계로 끌려 들어갔을 때 촉수가 모조리 사라지고 모데카이저가 먼저 쓰면 일라오이가 저지 불가로 씹어버릴 수 있어서 먼저 쓰는 쪽이 지는 상성인데, 일라오이의 궁극기는 촉수 추가 소환, 촉수 공격 쿨타임 감소, 혹독한 가르침(W)의 쿨타임 감소 등 강력한 효과가 줄줄이 붙어 있는 만큼 의존도가 매우 크지만 모데카이저는 능력치 차이 20%와 전장 제한이 전부이므로 서로 궁이 있을 때 모데카이저가 일라오이를 냅다 패기 시작하면 일라오이 쪽이 강제로 궁극기를 빼야 한다. 또한 모데카이저는 궁 안 쓴 일라오이에게 지는 경우 빼면 그만이지만 일라오이는 이기는 상황에서도 모데 궁을 씹으려면 계속 의식하고 있어야 하므로 기본적으로 일라오이에게 불리한 심리전이다. 엎친 데 덮친 격으로 죽음의 세계 내부에서 수은장식띠가 안 통하도록 변경된 뒤로는 일라오이에게 더욱 불리한 매치업이 되었다. 이 때문에 사이드에서는 무조건 지는데 모데카이저는 궁극기의 변수 때문에 한타 역시 일라오이와는 비교할 수 없을 정도로 우월하다."}, {"name": "요릭", "reason": "하드 카운터 2호. 픽률이 낮아서 그렇지 라인전에선 모데카이저보다 더 이기기 힘든 상대다. 구울이 계속 기어나와 요릭 앞을 막기 때문에 영혼의 시험(E)을 맞히기가 어려운 게 제일 큰 문제며, 이동기가 아예 없고 히트박스조차 큰 일라오이 입장에서 요릭의 애도의 안개(E)는 피하기가 상당히 어렵기 때문에 한 번이라도 애도의 안개(E)를 맞으면 구울과 안개마녀의 대미지에 피가 쫙 빠진다. 또한 구울과 안개 마녀 모두 챔피언 취급이 아니기 때문에 체력을 회복할 수단이 없어 유지력 싸움에서 밀리며, 요릭은 Q로 미니언뿐만 아니라 촉수를 지우면서 체력 회복이 가능하다. 더군다나 요릭의 구울과 안개마녀는 광역딜 내성이 50%라 촉수 강타(Q)로 한 방에 지우는 것조차 불가능하기에 일라오이가 구울을 지우려면 일일이 평타로 제거해야 한다. 게다가 뚜벅이 상대로 벽을 세우는 망자의 진(W) 역시 매우 거슬리고 6레벨 이후에 애도의 안개(E)를 맞고 가둬지면 일방적인 딜교 손해를 본다. 요릭 역시 뚜벅이 브루저나 탱커 상대로 점화 선택률이 높은 편이라 솔킬 위험도 큰 것은 덤. 한타가 좋지 않은 요릭을 상대로 한타로 승부를 보려고 해도 일라오이 역시 정면 한타에서는 대처법과 한계가 명확하기 때문에 한타에서 이득을 보겠다는 전략도 사실 좋은 전략이 아니다. 무엇보다 요릭의 스플릿 푸시 능력은 모든 챔피언을 통틀어서 최상위권에 속해있기 때문에 한타에서 시간이 조금이라도 끌리면 타워가 순식간에 갈려나간다."}], "general_counters": ["퀸", "아크샨", "칼리스타", "루시안", "드레이븐", "라이즈", "스웨인", "케넨", "카시오페아", "티모", "그웬", "클레드", "트린다미어", "가렌", "신지드", "뽀삐", "트런들"]}
{"champion": "자르반 4세", "aliases": ["자르반4세", "자르반"], "hard_counters": [], "general_counters": ["트런들", "녹턴", "마스터 이", "엘리스", "니달리", "레넥톤(탑)"]}
{"champion": "자야", "aliases": [], "hard_counters": [{"name": "미스 포츈", "reason": "미스 포츈이 까다로운 이유는 라인전도 라인전이지만 평타 지속딜보다는 견제를 위주로 플레이하는 이즈리얼 특성상 선 피바라기를 가는 챔피언 상대로 급속도로 썩어버리기 때문이다. 특히 미스포츈은 선 피바라기를 가는 다른 원딜인 드레이븐과 달리 킬에 집착할 필요가 없고, 파워커브 특성상 이즈리얼에게 약해지는 구간이 없어서 게임 내내 우위를 점할 수 있다. 미스 포츈의 궁극기를 자력으로 끊을 수단도 없는 것은 덤."}, {"name": "카이사", "reason": "대회에서 한쪽이 이즈리얼을 선픽으로 가져오면 후픽으로 카이사를 가져오는 것이 밴픽의 교과서라고 할 수 있을 정도로 자주 등장하는 구도이며, 실제로 이즈리얼과 카이사는 대회든 솔랭이든 일반적으로 45 : 55로 카이사가 우세를 보인다. 카이사는 Q 덕분에 라인 클리어링이 어렵지 않고 성장력과 맞딜이 매우 뛰어나기 때문에 라인전에서 제대로 압박하지 못하면 이즈리얼이 모든 부분에서 열세를 보이며, 중반부에 W 한 번 잘못 맞았다가 비명횡사하기도 그만큼 쉽다. 다만 이즈리얼은 기동성과 사거리가 뛰어나고 카이사는 사거리가 짧은 인파이터형 챔피언이라 W만 맞지 않는다면 난전 대신 대치전을 유도하여 일방적인 딜링 투사 정도는 가능하다. 게임 외적으로 카이사도 이즈리얼 못지않게 라이엇의 사랑을 받는 챔피언인 데다가 LCK, LPL 등에서 주류 픽으로 쓰이는 경향이 많기 때문에 두 챔피언이 전부 상위 티어인 메타도 자주 등장하며 그만큼 맞구도가 굉장히 자주 나오는 편이다."}], "general_counters": ["미스 포츈", "바루스", "징크스", "칼리스타", "트위치", "자이라", "스웨인", "블리츠크랭크", "바드"]}
{"champion": "자이라", "aliases": [], "hard_counters": [{"name": "미스 포츈", "reason": "자이라의 대표적인 카운터. 미포 서폿이 발견된 것 자체가 자이라를 카운터 치기 위해서일 정도다. 설령 지금은 미포 서폿의 체급이 많이 내려갔지만 원딜 미포는 W로 인한 빠른 이속 때문에 논타겟 스킬들을 맞히기 힘들고, 자이라의 식물은 Q의 징검다리로 역이용당하기 쉽다. 또한 기동력이 낮은 자이라는 미포의 E-R 콤보에 휩쓸리기 쉽다."}], "general_counters": ["갈리오", "아무무", "레오나", "마오카이", "블리츠크랭크", "노틸러스", "렐", "벨코즈", "제라스", "흐웨이", "스웨인", "바루스", "진"]}
{"champion": "자크", "aliases": [], "hard_counters": [{"name": "베인(탑)", "reason": "피해량의 대부분이 고정 피해이고, 한 타 때도 선고로 새총 발사를 방해당하기 쉽다. 아군이 베인을 찍어눌러주는 것 외에는 상대할 길이 없다. 게다가 여타 원딜과 달리 탑에도 자주 오며 탄성 주먹에 기반한 스킬 연계를 구르기로 피하거나 거리를 벌릴 수도 있기 때문에 잡기도 상당히 까다롭다. 뽀삐(정글, 서폿) : 새총 발사를 끊을 수 있는 스킬이 W, E, R로 세 가지나 된다. 자크와 달리 초반 교전이 매우 강력하기에 대놓고 카정을 들어와도 아군이 봐주지 않는 이상 자크는 그냥 먹던 정글 몹을 내려놓고 도망쳐야 한다."}, {"name": "알리스타 (서폿)", "reason": "굉장히 짜증나는 상대. 자크의 새총 발사 착지 지점을 보고 Q와 W로 자크의 진입 자체를 차단하는 것이 가능하며, 새총 발사 자체를 캔슬시키는 것도 가능하다. 6레벨 이후에는 잡는 것조차 어렵다."}], "general_counters": ["가렌", "그웬", "다리우스", "모데카이저", "볼리베어", "트런들", "일라오이", "요릭", "우르곳", "클레드", "문도 박사", "신지드", "퀸", "카서스", "케인", "그레이브즈", "렉사이", "킨드레드", "신 짜오", "샤코", "워윅", "엘리스", "판테온", "노틸러스", "쓰레쉬", "잔나", "흐웨이", "드레이븐"]}
{"champion": "잔나", "aliases": [], "hard_counters": [{"name": "소나", "reason": "일반적으로는 후반에 강한 잔나를 상대가 초반에 밟아놔야 하는 입장이지만 소나는 최상급 왕귀형 서포터라서 입장이 반대가 된다. 문제는 라인전에서 한타 단계까지 소나가 성장하는 걸 두고 볼 수밖에 없다. 잔나로서는 도저히 소나를 끊어내기 힘들기 때문이다. 라인전부터 타겟팅인 소나의 Q와 파워코드 때문에 잔나의 이속은 라인전에서 이점이 없으며 게임이 흘러가면 갈수록  풀차징 Q를 소나에게 맞히는 요행을 바랄 수밖에 없어진다. 궁을 서 로 찍은 이후에는, 어설픈 W 견제를 하려다가 소나의 크레센도를 맞 고 궁도 못 쓰고 산화하기 십상이다. 소나의 크레센도는 준즉발이라 빠른 이속만으로는 못 피하기 때문이다. 게다가 소나는 인식과 성능 때문에 하는 사람도 적고 은근 장인챔 성향이 강해서 어중이떠중이들이 하는 게 아닌 이상 상대하기 힘들 가능성이 높다. 대신 크레센도 없이는 생존력이 갱 회피 능력이 답이 없을 정도이므로 소나 상대로 는 라인전에서 정글을 자주 불러 갱이나 다이브 각을 자주 노려보는 것이 좋다. 다만 잔나의 갱호응이나 다이브 능력은 원래부터 유틸 서폿 상대로는 잘 안 통하는 특성을 가진 데다 소나는 플+Q 콤보가 아 닌 이상 이속버프만으로 잔나의 갱호응기인 Q 정도는 피할 수 있기  때문에 안 통할 가능성도 낮지 않으므로 아군 정글이 와주길 기대하 기보단 원딜을 적당히 사리게 한 뒤 로밍으로 푸는 방식도 고려해야 한다. 잔나 스킬셋 특성상 소나에 대한 저항력이 다른 유틸폿에 비해서 심하게 낮아서 소나의 피를 깎아놓기가 어렵기 때문에 너무 어설 프게 정글 콜을 하면 잔나 쪽의 정글 챔프에 따라서 소나 쪽에게 되 레 갱승을 당하거나 역갱을 맞아 더 크게 망할 수도 있다."}, {"name": "카르마", "reason": "매우 힘든 상대. 유틸폿에 취약하다고 평가받는 카르마지만 그건 유지력으로 버텨서 카르마 상대로 라인전을 반반 가면 한타에서 카르마보다 큰 존재감을 발휘할 수 있기 때문이지, 라인전부터 카르마를 이기고 들어간다는 게 아니다. 더군다나 몸도 약하고 견제력과 유지력이 부실한 잔나에겐 더더욱. 라인전이 꽤나  강하기 때문에 상대의 스킬 활용도나 실력의 여하에 따라 숨도 못 쉴 정도로 힘들 수 있다. 여기에 원딜 상성까지 밀리면 라인전이 그야 말로 암담해진다. 물론 유통기한이 있는 편이기 때문에 라인전만 어 떻게든 무사히 넘기면 한타에서 잔나가 더 큰 존재감을 발휘할 수 있다. 다만 그건 유틸폿을 상대로 라인전을 반반 가는 경우에 해당되는 사항이다. 혹여나 카르마 상대로 라인전부터 터져버릴 경우 카르마 의 유통기한은 더욱 늦춰진다."}, {"name": "소라카", "reason": "명실상부한 잔나의 카운터. 유틸폿 중에서도 막강한 견제력과 유지력  두 가지 모두를 가졌기 때문에 매우 힘든 상대다. 또한 원거리 즉발 침묵을 가해 잔나의 스킬 사용을 방해하거나 계절풍을 끊어서 잔나를 바보로 만들어버릴 수도 있다. 게다가 상대가 진입의 의존도가 높지 않은 조합이라면 치감템이 갖춰지기 전까지는 상시 폭발적인 힐로  한타에서 팀의 유지력을 확실히 보조하거나 슈퍼 세이브가 가능한 소라카의 존재감이 더 빛을 발휘할 수밖에 없다. 만약 소라카를 제대로 물거나 잡아줄 만한 챔피언이 부족하다면 게임이 힘들어진다. 치감 이라도 빨리 올려주자."}], "general_counters": ["블리츠크랭크", "쓰레쉬", "노틸러스", "파이크", "베이가", "아무무", "제라스", "벨코즈", "럭스", "자이라", "브랜드", "나미", "유미", "세라핀", "세나", "룰루", "드레이븐", "진", "바루스"]}
{"champion": "잭스", "aliases": [], "hard_counters": [{"name": "하이머딩거", "reason": "라인전에서 이기기가 거의 불가능한 상대 중 하나로 포탑으로 라인을 쭉쭉 밀어서 잭스를 말려버리고 도약 공격으로 들어가면 수류탄을 맞고 라인에서 바로 쫓겨난다. 해결책은 정글러를 부르는 것과 상대 하이머딩거가 수류탄을 무의미하게 뺐을 때를 노리는 것이지만 수류탄을 무의미하게 빼는 하이머딩거는 존재하지 않으며, 하이머딩거는 포탑과 팔목 보호대를 통해 갱을 흘리거나 역으로 갱승을 내기에도 도가 튼 챔피언이라 그마저도 쉽지 않다. 착취의 손아귀+도란의 방패+재생의 바람으로 유지력을 극한까지 끌어올리고 증오의 사슬, 거대한 히드라 등 라인 클리어와 탱킹에 집중한 템트리를 가서 팀 게임을 해야 한다. 라인전을 버틸 자신이 없다면 닷지하는 것이 가장 편하다. 그나마 하이머딩거는 장인 챔피언이라 다른 주류 카운터 챔피언들에 비해 나오는 빈도가 그렇게 흔하지는 않다."}, {"name": "말파이트", "reason": "2012 시즌부터 이어져 온 전통의 하드 카운터. 말파이트는 타겟팅 견제기인 지진의 파편으로 잭스의 부족한 유지력을 건드리지만 잭스는 말파이트의 패시브 충전을 방해할 수단이 없다. 지면 강타의 공속 감소는 후반에도 거슬리며, 잭스가 사이드 운영을 시도하면 말파이트는 곧바로 궁극기를 꼬라박아 강제로 4:5 한타를 개시해 본대를 멸망시킨다. 착취를 들어 쿨이 돌 때마다 뜯어주며 최대한 반반을 가주는 게 핵심이다. 단, 챔프 전체 유지력 버프와 잭스의 리워크 이후로는 꽤 상대하기 편해졌다. 반격에 추가된 체력 비례 마법 피해가 말파이트에게는 꽤 아프고, 궁극기의 액티브 피해 추가뿐만 아니라 궁극기 이후 평타에 마딜이 더 자주 묻어나가기에 말파이트도 잭스를 상대로 예전만한 탱킹을 하지 못한다. 골자는 잭스가 자력으로 말파이트를 뚫어내는 타이밍이 상당히 빨라졌다는 것. 때문에 라인전에서부터 착취의 손아귀를 통해 맞견제를 하면서 압박하는 것이 좋다."}, {"name": "그라가스", "reason": "상대하기 정말 힘든 챔피언으로, 잭스가 상대하기 힘든 아웃복서, 스킬 딜링, 마킹에 용이한 챔피언 셋 모두에 해당한다. 그나마 그라가스는 마나 소모량이 심각 한 편이라 초반부터 대단히 어렵지는 않지만 첫 귀환 이후부터 그라가스가 여신의 눈물을 사운 후 난도가 급격하게 올라간다. 배치기에 도약이 완벽하게 끊겨서 반격 스턴을 맞히기가 엄청 어려워 서 잭스 숙련도가 극단적으로 높지 않은 이상 솔킬을 따는 것은 불가능에 가깝고 라인전 내내 술통 굴리기를 통한 견제에 노출된다. 그라가스는 첫 귀환 후 마나 문제만 어느 정도 해결되면 패시브로 스킬을 돌리며 체력을 계속 회복하기에 유지력이 허약한 잭스 입장에서는 죽을 맛이다. 시간이 지날수록 탱커 겸 AP 브루저인 그라가스보다 평타 기반 딜탱인 잭스가 맞딜에서 더 강해지긴 하겠다만, 그라가스는 시간이 지날수록 E의 짧은 쿨타임을 통한 카이팅에 능해져서 잭스와 맞딜을 절대 해 주지 않는다. Q를 통한 우월한 라인 클리어로 잭스의 사이드에도 내성이 있는 것은 덤. 한타 로 넘어가도 술통 폭발로 변수 창출에 매우 능한 그라가스가 잭스에게 딱히 밀릴 것이 앖다. 라인전에서는 초반을 도방재바로 버티고, 착취를 들어 맞견제를 해야 한다. 헤르메스의 발걸음을 먼저 올리는게 필수고, 2코어로 마최를 가서 강인함을 더 챙기는 것도 방법이다. 그라가스 입장에서도 배치기나 궁극기가 한번 삑나면 위험해질 수 있지만, 싸워주는 것도 도망치는 것도 항상 선택권은 그라가스에게 있어서 뚫기는 매우 힘들다."}, {"name": "뽀삐", "reason": "이쪽은 잭스 장인들에게 카운터를 꼽아보라고 하면 거의 손에 꼽히는 챔피언으로, 망치 강타와 패시브 평타 견제는 매우 아프고 맞딜교를 회피하고 자신의 딜만 넣을 수 있게 해주는 굳건한 태세와 용감한 돌진의 존재로 잭스가 성장하기 매우 힘들게 만든다. 다이브도 쉽게 하는 챔피언인 데다가 탱커라서 방마저가  높아 뚫기도 버겁다. 무기 강화와 궁도 막혀서 잭스의 딜이 체감될 정도로 반감된다."}], "general_counters": ["람머스", "초가스", "카시오페아", "갱플랭크", "나르", "아칼리", "판테온", "블라디미르", "제이스", "케넨", "티모", "문도 박사", "가렌", "럼블", "신지드", "일라오이", "리븐", "탐 켄치", "피오라", "렝가", "드레이븐", "쉔", "퀸", "클레드", "나서스"]}
{"champion": "제드", "aliases": [], "hard_counters": [{"name": "리산드라", "reason": "즉발 광역 속박, 취사 선택이 가능한 타겟팅 기절 or 즉발 무적 궁극기, 느리지만 순간이동 판정을 가진 원거리 이동기라는 스킬 구성상 근접 암살자 챔피언을 상대로 우위를 점하며 제드를 상대로도 강력한 픽으로 꼽힌다. 라인전에선 제드의 딜교환이 더 강하기에 초반 라인전에선 우위를 볼 수 있으니 이때 최대한 이득을 봐야 하고, 제드나 리산드라나 스노우볼링 챔피언이다 보니 초반에 제드 쪽이 우위를 가지면 리산드라가 역전하기는 어려워서인지 실제 승률은 크게 밀리진 않는다. 다만 무난히 한타 페이즈로 가기만 해도 타겟팅 기절 궁극기의 존재로 인해 제드의 플레이메이킹을 거의 완벽하게 봉쇄하는 것이 가능하다"}, {"name": "에코", "reason": "제드 장인들도 명실상부한 카운터로 꼽는 챔피언. 그림자를 섣불리 사용하면 짧은 쿨의 시간 도약으로 예리한 표창을 피한 뒤 제드에게 달라붙어 불리한 근접 딜교환을 강요한다. 심지어 대상 지정 불가+무적+회복+이동기인 시공간 붕괴는 표식이 터질 때, 쓸 때 언제 사용하든 효과적으로 무력화할 수 있는 카운터 스킬이다. 단 피즈와 마찬가지로 초반 라인전 자체는 제드가 우위라 라인킬 확률 자체는 제드가 높고, 현재 에코는 미드보다는 정글을 자주 가기 때문에 미드 에코를 볼 기회는 좀처럼 없다. 게임이 후반으로 가면 에코의 딜이 잘 큰 제드의 딜처럼 상상을 초월해 순식간에 터질 수 있으니 이를 방지할 밤의 끝자락이나 맬모셔스의 아귀를 올리는 게 좋다."}, {"name": "말파이트", "reason": "탱 빌드라면 라인전은 어느 정도 포기하는 게 편하다. 방어력이 엄청나게 높은 말파이트 특성상 제드의 견제는 말파이트가 방템이 없는 첫 귀환 전까지만 유효하고, 그 이후부터는 견제를 아무리 맞혀도 유효타가 들어가지 않는다. 반면 말파이트는 지진의 파편(Q)으로 제드에게 거슬리는 견제를 넣을 수 있어 딜교환이 성립되기 어려우며, 심지어 근접 맞딜도 상당히 강력하기까지 하다. 첫 귀환 전에 최대한 압박해서 CS 차이를 내더라도 말파가 쇠사슬 조끼나 판금 장화 하나만 사오면 그 순간부터 솔킬 내기가 힘들다. 라인전 자체는 카밀, 클레드 같은 하드 카운터들보다는 약간 나을 수 있으나, 조합적인 문제로 미드에 제드가 있는 팀의 경우 탑, 정글, 서포터에 AP를 넣지 않는 이상 딜 밸런스가 AD에 치중될 확률이 높기 때문에 중후반 말파이트의 방어력을 뚫기가 매우 어려운 점이다. 게다가 말파이트는 AP 챔프라 주문력 아이템을 가는 미드 말파이트도 존야를 부담 없이 올릴 수 있어 말파이트가 딜이든 탱이든 말파이트에게 죽음의 표식을 썼다간 궁도 버리고 목숨도 버리게 된다. 한타 능력과 성장 잠재력은 당연히 비교가 안 된다."}, {"name": "레넥톤", "reason": "양떼 도륙(Q) 때문에 라인 유지력이 제드보다 한참 우위고 자르고 토막내기(E)를 통한 무자비한 포식자(W)의 일방적인 딜교환은 상상을 초월하며, 특히 분노가 쌓인 채로 맞게 된다면 그대로 전광판에 가게 될 가능성이 크므로 라인전이 매우 힘들다. 유일한 대처법은 미니언 뒤나 포탑을 허깅하고 주구장창 표창이나 날려대면서 CS를 챙기며 짤짤이 딜을 넣어야 하는데, 첫 번째 목표를 관통한 표창 대미지는 심각하게 감소하므로 레넥톤 입장에선 생채기 수준밖에 되지 않는다. 또한 타 전사형 챔피언들은 대부분 굼뜨기 때문에 어떻게든 반피만 만들어 놓으면 킬각을 잡을 수 있지만, 레넥톤은 체력을 추가로 얻는 강신에 더해 암살자 특유의 폭딜도 갖고 있기에 체력 많이 깎아놨다고 신나서 궁으로 들어갔다간 레넥톤의 강신-무자비한 포식자(강화)-양떼 도륙-자르고 토막내기 콤보에 표창 하나 못 날리고 전광판으로 갈 수 있다. 여러모로 브루저 중에선 이렐리아와 더불어 하드 카운터."}, {"name": "존야의 모래시계&탈진", "reason": "제드가 프로 레벨에서 사장된 이유. 사실상 제드 최악의 하드 카운터라고 해도 과언이 아닌 아이템과 소환사 주문이다. 존야를 뽑거나 상대 서폿이나 미드라이너가 탈진을 장착해서 제드를 마크하기 시작한다면 죽음의 표식(R)은 아예 없는 스킬이 된다. 궁 발동 직후에 쓰든, 돌진한 제드에게 스킬 한두 번 정도 날리고 나서 표식이 터지는 타이밍에 쓰든, 어느 쪽이든 제드의 폭딜이 반 이상 깎이기 때문에 킬각을 완전히 망치고 역공까지도 노릴 수 있다"}], "general_counters": ["피즈", "블라디미르", "트린다미어", "애니비아", "럼블", "다이애나", "이렐리아", "오공", "판테온"]}
{"champion": "제라스", "aliases": [], "hard_counters": [{"name": "이렐리아", "reason": "헬퍼 켜도 질 가능성이 있는 최악의 카운터. 거리를 주는 순간 E를 통해 제라스의 도주 경로를 막은 뒤 묶어놓고 패기 시작한다. 제라스의 스킬은 선딜레이 잠깐 사이에 3번은 나가고도 남을 Q 난사로 회피당하며, 실력이 되는 이렐은 헬퍼가 예측해서 스킬을 써줘도 그 선딜 사이에 피해버린다."}, {"name": "피즈", "reason": "헬퍼 켜도 못 이기는 챔프 1. 짧은 쿨타임의 Q와 E로 접근과 회피가 매우 자유로워 이를 바탕으로 상황 대처 능력이 떨어지는 제라스에게 공격적으로 압박을 넣을 수 있고, 차징하느라 속도가 느려진 제라스에게 피즈의 궁극기는 매우 치명적이며, 사이드에서 만나면 성장이 아무리 차이가 나던간에 스킬을 전부 피하며 솔킬을 낼 수 있을 정도로 극단적인 상성이다. 6렙 이후부터 끝까지 완벽한 하드 카운터."}, {"name": "카타리나", "reason": "헬퍼 켜도 못 이기는 챔프 2. 이동기가 단발성이 아니기에 킬을 주게 되면 꽤 까다로운데, 카타리나가 나온 게임은 높은 확률로 상대가 머리를 박는 난전 양상으로 흘러가고, 이런 난전 상황에서는 제라스가 압도적으로 불리하므로 패배할 가능성이 높다."}, {"name": "블리츠크랭크(서폿)", "reason": "그야말로 최악의 카운터. Q로 일단 끌리면 사실상 살아남을 가능성은 제로라고 보면 된다. 라인전에서 아무리 패도 블리츠크랭크는 은근 단단해서 대미지를 거의 입지 않으며, Q 차징 중에 느려지는 이동 속도 때문에 블츠의 그랩각이 잘 잡힌다. 밴시를 띄우면 한결 편해진다."}], "general_counters": ["다이애나", "르블랑", "이렐리아", "제드", "카타리나", "탈론", "아리", "나피리", "에코", "카사딘", "노틸러스", "레오나", "말파이트", "아무무"]}
{"champion": "제리", "aliases": [], "hard_counters": [{"name": "칼리스타", "reason": "라인전이 엄청나게 센 데다 이리저리 무빙을 치며 카이팅하기 때문에 Q를 맞히기도 힘들다. 이 때문에 상대가 어지간히 말리거나 컨트롤이 딸리는 게 아닌 이상 비슷한 성장 수준일 때 제리가 칼리스타를 이기는 건 무리다. 칼리스타가 싫어하는 CC기도 제리는 갖고 있지 않아 아군에게 의존해야 한다. 그나마 후반을 가면 제리가 훨씬 유리하다."}, {"name": "드레이븐", "reason": "기본적으로 비관통 논타겟인 Q와 W로는 칼리스타처럼 무빙샷에 능통한 드레이븐을 견제하기 힘들고, 제리는 가진 CC기가 둔화뿐이라 변수를 창출하기도 힘들다. 어떻게든 비벼보려고 E로 다가가면 드레이븐도 맞E로 밀어내고 다시 평타를 날리기 때문에 안 들어가는 것만 못하는 상태가 되는 건 덤. 그나마 사거리로 우위라도 점할 수 있다면 모르겠지만 드레이븐은 제리보다 평타 사거리도 더 길고 평타가 주력이라 제리와 달리 상대가 미니언을 끼고 있다고 공격을 못 맞힐 걱정을 할 필요도 없다. 거기다가 패시브의 보호막 때문에 기본적인 유지력이 저열하게 설계된 제리로서는 같은 성장성이라도 원딜 최상위권 스탯을 가진 드레이븐에게 스탯에서 불리할 수밖에 없다. 특히 드레이븐은 물몸 딜러를 따고 돈을 벌어서 굴리는 데 특화되어 있는데 제리 본인도 물몸 딜러라 이에 해당한다는 게 문제. 덤으로 드레이븐은 장인 챔피언 중 하나인 만큼 유저들의 전체적인 숙련도 또한 높은 편이기 때문에 고랭크 게임에서 제리의 후픽으로 드레이븐이 나온다면 그냥 닷지하는 게 이로운 수준이다."}, {"name": "트리스타나", "reason": "드레이븐보다 더하면 더했지 덜하지 않는다. 앞점프 각을 한번 준다면 죽을 각오를 해야 한다. 스탯도 원딜 상위권을 달리는 판국에 제리의 물몸으로는 맞딜은커녕 트리스타나의 앞점프 풀콤보의 미친 화력을 절대 버틸 수 없으며, 제리는 트리스타나를 억제할 하드 CC기도 보유하고 있지 않다. 심지어 다른 원딜과 달리 기동력까지 갖춘지라 제리가 E로 도망가려고 해도 로켓 점프로 추격이 가능하다. 후반을 가면 제리가 더 좋긴 하지만, 트리스타나도 후반 포텐은 꽤 괜찮다."}], "general_counters": ["루시안", "바루스", "미스 포츈", "케이틀린", "진", "애쉬", "트위치", "야스오", "소라카", "브랜드", "자이라", "제라스", "직스", "스웨인", "바드", "말파이트(탑)", "아리&바이(미드 정글)"]}
{"champion": "제이스", "aliases": [], "hard_counters": [{"name": "오공", "reason": "대표적인 제이스의 카운터. 제이스의 강점인 견제에도 크게 개의치 않고, 좋은 갱 호응과 아이템이 나올수록 제이스가 이기기 힘든 구조. 1레벨부터 오공이 근두운 전사(E)로 돌진하여 평타질을 냅다 갈겨대기만 해도 제이스의 피통이 거덜 날 정도로 초반부터 제이스를 영혼 끝까지 압박할 수 있다. 싸우면 싸울수록 체젠과 방어력이 증가하는 패시브 때문에 라인전부터 스플릿까지 굉장히 상대하기 힘들다. 또한 게임 중후반 스플릿 상황에서도 일반적인 제이스가 오공을 뚫기는 힘들며 역으로 오공의 파쇄격(Q)에 두들겨 맞아 강제로 귀환하는 경우가 더 많다. 한타 또한 제이스의 장기인 장거리 포킹으로 갉아먹고 시작하려 해도 오공의 포킹을 뚫어내고 강제로 이니시를 거는 능력은 말파이트에 비견될 정도로 무척이나 뛰어나기 대체적으로 오공이 더 높고 파괴적이다. 정 제이스로 오공을 상대하게 되었다면 첫 귀환 아이템으로 덤불 조끼를 사보자."}, {"name": "그라가스", "reason": "첫 귀환 전에는 그라가스의 마나 소모가 제이스보다 더 크기 때문에 제이스가 주도권을 쥘 수 있고 실제로 그라가스가 이 타이밍에 같이 딜교하려고 하면 그라가스의 마나가 먼저 바닥나서 제이스가 압박이 가능하다. 그러나 이 타이밍을 지나서 마순팔이 쌓이고 여눈이든 양피지 하위템이든 마나 관련 유지력 세팅이 갖춰진 순간부터는 이기기 상당히 어려워진다. 원거리 견제는 그라가스도 가능하며 몸통박치기로 제이스의 천둥 강타를 너무 쉽게 카운터칠 수 있다. 게다가 그라가스는 스킬 가속 위주의 아이템을 구비하므로 레벨이 오를수록 그라가스의 스킬 쿨타임만 짧아져서 똑같이 딜교하면 선공권은 그라가스에게 생긴다. 유지력 차이도 커서 똑같이 딜교해도 그라가스만 체력을 비축할 수 있는 것은 덤. 거기에 갱 호응까지 좋아서 제이스에게 언제든지 갱 압박도 가능한 하드 카운터. 탱 빌드도 까다롭고, 딜 빌드면 더더욱 까다롭다. 플레이가 정직한 말파이트 등의 탱커들에 비해 그라가스는 굉장히 다재다능한 챔피언이라서, 프로 경기에서도 제이스의 카운터로 자주 선택받는다."}, {"name": "말파이트", "reason": "제이스가 초반에 딜교를 빡세게 하고 경험치 디나이를 한 뒤 AP 정글러와 빅웨이브 다이브를 성공하면 이길 수는 있다. 하지만 숙련도가 높은 말파이트는 이런 경우 경험치도 포기해가며 사리고, 정글이 서로 개입하면 제이스가 급격하게 불리해지게 되며, 결정적으로 동성장해도 방관이 제대로 갖춰지지 않은 게임 중반에 제이스가 말파이트를 쉽게 뚫을 수가 없다. 말파이트도 라인 클리어가 준수해 스플릿도 힘들고 한타도 밀리기 때문에 제이스가 방관이 갖춰지는 후반까지 어떻게든 버텨내거나 초반에 성장 차이를 크게 벌리지 않는다면 35:65 수준으로 굉장히 불리하다. 유성을 채용하는 말파이트일 경우 4레벨 이후 날아오는 Q 견제가 제이스의 캐논 폼 견제보다 훨씬 아프게 들어오며, 이렇게 체력이 반피까지 깎이면 궁극기를 맞고 죽는데다 견제를 안 당해도 상대 정글러가 오면 그냥 죽으며 라인전을 이겼다 해도 한타에서는 말파의 궁극기 때문에 망한 말파가 잘 큰 제이스보다 유용하다. 견제 능력이 약한 착취 말파이트여도 보호막 강타와 착취, W의 높은 방어력 때문에 첫 귀환 이후 해머폼으로 진입했다간 오히려 손해를 보기에 매우 불리하다."}, {"name": "탐 켄치", "reason": "리워크 전이나 후나 상대하기 매우 어려운 하드 카운터. 유지력이 마오카이나 문도 박사는 저리 가라 할 정도인 데다 혀 채찍(Q)의 맞견제는 물몸인 제이스가 감당하기 어렵다. 킬 결정력이 약하던 리워크 전과는 달리 심연 잠수(W)라는 돌진기가 생겼기 때문에 킬 각 잡히기도 쉬워서 여러모로 힘든 상성."}, {"name": "트린다미어", "reason": "라인킬 확률이 70:30에 육박하고 게임 승률도 크게 밀리는 하드 카운터. 그나마 초반에는 제이스가 주도권을 잡을 수 있으나 라인 유지력이 좋은 트린다미어에게 유의미한 피해를 입히기는 힘들며, 6레벨 이후부터는 트린다미어가 들어올 때마다 킬 각이 잡히기 때문에 쉽사리 라인을 밀 수 없다. 특히 유체화 트린다미어의 경우 제이스가 해머 폼 E로 한 번 밀어내도 바로 다시 들어와서 킬 각을 잡을 수 있기 때문에, 작정하고 제이스를 물어 죽이면 유체화 쿨마다 죽는 그림이 나오기도 한다. 중후반에도 사이드에서 마주치면 살아남는 것 자체가 기적일 정도. 라인전에서 최대한 사린 뒤 트린을 피해 다니면서 성장하면 한타 기여도에서는 우위를 점할 수 있지만, 한 번만 실수해도 성장 자체가 힘들어진다."}], "general_counters": ["마오카이", "문도 박사", "사이온", "뽀삐", "오른", "자크", "초가스", "올라프", "루시안", "이렐리아", "렝가", "요릭", "그레이브즈", "야스오", "클레드", "니비아", "말자하", "신드라", "벡스", "르블랑", "빅토르", "카시오페아", "제라스", "아지르", "흐웨이"]}
{"champion": "조이", "aliases": [], "hard_counters": [{"name": "모르가나", "reason": "대표적인 하드 카운터. 라인 클리어가 매우 빠르며 조이의 핵심인 헤롱헤롱쿨쿨방울을 칠흑의 방패(E)로 막아낼 수 있는 까다로운 상대이다. 맞라인을 서게 된다면 라인 클리어 속도가 월등히 차이가 나기 때문에 미니언만 받아 먹어야 한다. 생존기가 부실한 조이는 모르가나의 어둠의 속박(Q)에 맞으면 생존하기 어려우며, 함부로 궁극기를 썼다간 돌아오는 포탈 쪽에서 속박을 맞기 쉽다. 미드 모르가나는 비주류 픽이지만 상대 서포터로 만나게 된다면 한타나 대치 구도에서 상대에게 수면 방울을 맞혀도 졸음에 걸리지 않으므로 매우 거슬리는 상대이다."}, {"name": "말자하", "reason": "조이의 하드 카운터 2호. 매우 빠른 라인 클리어 능력으로 조이가 스킬을 맞힐 각을 내주지 않는다. 게다가 조이의 통통별과 수면 방울을 패시브 혹은 공허충으로 막아낼 수 있으며, 스킬 딜 위주인 조이에게 말자하의 침묵은 대단히 성가시다. 또 궁극기로 생존기가 부실한 조이를 위협할 수 있다. 라인전에서 우위를 점하기도 힘들고, 한타 기여도도 말자하가 훨씬 우위에 있어서 매우 힘든 상대다."}, {"name": "제드", "reason": "암살자 중에서도 최악의 상대. 조이는 기동력이 좋은 암살자와 라인 클리어가 빠른 챔피언, 조이의 스킬을 피할 수 있는 챔피언 상대로 약한 모습을 보이는데 제드는 세 가지 유형에 모두 해당하는 최악의 상대다. 3렙 이후에는 미니언 뒤에 숨어서 그림자를 이용해 일방적으로 조이를 괴롭힐 수도 있고, 라인 클리어 능력도 암살자 중에서 최상위권이기에 조이가 딜교 각을 내주지 않으면 빠르게 라인을 지우고 로밍으로 다른 라인을 압박할 수 있다. 실제로도 라인 승률 지표 모두 제드가 우위에 서 있다. 팔목 보호대-> 존야의 모래시계를 필히 사두자."}, {"name": "브라움(서폿)", "reason": "대회에서도 조이를 선픽하면 후픽 서포터로 자주 나오는 상대다. 불굴(E) 하나로 조이의 모든 포킹을 원천 차단하기 때문에 까다로운 편인 데다가 물몸 서포터도 아니고 탱포터라 쉽게 녹지도 않는다. 불굴(E)의 쿨타임도 E의 쿨타임과 비슷하기 때문에 골 때리는 편."}], "general_counters": ["야스오", "제라스", "트위스티드 페이트", "이렐리아", "다이애나", "카사딘", "르블랑", "나피리"]}
{"champion": "직스", "aliases": [], "hard_counters": [{"name": "루시안, 베인, 카이사", "reason": "대회에서 바텀 직스의 카운터로 고려되는 원딜들이다. 직스의 저지선을 손쉽게 돌파하고, 강력한 순간 폭딜로 암살각을 볼 수 있다. 또한 팀적으로 한타 개시에 유리한 조합을 짰다면 직스가 포킹할 기회도 주지 않은 채 원딜을 포함한 모든 팀이 돌진해서 직스가 바라는 구도를 분쇄해 버린다."}, {"name": "야스오", "reason": "전통적인 하드 카운터. 동실력의 야스오를 만날 경우 라인전 단계에서 최대한 사리면서 야스오와 CS 차이가 몇십 개 이상 벌어지는 것은 각오해야 한다. 바람 장막과 질풍검에 모든 일반 스킬들이 카운터당해 야스오의 파밍을 눈 뜨고 지켜볼 수밖에 없고, 직스는 야스오의 공세를 피하느라 CS를 여러 개 놓치게 되기 때문이다. 강철 폭풍을 최대한 피하고 질풍검 방향을 보면서 지뢰를 깔아 야스오의 패시브를 무력화시키면서 접근을 회피하고 갱각을 재야 한다."}], "general_counters": ["노틸러스", "블리츠크랭크", "레오나", "알리스타", "아무무", "제드", "이렐리아", "사일러스", "카사딘", "카타리나", "탈론", "요네", "르블랑"]}
{"champion": "진", "aliases": [], "hard_counters": [{"name": "시비르", "reason": "바텀 원딜들 중에서는 제일 힘든 상대. 주문 방어막에 핵심 CC기인 살상연희의 속박이 막히며, 라인 클리어 속도도 빠른 데다 스킬을 통한 교전 사거리까지 시비르가 완전히 우위이다. 진은 라인전 강캐이고 시비르는 라인전 약캐이지만 이마저도 사거리와 푸시력으로 메꿀 정도이다."}, {"name": "야스오", "reason": "마나와 재장전을 들고 있는 진은 야스오의 라인 푸시를 감당할 수 없고, 가뜩이나 느린 공속 때문에 포탑에 박히면 먹기 힘든데 장막으로 방해까지 한다. 4타와 유탄으로 견제구를 날려도 패시브 보호막에 상쇄되고, 진의 모든 공격이 장막에 막히기 때문에 바텀 2대2 교전이나 한타에서는 이득을 보려야 볼 수가 없다. 평타가 장막에 막히면 패시브 치명타 이속도 못 받는 건 덤. 장막이 빠진 상태에서 하드 CC로 잘 묶여 있다면 특유의 압도적인 화력으로 단번에 제압할 수 있긴 하지만 아군의 지원이 없다면 답이 없는 상대."}, {"name": "하드탱커", "reason": "진의 단발 화력은 강력하지만 일반적인 게임에서 탱템을 두른 탱커는 진이 어떻게 하더라도 4발 안에는 결코 처리할 수 없다. 또한 재장전이 주는 지속 화력 면의 약점과 치명타 효율 손해 때문에 진이 잘 크더라도 탱커 처리 기대치는 확실히 떨어지는 편이다. 탱커를 4발 안에 죽이는 것은 그 탱커가 어지간히 망해서 탱템이 부실하거나 아예 정신줄을 놓고 극딜 트리를 가지 않는 이상 불가능하다."}, {"name": "판금 장화", "reason": "사실 진에게 있어 최악의 카운터는 탱커 수준이 아니라, 판금 장화 그 자체다. 판금 장화는 기본 공격에 기반해 무한한 잠재력을 지닌 AD 챔피언들의 초월적인 딜량을 1초라도 더 버텨내기 위해 존재하는 아이템이다. 그런데 진은 기본 공격에 기반하면서도 딱히 필요 이상의 딜을 뽑아내는 챔피언이 아니라, 딱 필요한 딜만 뽑는 챔피언이라는 점이 문제다. 판금에 달린 방어력과 평타 딜 12% 감소는 원래라면 딱 필요한 만큼만 뽑아내는 진의 딜 패턴을 완벽하게 차단하여, 진의 존재 가치를 거의 없는 수준으로 떨굴 수 있다. 심지어 이속 격차와 초반 4타의 확정 치명타로 라인전부터 이득을 쌓아 올리는 진의 승리 플랜에 있어 코어템에 비해 가격이 싼 신발이라는 특성 탓에 상대 서포터가 판금 장화 하나 먼저 뽑아 오기만 해도 진은 매우 답답해진다."}, {"name": "제어 와드(번외)", "reason": "체력이 진의 탄창과 같은 4칸이라 탄창이 하나라도 비어있으면 혼자 부수기 위해 재장전까지 해야 하고, 탄창이 꽉 차 있어도 공속이 느려서 혼자서 부수기 매우 힘들다. 그래서 유저들은 '진의 하드 카운터는 제어 와드'라는 우스갯소리를 한다. 심지어 6.9 패치 이전에는 체력이 5칸이라 한 탄창으로 제거하는 게 아예 불가능했다."}], "general_counters": ["루시안", "트리스타나", "칼리스타", "레오나", "노틸러스", "알리스타", "블리츠크랭크", "아무무"]}
{"champion": "질리언", "aliases": [], "hard_counters": [{"name": "소라카", "reason": "질리언의 대 소라카 승률은 47.4%로 하드 카운터 중 하나. 침묵 장판을 좋은 타이밍에 깔아서 시간 역행으로 부활한 적을 속박시킬 수 있으며 시한폭탄의 어쭙잖은 딜 따윈 어마어마한 힐량으로 덮어버린다. 자력 탈출기가 없고 물몸인 특성으로 인해 라인전에서 거리 조절을 못할 경우 오히려 질리언의 EQWQ에 전광판을 볼 수도 있지만 동실력일 경우 소라카가 견제력과 유지력이 우위이기 때문에 라인전을 밀리는 경우가 더 많으며 무난하게 후반을 가도 한 명 부활시키는 것에 그치는 질리언과 달리 적 전원이 죽지 않는 압도적인 유지력 차이가 나게 된다."}, {"name": "사일러스(미드)", "reason": "질리언 장인들도 인정한 질리언 최악의 하드 카운터. 질리언의 콤보인 Q - W - Q 따위는 시전 시간이 뻔히 보이기 때문에 도주로 잽싸게 피하면 그만이며 방어 능력이 부실하고 이동기 하나 없는 질리언은 사일러스의 진입과 폭딜에 손쉽게 녹아내린다. 그리고 가장 답이 없는 건 질리언의 핵심 스킬인 궁극기를 사일러스가 훔쳐서 사용할 수가 있다는 점. 가뜩이나 생존기가 뛰어난 사일러스인데 부활까지 갖추게 되면 절대로 잡아낼 수가 없다. 주 라인이 달라 마주칠 일은 드물다는 게 위안이지만 가급적이면 밴을 하는 게 정신건강에 이롭다"}], "general_counters": ["레오나", "노틸러스", "블리츠크랭크", "아무무", "쓰레쉬", "벨코즈", "제라스", "럭스", "이즈리얼", "시비르", "사미라", "바루스", "케이틀린", "진"]}
{"champion": "징크스", "aliases": [], "hard_counters": [{"name": "트위치", "reason": "징크스가 승률상 꾸준히 크게 지고 들어가는 챔피언이다. 트위치는 징크스보다도 라인전이 약하고 성장 난도가 높지만, 징크스로는 트위치를 충분히 억제하기 힘들다. 그런데 이렇게 무난하게 성장을 했을 경우, 한타 파괴력에서 게임 끝까지 징크스를 압도하는 몇 안 되는 원딜이 바로 트위치다. 즉, 트위치는 징크스 상대로 나왔을 경우 상위 호환으로 작동한다. 더군다나 생존기가 부실한 징크스는 트위치의 암살 위협에 계속 노출되기 십상이다."}], "general_counters": ["드레이븐", "루시안", "미스 포츈", "트리스타나", "바루스", "애쉬", "케이틀린", "진", "제라스", "럭스", "벨코즈", "흐웨이", "멜", "세라핀", "블리츠크랭크", "쓰레쉬", "파이크", "노틸러스", "스웨인(서폿)"]}
{"champion": "초가스", "aliases": [], "hard_counters": [{"name": "베인", "reason": "구르기로 파열을 쉽게 피하며, 원거리 챔피언이라 라인전을 지는데 은화살의 높은 체력 비례 고정 피해로 인해 한타도, 1대1도 승산이 없다. 거기다 포식은 시전 모션 도중에 베인이 은신하면 취소되고, 베인이 실수해 가까이 붙어도 선고 때문에 밀려나는데 반대로 초가스가 실수하면 바로 끝까지 추격당해 빈사 상태가 되거나 죽는다."}, {"name": "문도 박사", "reason": "뼈톱은 높은 양의 현재 체력 비례 피해를 가해서 툭툭 던져도 너무 아픈데, 포식 스택을 쌓은 후라면 몸집이 너무 커져서 피하는 것이 사실상 불가능하다. 거기다가 하나밖에 없는 CC기인 파열의 에어본을 패시브로 막아버릴 수 있고, 궁극기가 즉시 회복으로 바뀌어서 리메이크 전에도 껄끄러운 상성이었는데 리메이크 이후에는 답이 없는 상성이 되었다."}, {"name": "피오라", "reason": "초가스의 주력 스킬은 전부 선딜레이가 굉장히 크기 때문에 피오라가 응수로 막기 매우 쉽고, 굳이 응수가 아니더라도 패시브의 이속 증가와 이동기인 찌르기로 기동성이 매우 뛰어나기 때문에 파열을 맞히고 제대로 된 딜교환을 하기가 매우 어렵다. 이와 더불어 강력한 체력 비례 고정 피해로 흡혈로 유지력도 뛰어나서 탱 초가스의 대표적인 카운터로 꼽힌다"}, {"name": "세트", "reason": "라인전부터 노코스트에 강력한 맞딜 능력으로 초가스를 압박하기 때문에 불리하다. 거기에 기본적으로 체력 능력치가 좋고 패시브의 체력 재생 때문에 라인 유지력도 높은데다, 강펀치의 쉴드로 초가스의 스킬 피해를 흡수하기 때문에 원거리 견제로 체력을 깎고 원콤 내는 것도 잘 성립되지 않는다. 결정적인 문제점으로 세트의 궁극기인 대미 장식은 사용한 대상의 추가 체력 계수를 가지고 있는데, 초가스는 포식의 체력 계수 활용을 위한 높은 체력 아이템과 포식 스택으로 매우 높은 체력을 확보하기 때문에 대미 장식의 딜이 엄청나게 강해져 버린다. 이 때문에 한타에서 초가스한테 사용한 궁극기가 아군 진영에 작렬한다면 매우 높은 광역 물리 피해와 함께 아군 진영이 박살나버리며, 트런들과 더불어 초가스의 존재 자체를 유리하게 역이용할 수 있기 때문에 아무리 실력에 자신 있어도 세트 상대로는 픽하지 않는 편이 좋다."}], "general_counters": ["칼리스타", "아칼리", "그웬", "럼블", "케인(다르킨 학살자)", "릴리아", "스몰더", "오로라", "다리우스", "올라프", "모데카이저", "트런들", "크산테", "클레드", "아트록스", "볼리베어", "나서스"]}
{"champion": "카르마", "aliases": [], "hard_counters": [{"name": "마오카이", "reason": "서폿 마오카이의 성능이 올라오면서 답 없는 상성이라고 할 수 있는 승률을 보여준다. 초반 푸시와 견제는 카르마가 우위이지만, 타겟팅인 마오카이의 W 거리를 절대 허용해서는 안 되며, 줄타기로 초반 이득을 봐놓아도 마오카이의 플W 갱 호응 한 방에 모든 것이 무너지고 유통기한이 즉시 찾아온다. 핵심 CC를 피해볼 여지가 있는 다른 서포터들과는 달리 방법이 없다."}, {"name": "유미", "reason": "모든 유틸폿 중에서도 쉴드량이 매우 뛰어난 편에 속하기 때문에 슈우우웅(E)과 너랑 유미랑(W)을 필두로 한 보호막과 유지력을 선마하는 유미는 카르마 단독으로 뚫기가 매우 어렵다. 카르마도 유틸폿에 가까운 만큼 스스로 상황을 만드는 능력이 뛰어나지 않고 다이브 능력도 뛰어나지 않아서 유미 상대로 애먹는 부분이 많은 것이 문제. 후반 밸류도 유미가 훨씬 높고 이쪽도 꽝 붙는 싸움보다는 지속전에 능한 데다가 만트라 의존도가 높은 카르마와 달리 자체적인 쉴드량이 매우 높고 쿨타임도 짧아서 라인전이 지나면 카르마의 상위 호환 수준으로 변모한다."}], "general_counters": ["블리츠크랭크", "노틸러스", "파이크", "라칸", "소나", "룰루", "소라카", "나미"]}
{"champion": "카밀", "aliases": [], "hard_counters": [{"name": "레넥톤", "reason": "일단 코어템이 나오기 전까지 라인전에서 기본 스펙 차이가 너무 크게 나기 때문에 딜교환이 성립이 안 된다. 안 그래도 딜교 방식부터 시작해서 카밀에게는 답이 안 나오는 상성이었는데 9.14 패치로 강화 W에 쉴드 파괴가 생기면서 카밀의 패시브를 무시하고 폭딜을 때려넣을 수 있게 되면서 완벽하게 극악의 상성이 되었다. 분노 쌓는 것을 견제하는 것도 불가능하고, 함부로 W를 쓰면 바로 들어와서 순식간에 딜교해버리고 튀어버린다. 스킬이 3개 다 찍히기 전에 레넥톤은 굉장히 약하기 때문에 1~2레벨에 갈고리를 찍고 패 놓아야 그나마 할 만한데, 레넥톤 입장에서는 이때 싸워 줄 이유가 없다. 물론 성장 포텐은 카밀이 더 높기 때문에 라인전에서 무난하게 버티면서 삼위일체 등이 나오면 상성이 반대로 역전되긴 하지만, 레넥톤은 다이브에 특화된 챔피언이라서 격차가 나기 시작하면 멈출 수 없다. 레넥톤의 E가 빠지거나 카밀에게 궁극기가 있을 경우, 갱을 불러 처리하고 나대지 말아야 한다. 이 과정에서도 정글러의 체력이 애매하면 오히려 2대1도 잡아먹히는 것이 가능하기 때문에 정글러의 상태가 애매하면 부르지 않는 것이 좋다."}, {"name": "볼리베어", "reason": "리메이크 전부터 카밀 담당 일진으로 유명했던 픽. 리메이크 이전에는 갈고리 발사(E)를 끊으면서 압도적인 순간 폭딜로 카밀을 참교육하는 곰으로 악명 높았으며, 리메이크된 지금은 그냥 체급에 찍어 눌린다. 이전보다 지속딜이 훨씬 강해진 지금, 패시브만 믿고 함부로 들어가면 그대로 확정 기절에 당해 점멸이 빠질 확률이 매우 높다. 그나마 6레벨 이전에 갱킹을 통해 킬을 내면 숨통이 트이긴 하지만, 딱 거기까지다. 6레벨이 되면 또다시 카밀이 불리해지며, 이때부터는 갱킹을 잘못 부르면 2대1도 질 수 있다."}, {"name": "일라오이", "reason": "2017시즌의 최전성기 시절부터 거론되어왔던 전통적인 카운터. 견제 사거리부터가 차이가 나서 시작부터 얻어맞는다. 그리고 갈고리로 들어가면 회피기가 없으니 E를 맞기 쉽고, 맞아서 영혼이 뽑히면 딜교가 성립이 안 되므로 선진입도 힘들다. 게다가 일라오이의 궁극기는 상대가 많을수록 더 강해지기에 갱킹을 부르면 더블 킬만 바칠 뿐이다. 일라오이의 E를 갈고리로 피하고 빗맞혔을 때를 노려 진입해야 한다. 다만 일라오이 입장에서는 먼저 E를 쓰지 않아도 딜교를 이기기 때문에 정말 힘들다."}], "general_counters": ["그라가스", "블라디미르", "제이스", "뽀삐", "쉔", "아칼리", "잭스", "하이머딩거", "티모", "베인", "오로라", "크산테", "그웬", "다리우스", "리븐", "모데카이저", "문도 박사", "피오라", "세트", "신 짜오", "오공", "우르곳", "트런들", "워윅", "판테온", "탐 켄치", "나르", "카시오페아"]}
{"champion": "카사딘", "aliases": [], "hard_counters": [{"name": "탈론", "reason": "6레벨 전까지는 근거리 뚜벅이인 카사딘의 특성상 W 2타-Q 콤보에 노출되기 쉽고, 물몸인 카사딘의 특성상 저 콤보를 한 번만 허용해도 원거리 미니언은 꿈도 못 꾼다. 6레벨 이후에도 탈론이 저 콤보에 그림자 공격까지 곁들이면 순조롭게 우물로 칼퇴하는 카사딘을 보게 된다. 다만 Q와 점멸 말고는 별다른 진입기가 없다는 탈론의 특성상 균열 이동으로 정반대 방향으로 도망가기만 해도 그림자 공격을 피하기는 쉬운 편이며, 암살자의 길 때문에 녹턴과는 정반대로 벽을 넘는 짓은 하지 않는 게 좋다. 탈론의 특성상 궁극기를 찍고 아이템이 반 코어 정도 나오면 라인은 대충 밀고 무한 로밍을 가는 경우가 많은데, 기동성은 비등하다고 쳐도 전투력이 허약한 카사딘은 탈론의 로밍을 절대 따라잡을 수 없다. 이때 탈론이 없다고 안일하게 라인을 당기고 파밍하고 있으면 다른 라인에서 미드 차이를 외칠 가능성이 100%다."}, {"name": "트리스타나", "reason": "라인전 극상성이다. 폭발 탄약(E)을 맞고 평타 3대만 맞아도 바로 반피가 나가며, 타 매치업은 그래도 타워를 끼고 CS를 받아먹을 수 있지만 트리스타나는 타워를 끼는 순간 빠르게 채굴한다."}], "general_counters": ["제드", "키아나", "요네", "나피리", "갱플랭크", "아크샨", "루시안", "제이스", "가렌", "아트록스", "레넥톤", "세트", "판테온", "클레드", "카밀", "나서스"]}
{"champion": "카서스", "aliases": [], "hard_counters": [{"name": "마스터 이", "reason": "하드 카운터. 초반부터 후반까지 힘든 상대로, 카서스의 궁극기를 알파와 명상으로 손쉽게 씹을 수 있다. 또한 일대일 구도로 만났을 때 고통의 벽으로 거리를 벌리려 해도 알파와 궁극기로 따라붙고, 물몸에다가 뚜벅이인 카서스를 순식간에 도륙 내버리고 난 뒤 패시브 영역을 유유히 빠져나간다. 마이와의 일대일 구도를 최대한 피하되, 높은 한타 기여도와 교전 능력으로 게임을 풀어나가는 것이 핵심."}], "general_counters": ["녹턴", "판테온", "신 짜오", "케인", "니달리", "아이번"]}
{"champion": "카시오페아", "aliases": ["카시"], "hard_counters": [{"name": "베이가", "reason": "카시오페아가 싫어할 요소를 거의 다 가진 챔피언. 카시는 이동기가 하나도 없는 뚜벅이이며 교전 거리도 베이가가 더 길다. 초반에 매우 약한 챔피언이지만 주력 스킬의 사거리가 길기 때문에 싸움을 회피하면 그만인데다, W의 고정 CC는 이동기가 없는 베이가에겐 별로 치명적이지 않고, E의 광역 CC는 라인전에서도 갱 때문에 성가시고 한타에서도 사거리가 짧은 카시오페아에겐 치명적이며, 딜을 적당히 버텨내고 싸우는 스타일의 카시오페아를 폭딜로 없애버린다."}, {"name": "빅토르", "reason": "카시오페아의 스킬셋을 노골적으로 카운터친다. 빅토르의 죽음의 광선(E)은 시전 딜레이 및 경직이 아예 없는 무빙 캐스팅이 있고, 궁극기 혼돈의 폭풍은 한번 시전한 이후 적을 자동으로 추적한다. 힘의 흡수(Q)를 카시오페아에게 시전하려 할 때 석화를 걸 수는 있으나, 빅토르 입장에서는 죽음의 광선으로 견제할 수 있는데 굳이 Q를 쓰러 위험하게 카시오페아의 사정거리 안에 들어갈 필요가 없다. 그 외에도 힘의 흡수(Q) 마저도 선딜레이가 짧으며, 신발을 못 사고 이동기조차 없는 카시오페아에겐 중력장(W)도 심히 부담스럽다. 실제로 카시오페아는 라인전이 약하다고 소문난 빅토르에게도 라인킬 확률이 밀리는 극소수의 챔피언이다. 이러한 끔찍한 상성을 이겨내고 압도적인 실력으로 찍어 눌러 딜교를 이길 수 있다고 해도 사거리가 더 긴 빅토르 입장에선 안 싸워주면 그만이다. 그렇다고 후반 한타를 보자니 빅토르는 후반 포텐셜이 뛰어난 왕귀챔이다."}, {"name": "아칼리", "reason": "최악의 하드 카운터. 카시오페아는 논타겟을 맞힌 뒤 원거리 딜러처럼 지속딜을 하는 뚜벅이 챔피언이며, 이동기가 많으며 원거리 딜러를 카운터치는 아칼리는 스킬 구조상 극상성이다. Q, W, R이 논타겟이지만 정작 딜을 넣는 핵심 스킬인 쌍독니(E)는 타겟팅이라 장막에 대처하기가 힘들며, 이동기와 이속 증가로 Q를 다 피하고 Q를 맞히면 장막에 숨으며 궁을 맞혀도 2초 만에 죽이지 못하면 장막에 숨어 후속 딜이 봉쇄된 뒤 역관광 당하거나 도망가는 것을 막지 못한다. W를 기막히게 깔아도 아칼리가 맞W를 쓰면 후속 딜이 불가능하며, 장막에 있는 상태에서 궁을 맞혔다면 그대로 은신한다. 6렙 전에 약하므로 강하게 견제하고 6렙 이후는 거리를 주지 않는 게 중요하지만 카시의 E보다 아칼리의 R 사거리가 더 길기에 아칼리를 만날 시 스왑하는 경우를 종종 볼 수 있다. 야스오는 여러 번에 걸쳐 천천히 들어오지만 아칼리는 한 번에 진입하기에 W나 궁극기로 쳐내기가 어려우므로 아칼리는 가급적 밴을 하는 게 낫다. 혹시나 만났다면 다대다 교전에서는 아칼리 입장에서도 진입이나 후퇴를 방해하는 독기의 늪(W)과 하드 CC기인 궁극기를 가진 카시가 까다로워지므로 최대한 포탑에서 시간을 벌자."}, {"name": "제라스", "reason": "하드 카운터. 그냥 열심히 미니언 밖으로 무빙해서 푸시와 딜교를 동시에 할 수 없게 만들고, 맞푸시를 하는 수밖에 없다. 이속 느린 뚜벅이들 패라고 나온 챔피언인데 카시는 신발도 못 사므로 완전히 답이 없다. 그나마 상대법은 포킹이 약한 극초반에 승부를 보든가, 제라스가 앞으로 Q를 차징하고 있을 때 냅다 궁플을 쓴 후 그대로 죽여버리는 것."}], "general_counters": ["야스오", "피즈", "아크샨", "르블랑", "제드", "벨코즈", "직스", "오리아나", "럭스", "탈리야", "흐웨이", "신드라", "애니비아", "그웬", "판테온", "올라프"]}
{"champion": "카이사", "aliases": [], "hard_counters": [{"name": "코그모", "reason": "메타픽에서 밀려난 지 오래라서 자주 만나진 않지만, 카이사 전성기가 되면 대회에서 카운터픽으로 한 번씩 등장하곤 하는 챔피언이다. 교전 사거리 630~710이라는 카이사는 범접도 못할 거리에서 카이사를 호되게 패주며, 맞딜한다고 밀리지도 않는다. 서폿이 먼저 CC기를 덮으면서 표식을 스택해주는 경우가 아니면 카이사가 스킬 다 뒤집어씌우면서 표식을 터뜨려도 간당간당할 정도. 후반까지도 어설프게 킬각을 보려고 날아갔다가는 무지막지한 DPS에 역으로 잡아먹힐 수 있다. 하지만 카이사가 선호되는 돌진 메타와 조합 자체에는 매우 취약한 챔피언이기도 해서, 코그모의 팀 전체가 그런 환경에 충분히 대응하지 못하는 경우 후벼파이다가 끝나기도 한다."}, {"name": "드레이븐", "reason": "일단 나오면 앞e는 원천 봉쇄된다. 드레이븐의 평타 딜은 도끼를 돌리고 있다면 1렙부터 다른 원딜 평타 딜 2배이기에, 쌍도끼 드레이븐은 맞딜 깡패로 유명한 그 루시안조차도 맞딜로 이겨버린다. 즉, 함부로 딜교를 걸려고 들어가면 되려 드레이븐 도끼에 머리만 쪼개진다. 더욱이 안 좋은 건, 드레이븐이 상대하기 힘든 원딜들은 자체 하드 CC기가 있거나, 팔이 길어서 드레이븐을 압박하기 쉽다는 특징이 있는데, 카이사는 이 중에서 어느 것도 해당되지 않는다. 오히려 드레이븐이 상대하기 편한 원딜들의 특징인 라인전이 수동적이거나, 순간 후퇴기가 없거나, 팔이 짧아서 견제를 못하거나, 드레이븐을 묶을 CC기가 빈약하거나 아예 없다는 것에 카이사는 이 모든 것이 해당된다. 게다가 드레이븐은 패시브 덕택에 킬을 내는 순간 눈사태급의 스노우볼을 굴리는 챔프여서, 킬을 한두 번이라도 내줬다가는 드레이븐이 e스킬만 맞혀도 카이사는 드레이븐 특유의 말도 안 되는 킬각에 죽어버린다. 그나마 매우 고난도의 챔피언이라 하는 유저가 적어 만날 일이 많지는 않다. 반대로 말하면 만났을 경우 장인일 확률이 높다는 뜻이기도 하다."}], "general_counters": ["사미라", "미스 포츈", "애쉬", "루시안", "케이틀린", "바루스", "브랜드", "스웨인", "노틸러스", "레오나", "블리츠크랭크", "알리스타", "아무무", "쓰레쉬"]}
{"champion": "카직스", "aliases": [], "hard_counters": [{"name": "렉사이", "reason": "예전에는 어떤 방법이든 거리를 줬다간 돌출의 에어본을 시작으로 콤보 딜량 + 물어뜯기의 고정 피해 + 자객의 발톱의 추가 피해에 연약한 카직스가 사라지는 경우가 있어 하드 카운터로 불렸지만, 거듭된 조정과 메타가 변화한 뒤로는 카직스 입장에서 맞딜에 대한 부담은 그나마 줄었다. 문제는 그러고도 모든 스킬셋이 카직스를 카운터친다는 것으로, 시야를 밝혀 은신을 강제하는 Q와 에어본이라는 최상급 CC기, 그로 인한 막대한 한타 기여도, 진동 감지로 전부 보이는 위치, 선입력에 성공하면 은신을 무시하고 쫓아가는 궁극기, 카직스를 압도적으로 찍어누르는 초반 라인 개입 능력과 리워크 이후로도 여전히 강력한 맞딜까지 그야말로 카운터 요소로 온 몸을 떡칠한 수준이라 카직스의 카운터 중에서는 꾸준히 까다로운 편이다."}, {"name": "녹턴", "reason": "녹턴 유저가 좀 친다면 극상성이다. 우선 녹턴은 리 신, 렉사이 등의 최상위 육식형 정글러들도 혼자서 싸잡아 먹는 정신 나간 챔피언이라 카직스라도 승리를 보장하지 못하며, 고립 딜이 미치긴 하나 카직스의 가장 중요한 딜링기인 Q를 장막으로 씹어버리면 순식간에 가장 큰 딜링기를 잃어버리고 역으로 녹턴은 공속이 빨라져 체급이 더 우위에 있기 때문에 1 vs 1은 거의 녹턴이 이긴다고 봐야 된다. 또 E의 공포의 지속 시간은 피들스틱 다음으로 긴 2.25초나 되는 데다가, 카직스가 E로 튀려고 할 때 타이밍을 잘 맞춰 점멸을 쓰면 공포를 그대로 맞아 위태로워진다. 가장 큰 문제는 카직스 운영의 핵심인 궁극기의 은신을 볼 방법이 2개나 있다는 것. Q는 카직스가 궁극기를 써도 자국이 남아 카직스를 따라오며, E는 계속 박히는 줄이 남아서 은신이 풀리면 공포를 맞는다. 성장성도 카직스에 비해 밀리지 않고, 한타도 둘 다 애매해 사실상 힘든 상성이다."}], "general_counters": ["바이", "올라프", "워윅", "판테온", "벨베스", "트런들", "리 신", "케인(다르킨 학살자)", "우디르", "문도 박사", "뽀삐", "누누와 윌럼프", "자크", "세주아니"]}
{"champion": "카타리나", "aliases": ["카타"], "hard_counters": [{"name": "판테온", "reason": "극강의 하드카운터 1호. 만날 시에  지옥도가 열린다. 라인전은 단순한데, 가까이 가면 혜성의 창(Q)로  견제하고, 카타리나의 Q로 견제하려 해도 거리 조절을 잘못하면 방호의 도약(W)로 시작하는 풀콤을 맞는다. 6렙 이후엔 W로 섣부르게 들 어오지 않는 대신 먼저 라인을 밀고 로밍가버리고, 카타리나가 따라 가서 교전에 집중하려 해도 판테온은 진입한 카타리나를 곧바로 W로 포커싱 가능한데다 W가 없어도 E로 딜을 막아낸다. 메이지 챔피언 상대하듯 먼저 라인을 버리고 가는 행동은 절대 하지 말 것. 판테온이 궁극기로 따라오는 순간 게임이 터진다. 이 구도는 게임 처음부터 끝까지 전혀 달라지지 않으며, 판테온이 주문포식자, 그리고 상위템을 올리는 순간 1대1은 변수 없이 무조건 지는 하드카운터다. 카타리나 장인들도 밴하라고 말하는 최악의 상대이다."}, {"name": "레넥톤", "reason": "극강의 하드카운터 2호. 판테온과 스킬셋이 유사하여 비 교 대상이 되는데 판테온 이상으로 힘들다. 2번 사용 가능한 자르고 토막내기(E)가 있어 기동력도 카타리나에게 밀리지 않으며 어중간한 Q 견제는 양떼 도륙(Q)으로 회복하고 들어가면 무자비한 포식자(W)의 타겟팅 기절로 맞고 시작하니 이길 재간이 없다. 심지어 다이브도  아주 좋아서 포탑허깅을 해도 상대 정글이 보이지 않으면 CS 근처도 가기 어렵다."}, {"name": "갈리오", "reason": "극강의 하드카운터 3호. 미드든 서포터든 여러모로 골치아픈 상성. 궁 없이는 듀란드의 방패(W)의 보호막을 까는 것이 고작이며 하드 CC기는 3개에 빠르게  발동하는 스킬이 2개라 카타리나의 궁극기를 끊기 쉽고 화력도 준수 한 편이다. 심지어 준 글로벌 궁극기 때문에 카타리나보다 교전 합류도 더 빨라서 로밍으로 푼다는 선택지도 틀어막는다. 그나마 궁 사용중이 아니라면 갈리오의 스킬들은 굼떠서 순보로 쉽게 피할수가 있다는게 위안이다."}, {"name": "세트", "reason": "대부분의 근접암살 자들의 하드카운터로 라인전에선 체젠이 높아 카타리나의 Q 견제가  의미가 없으며, 안면강타에 끌리기라도 하면 2대8딜교를 당하기에 미니언 앞에 서있는 세트를 상대로 할 수 있는 게 없다. 카타가 궁을  돌리면 대미장식, 안면강타로 곧바로 끊을 수 있고 일부러 맞다가 안면강타로 CC를 넣고 확정 w 고정딜을 줄 수도 있어 가렌과 비슷하게 상대하기 정말 까다롭다. 세트의 한타가 대단하진 않지만 카타리나는 세트가 목표 근처에 서있기만 해도 0인분이고, 세트가 카타를 무시 하고 포탑을 철거해도 전혀 막을 수 없다"}, {"name": "잭스", "reason": "하드 카운터. 단검 투척(Q)을 제외한 카타리나의 모든  스킬은 온힛 효과라서 잭스가 반격을 켜면 쥐똥만한 Q딜을 제외하고 는 딜 을 아예 넣을 수가 없다. 카타리나는 초반 라인전이 허약한 잭 스보 다도 초반이 약한데다 반격에 모든 딜링 수단이 다 막혀서 잭스 의  성장을 막을 도리가 없고, 잘 큰 잭스는 잘 큰 카타리나보다 교전이 더 좋기 때문에 시간이 가면 갈수록 더 밀린다."}, {"name": "람머스(정글)", "reason": "궁 켜면 회색화면을 보게 해주는 궁 봉인 챔피 언. 기본적으로 단단한 편에 속하는 챔피언인데 궁극기를 끊어버리는 스킬이 2개나 존재한다."}], "general_counters": ["애니비아", "리산드라", "카시오페아", "블라디미르", "가렌", "트린다미어", "나서스"]}
{"champion": "칼리스타", "aliases": ["칼리"], "hard_counters": [{"name": "애쉬", "reason": "사거리 긴 뚜벅이 중 가장 힘들다. 일단 W의 광역 슬로우가 너무 거슬린다. 게다가 1대1 상황에서는 사거리 차이가 무려 75인데 평타로도 슬로우를 쉽게 걸기 때문에 오히려 칼리스타를 하루 종일 카이팅한다. 라인 클리어랑 맞딜도 초반부터 상당히 세다. 칼리스타의 패시브 도약으로는 애쉬 궁의 거대한 투사체를 피하기도 쉽지 않다. 후반 딜 기댓값과 유틸성 모두 애쉬 쪽이 훨씬 높기 때문에 라인전에서 우위를 점해야 하는데, 그게 쉽지 않다. 심지어 최근에는 애쉬가 서포터로 나오는 경우도 있는데 이러면 애쉬가 원딜과 다르게 CS를 먹지 않고 딜교에 집중할 수 있기에 초반부터 애쉬에게 강하게 얻어맞을 수도 있다. 여러모로 어느 포지션에서 나오든 껄끄러운 상성. 그나마 서포터와 합이 잘 맞으면 뚜벅이인 애쉬를 물어 죽이는 게 충분히 가능할 수 있어 불리한 상성 구도를 뒤집을 수 있는 여지는 있다."}], "general_counters": ["코그모", "케이틀린", "세나", "드레이븐", "말파이트(탑)", "뽀삐(탑)", "나서스(탑)", "이렐리아(탑)", "오공(탑)"]}
{"champion": "케넨", "aliases": [], "hard_counters": [{"name": "제이스", "reason": "필밴 1순위 케넨이 AD던 AP던 상당히 고생하게 되며 물몸인 케넨에게 제이스의 가속 + 전격 폭발 콤보는 초반부터 상당히 아프고, 맞견제도 제이스가 난입을 들고 오면 사실상 어렵다. 궁극기를 통해 일기토를 하려고 해도 망치로 쳐내는 건 덤. 완벽에 가까운 거리 조절과 함께 모든 스킬을 다 맞히고 제이스의 공격을 버텨낸다면 어느 정도 상대가 가능하다. 특히 AP 케넨의 경우 전투 지속력이 상당히 안 좋은 편이라 같이 성장해도 케넨이 일방적으로 라인에 묶여버릴 가능성이 높다. 초반에 체력 손실을 최소화해야 하며, 포탑 골드를 어느 정도 뜯기더라도 라인을 프리징당해서 말라 죽는 일이 없도록 해야 한다. AD 케넨의 경우 같이 성장했다면 DPS 차이로 제이스를 1:1에서 누를 수 있지만, AP 케넨이라면 5:5 한타 외에는 선택지가 없으므로 제이스가 사이드를 돌 여건을 주지 않으면서 한타를 유도해야 한다."}, {"name": "올라프", "reason": "숨겨진 극 하드 카운터. 나서스와 마찬가지로 극초반만 유리하고 그 이후로는 내내 케넨이 불리한 상대이다. 케넨의 견제는 광포한 공격에 붙은 평타 흡혈로 금방 복구해 버리고, 케넨은 올라프의 도끼 한 방만 맞아도 곧바로 도망가야 한다. 그리고 올라프가 궁극기를 배운 다음부터는 케넨이 올라프의 도끼에 맞는 순간 케넨의 기절과 궁극기는 다 씹히고 곧바로 다이브를 당해서 킬을 헌납하기 십상이다."}, {"name": "카르마", "reason": "숨겨진 케넨의 슈퍼 하드 카운터로 유지력, 라인전, 포킹 모두 카르마가 압도한다. 게다가 케넨은 엄청난 유리몸이기 때문에 카르마의 R-Q 콤보를 도무지 버틸 수가 없고 카르마는 갱킹도 쉽게 회피할 수 있다는 것도 골치가 아프다. 그나마 호재는 한타인데 카르마는 한타에서도 높은 보호막으로 딜러들을 보호해 주기 때문에 라인전과 한타 모두 힘든 상대다."}, {"name": "말파이트", "reason": "하드 카운터 논타겟팅인 표창은 미니언 뒤에서 피해주면 될 뿐더러 적군 미니언을 톡톡 쳐줌으로써 Q 유성 짤 심리전을 유발하는 말파이트는 부담스럽다. 말파이트가 미니언을 체력이 바닥인 미니언을 치려고 앞으로 무빙해주면 Q평 패시브를 터뜨려주는 것도 쉽지 않다. 그나마 AP 빌드로 가면 마법 피해에 취약하다는 점을 파고들 수 있어서 편해진다."}], "general_counters": ["라이즈", "빅토르", "카시오페아", "갱플랭크", "문도 박사", "블라디미르", "초가스", "나서스", "요릭", "스웨인", "그라가스", "오른", "사이온", "오공", "에코", "이렐리아", "판테온", "사일러스", "모데카이저"]}
{"champion": "케이틀린", "aliases": ["케넨"], "hard_counters": [{"name": "애쉬", "reason": "초반부터 후반까지 케이틀린을 악착같이 괴롭힐 수 있는 전통의 하드 카운터. 기본 사거리가 600으로 케이틀린과 차이가 크지 않으면서 기본 공격과 W에 묻어나는 슬로우 때문에 케이틀린이 사거리를 이용한 이득을 보기 어렵다. 슬로우에 발이 묶여 맞딜을 하게 되면 DPS는 상대도 되지 않는다. 반반을 가더라도 중반에는 유틸성이 좋은 애쉬가 한타에서 활약하기 훨씬 좋고, 후반에도 왕귀력 자체는 케이틀린이 앞서지만 강제 이니시가 가능한 애쉬는 케이틀린이 좋아하는 압박 플레이를 카운터 칠 수 있다. 케이틀린이 1티어에 오면 자연스럽게 애쉬도 1~2티어로 올라오는 일이 있을 정도"}], "general_counters": ["바루스", "진", "미스 포츈", "세나", "시비르", "야스오", "브라움", "아무무", "블리츠크랭크", "쓰레쉬", "레오나", "파이크", "노틸러스", "브랜드", "벨코즈", "럭스", "자이라", "카르마", "제라스", "말파이트(탑)"]}
{"champion": "케인", "aliases": [], "hard_counters": [{"name": "리 신", "reason": "리신은 대중적인 픽률이 매우 높은 챔피언이므로, 이 문서를 읽고 있는 당신이 케인을 직접 플레이해보게 될 때, 인게임에서 가장 흔하게 만나게 될 가능성이 가장 높은 하드 카운터 챔피언이다. 리신의 챔피언 자체 승률은 좋은 편은 아니라고 알려져 있기는 하지만 케인은 훨씬 더욱 사정이 좋지 않으며, 챔피언 자체의 초반 성능도, 유틸리티도 모두 리신이 훨씬 앞선다. 케인이 느린 정글링 속도 때문에 고생하는 사이 리신의 갱킹에 아군 라이너들이 하나하나 죽어 나가고 상대팀이 잘 크게 된다면 케인이 온갖 고생 끝에 변신을 하고 아이템을 어느 정도 뽑아온다고 쳐도, 리신의 활약과 강력한 중반 전투력, 그리고 온갖 딜방템, W의 보호막 등으로 무장한 끈질긴 생명력, 그리고 리신이 보유한 온갖 유틸리티는 케인의 그러한 변신한 고생을 하이리스크 로우 리턴으로 만들어버린다. 다르킨 학살자로 변신했을 경우, 리신을 1대1로 이길 기회는 있기는 하지만, 리신을 플레이하는 사람도 다 생각이 있는 사람이지 바보가 아니다. 리신은 와드 방호, 궁극기로 쫓아오는 상대 걷어차기 등 도주기 요소가 많은 챔피언이라 케인과 순순히 스탠딩 맞다이를 해줄 이유 따위는 없으므로 도망치면 그만이며, 물론 게임이 극단적으로 후반까지만 가게 된다면 리신을 케인이 단순 무식한 1대1로는 이길 수는 있기는 하지만, 리신은 애초에 케인과 같은 하이리스크 로우 리턴형 챔피언에게 초중반부터 가혹하게 압도해 찍어 누르며 이익을 챙기는 스노우볼링형 챔피언이지 그런 식으로 후반을 바라보고 게임하는 챔피언이 전혀 아니다. 그 후반까지 가기도 전에 이미 케인이 속한 팀의 패배로 게임이 끝날 위험이 크다."}, {"name": "마스터 이", "reason": "대표적인 케인의 담당 일진. 초반 마스터 이의 일대일 능력은 육식 정글러들 수준으로 강력한 편이라 같은 성장형 챔피언임에도 케인이 지고 들어가며, 변신 이후라고 해도 크게 다르진 않다. 케인이 W를 써 봐야 마스터 이는 일격 필살(Q)로 대미지를 줌과 동시에 간단하게 회피하며, 궁극기로 발악을 해도 명상(W)으로 피해를 최소화시킨다. 이렇게 모든 주요 스킬들을 다 쓰고도 별다른 피해조차 입히지 못한 케인은 그대로 마스터 이의 빠른 공속+높은 고정 피해가 섞인 지속딜에 죽음을 맞는 신세다. 아무리 극딜 템트리를 간 다르킨 학살자가 브루저 중 일대일이 가장 강력한 챔피언이라 해도 마스터 이가 스킬을 다 맞아주지 않는 이상 절대로 마이를 이기지 못한다. 애초에 스킬 상성부터, 지속딜부터 불리하기 때문에 케인으로는 거의 이기기 불가능한 챔피언이다."}, {"name": "렉사이", "reason": "예전에는 어떤 방법이든 거리를 줬다간 돌출의 에어본을 시작으로 콤보 딜량 + 물어뜯기의 고정 피해 + 자객의 발톱의 추가 피해에 연약한 카직스가 사라지는 경우가 있어 하드 카운터로 불렸지만, 거듭된 조정과 메타가 변화한 뒤로는 카직스 입장에서 맞딜에 대한 부담은 그나마 줄었다. 문제는 그러고도 모든 스킬셋이 카직스를 카운터친다는 것으로, 시야를 밝혀 은신을 강제하는 Q와 에어본이라는 최상급 CC기, 그로 인한 막대한 한타 기여도, 진동 감지로 전부 보이는 위치, 선입력에 성공하면 은신을 무시하고 쫓아가는 궁극기, 카직스를 압도적으로 찍어누르는 초반 라인 개입 능력과 리워크 이후로도 여전히 강력한 맞딜까지 그야말로 카운터 요소로 온 몸을 떡칠한 수준이라 카직스의 카운터 중에서는 꾸준히 까다로운 편이다."}, {"name": "뽀삐", "reason": "케인 장인들도 인정하는 카운터. 스킬셋 하나하나가 케인을 카운터 치기 매우 좋게 짜여져 있다. 뽀삐의 굳건한 태세(W)만으로 케인의 E와 Q가 전부 차단당함과 동시에 스킬이 끊겨버린다. 또한 뽀삐의 벽을 동반한 EQ평W평 콤보의 화력과 CC기가 동반되는 콤보를 맞으면 거의 생사를 오갈 수준으로 체력이 엄청나게 깎인다. 기본적으로 방어력과 마법 저항력이 높은 탱커인 만큼 그림자 암살자로는 아무리 스킬 콤보를 박아넣어봐야 뽀삐에게 기스 하나 못 낸다."}, {"name": "샤코", "reason": "상대하기 매우 화나는 카운터. 샤코에게 근접하여 W를 날리려고만 해도 은신+순간이동 스킬로 간단하게 회피하며 도망가버리기 때문이다. 게다가 샤코가 여기저기 깔아놓는 박스를 밟을 경우 아무것도 못 해보고 사망할 수 있는 위험도 크다. 그림자 암살자는 성능 좋은 이동기와 CC기를 골고루 가진 샤코를 암살하기 어려우며, 다르킨 학살자 역시 샤코의 공포 박스를 잘못 밟으면 빌빌거리다가 죽을 위험이 높고 싸움이나 한타 이후 적은 체력 상태에서 귀환을 하는 것조차 안전하게 하지 못한다. 서포터 AP 샤코든, 정글러 AD 샤코든 그냥 챔피언의 존재 자체가 케인 유저의 머리를 아프게 한다."}, {"name": "카이사(원딜)", "reason": "원거리 챔피언들 중 케인이 가장(그림자 암살자/다르킨 학살자 모두) 극단적으로 불리한 상성 중 하나로, 무조건 밴해야 한다. 고성능 이속 증가기인 E로 케인의 W를 엄청나게 쉽게 회피해버리며 폭딜과 궁극기의 보호막으로 반격을 가한다. 카이사가 성장이 되면 될수록 특히나 케인이 엄청나게 심하게 불리한데, 몸이 약한 그림자 암살자는 카이사의 엄청난 지속 폭딜에 딜링에 빠르게 그냥 녹아버릴 위험이 크며, 다르킨 학살자의 사정 역시 딜방템을 얼마나 많이 갖추었든 그림자 암살자와 크게 다를 바 없이 카이사의 미친 후반 딜링에 그냥 아예 녹는 신세가 된다."}], "general_counters": ["우디르", "엘리스", "그레이브즈", "녹턴", "킨드레드", "키아나", "정글 제드", "니달리", "릴리아", "벨베스", "비에고"]}
{"champion": "케일", "aliases": [], "hard_counters": [{"name": "퀸", "reason": "초반이 약한 모든 챔피언들의 하드 카운터. 6레벨 이전까지 케일은 근접 챔피언인데 이때 기본 능력치도 상당히 부실한 케일이 CS라도 건드리려고 하다가는 퀸에게 콤보를 전부 얻어맞고 빈사 상태가 되거나 스펠이 빠지는 건 기본이며 프리징에 무한 디나잉에 걸릴 가능성이 높다. 또한 케일이 어찌저찌 CS를 받아먹는다고 쳐도 로밍을 가는 퀸을 막을 방법은 전무하다. 압박을 버티면서 후반을 바라보기에는 퀸의 스노우볼링이 너무나도 빠르다"}, {"name": "그웬", "reason": "이전에는 꽤 유리한 면이 있었지만, 이젠 그냥 대놓고 케일의 극카운터인 챔피언. AP 챔프라 대미지는 엄청 아픈데 Q 스킬 중앙을 절대 피할 수 없는 케일이라 초중반 구간은 100% 밀리고, 6렙 이후여도 궁극기의 둔화로 계속 케일에게 압박을 가할 수 있다. 게다가 그 면상 때문에 그웬이 W를 켠 4초간은 케일이 아무것도 할 수 없는 것은 덤이다."}, {"name": "렝가", "reason": "상대 승률 44%의 최악의 하드 카운터. 나중에 가면 누굴 노릴지 어느 정도 예측이 가능해 암살자 중에서 케어하기 편한 타입이지만 같은 라인에서 만나면 도약 때문에 라인전 자체를 넘기는 것부터 어렵다. 케일 특유의 빈약한 스펙과 형편없는 유지력으로는 렝가의 도약 공격을 감당할 수 없다. 실수로 미는 라인이라도 형성했다가는 경험치도 먹지 못할 정도로 라인전이 터져버린다. 그렇게 라인전에서 큰 이득을 본 렝가는 궁극기를 활용하여 다른 라인에 적극적으로 개입해서 케일이 성장하기 전에 게임을 터뜨려버린다."}], "general_counters": ["나서스", "블라디미르", "카시오페아", "요릭", "레넥톤", "ㅡ이렐리아", "아칼리", "아트록스", "올라프", "잭스", "클레드", "판테온", "트린다미어", "탐 켄치", "티모", "요네"]}
{"champion": "코그모", "aliases": [], "hard_counters": [{"name": "트위치", "reason": "서로 뚜렷한 장단점과 약점을 가지고 있고 그 장단점 중 겹치는 부분도 약간은 있는 편이다. 탱커 처치 능력은 코그모의 손을 조금 더, 한타와 암살/딜러 제거 등에서는 트위치의 손을 크게 들어주는 편이다. 사거리 차이가 꽤 있기 때문에 라인전 선공권은 코그모가 잡고 있지만 코그모는 순간 폭딜이나 CC가 강력한 원딜은 아니기 때문에 트위치로서도 독약 병(W)으로 코그모의 앞무빙을 차단하고 독 스택이 쌓인 코그모에게 오염(E)을 시전함으로써 딜교환 시도를 받아칠 수 있고, 생체마법 폭격의 재사용 대기시간 동안엔 힘이 없는 코그모의 특성상 선공이 흐지부지하게 끝나면 트위치에게 자유 시간을 허용할 수밖에 없다. 무리하다가 트위치에게 킬이라도 내주게 되면 코그모가 킬을 먹는 것 이상으로 트위치의 스노우볼링이 굴러간다. 한타나 사이드 운영에서도 트위치가 훨씬 유리하다. 코그모는 사이드에 있을 때 항상 트위치의 은신·궁극기 암살 시도를 의식해야 한다. 특히 정보 공유가 제한적이고 돌발 행동이 판치며, 조합의 완성도를 기대하기 어려운 솔로 랭크 환경에서는 위장을 이용한 트위치의 능동성이 더 부각될 수밖에 없다. 이를 방지하려면 서포터와 코그모 자신이 주변 시야를 철저하게 확보하고 가급적 뭉쳐다니며 단체로 트위치를 의식해야 한다. 한타에서의 파괴력도 궁 켠 트위치가 코그모보다 한 수 위이다. 한타가 탱커 일점사 형태로 진행되거나, 트위치의 궁극기를 빼놓고 싸울 수 있거나, 상대의 이니시 및 CC가 빈약해서 코그모가 W 돌 때마다 앞무빙을 칠 수 있는 매우 한정적인 조건이 아닌 한 코그모는 트위치의 캐리력을 못 따라간다."}], "general_counters": ["케이틀린", "바루스", "드레이븐", "닐라", "야스오", "직스", "제라스", "럭스", "흐웨이", "레오나", "블리츠크랭크", "알리스타", "파이크"]}
{"champion": "코르키", "aliases": [], "hard_counters": [], "general_counters": ["칼리스타", "케이틀린", "야스오", "제라스", "자이라", "브랜드", "블리츠크랭크", "레오나", "알리스타"]}
{"champion": "퀸", "aliases": [], "hard_counters": [{"name": "마오카이", "reason": "상대 승률 42%의 하드 카운터픽. 다른 돌진기와 달리 뒤틀린 전진(W)은 공중제비로 막아내는 게 불가능한 게 문제로, 마오카이의 약한 초반을 공략할 수 있을 것처럼 보여도, 마오카이가 1레벨에 여진 룬 + 부패 물약 + 뒤틀린 전진(W)을 찍고 들어오면 퀸이 딜교환을 지는 기현상이 발생한다. 난입을 채용한 마오카이는 아예 퀸이 공중제비(E)로 반격할 기회조차 주지 않고 이속으로 유유히 빠져나간다. 라인 푸시 능력도 마오카이가 더 좋고, 한타 존재감 역시 마오카이가 압도적으로 우위에 서 있기 때문에 퀸 입장에서 빠른 합류 속도와 잘라먹기로 상대를 방해하는 것이 좋다. 그마저도 실패하면 게임은 마오카이 쪽이 가져갈 확률이 상당히 높아진다. 그나마 메타 변화 및 체급 약화로 마오카이가 탑에 거의 안 온다는 건 안심할 점. 마오카이는 부쉬에 묘목을 심어두는 파이크를 비롯해 그랩폿의 하드 카운터 서포터로 활약하고 있기에 탑에 올라올 틈이 안 난다. 물론 정글로 가더라도 마오카이의 뒤틀린 전진이 타겟팅 속박이기 때문에 물몸인 퀸이 살아가기 어렵기 때문에 탑이든 정글이든 크게 달가운 상성은 아니다."}, {"name": "아트록스", "reason": "라인킬 확률이 60%가 넘어가는 하드 카운터. 아트록스는 다른 브루저와 달리 원거리에서 견제가 가능하고 이동기가 있어서 거리를 내주는 순간 그대로 풀콤보를 맞고 물몸인 퀸은 비명횡사해버린다. 거기에 공중제비 사거리랑 아트록스의 Q 1타랑 같아서 심리전을 잘하는 상대라면 공중제비도 함부로 하면 안 된다. 라인전은 답이 없으니 최대한 사리다가 6렙 이후 궁으로 로밍을 다니며 다른 라인을 터트리는 운영을 하는 것이 답이다."}, {"name": "말파이트", "reason": "슈퍼 하드 카운터. 사거리가 짧은 퀸이기 때문에 말파이트에게 견제를 시도하려 하면 무조건 굴렁쇠의 사거리 안에 들어오게 된다. 대미지도 아프지만 상대를 둔화시키고 본인의 이속을 증가시키기 때문에 후속타를 때리기가 너무나 어렵다. 초반에는 그럭저럭 스킬을 맞아줄 만 하지만, 굴렁쇠의 레벨이 오르면 오를수록 퀸의 낮은 체력과 마법 저항력으로는 대미지 감당이 안 되며, 6레벨 이후에는 덤불 조끼만 뽑아와도 딜교를 지고 굴렁쇠 두세 번 맞으면 솔킬까지 나온다. 딜템을 가는 말파이트도 힘들고, 탱 말파는 더더욱 힘들다. 체력이 60퍼만 남아도 높은 확률로 REW점화(집공)Q에 죽어나간다. 심지어 점멸이 없으면 풀피 킬각도 나온다."}, {"name": "야스오", "reason": "하드 카운터 2호. 퀸이 합류가 더 좋다는 것 말고 유리한 점이 단 한 가지도 없다. 야스오의 바람 장막(W)에 평타와 W가 전부 막히고, 공중제비(E)로 진입을 끊어봤자 질풍검(E)을 통한 라인전에서 야스오의 기동력은 이렐리아와 비슷하거나 그 이상이기 때문에 계속 쫓아온다. 대인전, 소규모 교전, 후반 전부 조합이 잘 갖춰져 있다면 야스오가 훨씬 좋다. 특히 후반에 에어본에 잘못 맞으면 최후의 숨결(R)에 당하고 스펠이 없다면 대부분 그 자리에서 죽는다. 야스오가 상대라면 라인전을 포기하고 로밍과 합류로 이득을 보면서 팀적인 플레이로 게임을 굴려야 한다."}, {"name": "카밀", "reason": "하드 카운터 3호. 카밀은 현재 어지간한 탑 유저들이 다 연습할 정도로 출현율까지 높아서 사실상 현 메타의 탑 퀸의 최악의 난적이다. 카밀이 하드 카운터인 이유는 바로 갈고리 스킬의 판정. 카밀의 갈고리 판정이 퀸의 공중제비 판정보다 우위이기 때문에 카밀이 갈고리로 들어오는 것을 막아보겠다고 공중제비로 맞대응하면 그대로 딜교환이 망하고 도륙난다. 또한 궁극기에 갇혔다면 빠져나올 방법이 없기에 죽었다고 생각하자. 갈고리의 판정이 공중제비 판정보다 우위라는 점 하나 때문에 6레벨 전에도 편하게 압박이 불가능하며, 카밀의 패시브로 인해 때릴 거 다 때리고 빠지는 카밀을 추격해도 딜교환 이득을 생각보다 크게 보지 못한다."}, {"name": "이렐리아", "reason": "하드 카운터 4호, 1대2도 가능할뿐더러 딜을 상쇄시키기 한다. 말파이트, 아트록스보다 위험한 상대, 밴 대상 1순위. 말파이트나 카밀 상대로는 6레벨 전에 솔킬이라도 안 당할 수는 있다. 그러나 이렐리아 상대로는 6렙 전부터 버티기도 뭐도 안 된다. 2단에서 멈추지도 않고 3단 이상 돌진이 가능한 이렐리아 상대로 공중 제비는 아무 짝에 쓸모없는 스킬에 불과해진다. 다만, 이렐리아가 돌진하는 타이밍을 잘 맞춰서 6렙 전까지 타워에서만 버티는 것도 한계가 있고 그나마도 이렐리아는 다이브에도 능해서 정글만 부르면 가볍게 킬을 내버리기 때문에 퀸이 거의 필수로 밴해야 하는 챔피언이다."}], "general_counters": ["나서스", "사이온", "럼블", "오른", "요릭", "올라프", "문도 박사", "스카너", "람머스", "클레드", "오공", "렝가"]}
{"champion": "크산테", "aliases": ["크샨테"], "hard_counters": [{"name": "가렌", "reason": "LCK에서 12년 만에 꺼내게 만들었을 정도로 대표적인 카운터 픽이다. 그래도 현재는 크산테의 라인전 체급이 크게 상승해서 전보다 훨씬 할 만해졌으나, 가렌 쪽의 라인전도 절대 약하지 않기 때문에 여전히 만만하게 볼 상대가 아니다. 일단 Q의 침묵으로 크산테의 스킬 사이클을 방해할 수도 있고, W로 크산테의 콤보 딜과 기절 지속 시간을 반감시킬 수 있어 어느 정도 버틸 수 있으며, E의 방어력 감소와 정복자 중첩으로 인해서 크산테가 방템을 두르더라도 생각보다 아픈 피해가 들어온다. 특히 궁극기를 찍은 시점을 가장 주의해야 하는데, 자체적으로 내구도를 낮춰버려서 궁 킬각을 쉽게 잡힐 우려가 생기기 때문이다. 1대1 상황이야 크산테 쪽이 체급으로 찢어 죽이는 상황이 나오겠지만, 한타에서는 크산테를 간단히 척살할 수 있어서 매우 까다롭다. 따라서 확실한 기회라고 판단될 때 신중히 사용해야 한다. 라인전 구도에서는 6레벨 전까지 크산테가 엔토포 타격으로 짤짤이를 넣다가 딜교를 못 참은 가렌이 들어오면 발놀림으로 뺄 수 있기 때문에 6레벨 전 라인전 딜교는 크산테의 우위다."}, {"name": "피오라", "reason": "크산테의 Q는 피오라가 찌르기로든 응수로든 반응하기 쉽고, W의 돌진을 피오라 쪽으로 사용하는 것은 아예 응수로 기절시켜달라고 갖다 바치는 꼴이다. 기본 스킬셋부터 껄끄럽지만 가장 치명적인 것은 대결투와 패시브의 연계. 크산테가 총공세를 사용한 상태에서 피오라에게 총공세가 박히게 되면 실질적인 체력은 반으로 줄어있는데 약점 대미지는 최대 체력을 계산해서 그대로 받기 때문에 피오라가 어지간히 못 큰 게 아닌 이상 표식이 두세 번 터지면 그냥 죽어버린다. 동실력이라면 절대 이길 수 없는 극상성."}, {"name": "그웬", "reason": "그웬이 부진한 성적을 보일 때도 대회에서 크산테를 자르기 위해 꺼내는 극카운터이다. 막 궁극기를 배운 시점에는 AP 챔피언 특성상 그웬의 성장이 완전히 궤도에 오르지 않아 크산테가 조금 유리하지만, 게임이 중반에 접어들면 크산테 입장에서는 막강한 체력 비례 피해와 고정 피해를 모두 가진 그웬을 이길 수가 없다. 후반으로 가면 체력 비례 피해만 5%를 넘어가고 그걸 평타마다 한 번, 스킬마다 3~6번씩 다단 히트로 박아대는 그웬은 도저히 답이 없다. 주문력 챔피언이라 크산테와 잘 맞는 얼어붙은 건틀릿을 올리기도 껄끄럽다."}, {"name": "베인", "reason": "탑 베인일 경우 닷지가 고려되는 상대. 선고를 W로 씹을 수 있는 여지가 있지만 그게 끝이다. E의 접근으로는 결코 베인과 거리를 좁힐 수 없으며, 구르기와 선고로 하여금 근접 챔피언과의 거리 차이를 계속 유지할 수 있으며 탱커들을 무조건 카운터치는 최대 체력 비례 고정 피해로 방어력을 무시하는 딜링이 가능하기 때문에 위의 체력 비례 피해의 비중이 크거나, 마무리 능력이 뛰어난 챔피언에도 해당된다. 베인이 멍청하게 거리를 내주는 것이 아니면 절대 극복할 수 없는 상성이다."}], "general_counters": ["가렌", "우르곳", "다리우스", "요릭", "뽀삐", "바루스", "리븐", "케인(다르킨 학살자)", "암베사", "릴리아", "제리", "스몰더", "그레이브즈"]}
{"champion": "클레드", "aliases": [], "hard_counters": [{"name": "피오라", "reason": "최악의 하드 카운터. 클레드의 높은 체력을 약점의 최대 체력 비례 고정 피해로 깎아내리며, 덫날리기를 피하기도 쉬운데다 설령 맞더라도 응수로 대응하면 그만. 특히 응수를 덫을 씹는 데 사용하지 않더라도 높은 공속 감소 때문에 클레드의 딜이 반의반 토막 나버리고, 결국 스킬 하나의 존재만으로 영영 주도권을 잡을 수 없다."}], "general_counters": ["뽀삐", "케인(다르킨 학살자)", "오른", "티모", "하이머딩거", "판테온", "쉔", "가렌"]}
{"champion": "키아나", "aliases": [], "hard_counters": [{"name": "말파이트", "reason": "모든 AD 암살자 챔피언들의 악몽. 키아나는 말파이트가 약하다는 초반에 더 약하기 때문에 말파이트를 말리는 것이 불가능하고 첫 귀환 이후에는 라인전에서는 도저히 답이 없기 때문에 로밍 위주로 게임을 풀어나가야만 한다. 그마저도 말파이트가 판금 장화와 바미의 불씨를 사온다면 유일한 희망인 로밍조차도 제한되며 말파이트의 한타 기여도 역시 뛰어나기 때문에 한타도 답이 되지 못한다."}, {"name": "다이애나", "reason": "W 때문에 라인전 성립이 안 되는 건 물론 한타 기여도도 키아나 이상으로 우월한지라 초중후반 가리지 않고 전 구간 꽤나 고전하는 상대. 다만 압박 능력 자체는 좀 부족하기 때문에 작정하고 버티면 못 버틸 정도는 아니다. 키아나가 다이애나보다 더 빨리 움직이기 쉽기 때문에 최대한 로밍 위주로 플레이하거나 정복자를 들고 극초반에 승부를 보는 방법으로 상대할 수 있다. 특히 오브젝트 싸움에선 키아나가 다이애나보다 한 수 위이므로 최대한 오브젝트 싸움에서 존재감을 발휘해야 한다. 다이애나가 정글로 포지션이 변경된 이후부터는 맞라인에서 설 일은 거의 없으므로 많이 편해졌다."}], "general_counters": ["가렌", "레넥톤", "이렐리아", "트린다미어", "초가스", "판테온", "야스오", "스웨인", "니코", "흐웨이", "벡스", "리산드라", "마스터 이(정글)", "리신(정글)", "신 짜오(정글)", "킨드레드(정글)"]}
{"champion": "타릭", "aliases": [], "hard_counters": [{"name": "바드", "reason": "우주의 광휘의 무적을 운명의 소용돌이로 상쇄시킬 수 있고, 타릭 자체가 진입하는 챔피언에게 강하지 원거리에서 견제를 하는 유틸형 서포터에게는 매우 취약하기 때문에 바드를 상대로는 아무것도 할 수 없다. 게다가 바드의 로밍 역시 막지 못하며 바드보다 로밍 능력이 뛰어난 것도 아니다. 라인전부터 한타까지 게임 내내 피곤한 상대."}, {"name": "사일러스(미드)", "reason": "근접 챔이지만 타릭의 하드 카운터 중 하나. 사일러스가 바텀에 오는 일은 거의 없지만. 문제는 라인전 이후, 한타에서 만날 때다. 설령 타릭이 겨우겨우 접근하여 E를 건다고 해도, 사일러스는 타릭의 궁을 훔칠 수 있다. 그러다 보니 사일러스가 상대에 있을 경우엔 타릭이 잘못 이니시를 걸었다가, 오히려 타릭의 궁을 훔친 사일러스의 팀에게 역관광을 당하는 판도 흔하게 나온다. 그러다 보니 상대에 사일러스가 나올 경우엔, 우리 팀 조합으로 타릭을 픽하는 것이 맞는지 신중하게 고민해봐야 한다. 만약 한타 조합도 안 되고, 사일러스가 후픽인 경우엔 닷지를 하는 것밖에 답이 없는 최악의 상대. 물론 아군이 뽑으면 특유의 파괴력으로 시너지를 이루기도 하며, 한편으로 진입형 챔프인 사일러스 입장에서도 E로 진입을 차단하는 타릭은 꽤나 까다로운 상대다. 둘 다 서로 팀의 조합을 많이 타는 편."}], "general_counters": ["질리언", "벨코즈", "세나", "자이라", "럭스", "제라스", "카르마", "흐웨이", "소나", "나미", "룰루", "소라카"]}
{"champion": "탈론", "aliases": [], "hard_counters": [{"name": "녹턴", "reason": "탈론 최악의 하드 카운터. 그냥 존재 자체가 탈론을 완전히 잉여로 만들어 버린다. 어둠의 장막(W)이 확정적으로 출혈 1스택을 막아 주기 때문에 궁극기를 배우기 전까지는 패시브를 터뜨릴 수 없는 데다가, E의 공포와 W의 추가 공속, Q의 추가 공격력과 패시브의 회복, 추가 딜로 인해 맞딜 역시 불가능하다. 로밍을 가려고 해도 녹턴의 궁극기에 따라 잡히기 마련. 그렇지만 라인 녹턴이 지속적인 너프를 먹고 거의 못 쓸 수준이 되어 현재는 보기 힘들다."}, {"name": "판테온", "reason": "탈론 장인 시간의 숲도 무조건 밴하라고 한 하드 카운터. 방호의 도약(W)의 타겟팅 기절은 암살을 해야 하는 탈론에게 치명적이며 방패 돌격(E)의 전방 무적과 기본 스탯 때문에 라인전 기습 킬각을 잡는 건 거의 불가능하며, 반대로 판테온의 강력한 맞딜 능력에 본인이 킬각이 잡히는 걸 걱정해야 할 처지이다. 제일 큰 문제는 탈론의 장점인 로밍 능력 또한 판테온의 거대 유성(R)으로 따라잡힌다. 거대 유성(R)은 순간이동기이기 때문에 오히려 탈론보다 빠르게 로밍이 가능하고, 비슷하게 도착했다 하더라도 탈론에게 방호의 도약(W)이 박히고 점사당하면 답이 없는 건 매한가지다. 유일하게 이길 수 있는 타이밍은 판테온이 아직 방패 돌격(E)을 찍지 않은 2레벨에 점화로 깜짝 킬각을 노리는 것뿐인데, 이마저도 판테온이 탈론과의 1렙 딜교에서 극도로 유리하기 때문에 잘 나오지 않는 상황이고, 판테온이 킬각을 의식해 딜교를 위한 방호의 도약(W) 대신 안전하게 방패 돌격(E)을 찍어버리면 그냥 변수 없이 게임 끝날 때까지 지게 된다."}, {"name": "클레드", "reason": "미드 클레드는 항상 통계에 나올 정도로 탈론에게 극상성 중 하나다. 밧줄과 버럭버럭 폭딜을 이용한 강제 딜교는 절대 시야를 보장하기에 6렙 이후에는 궁을 써도 못 벗어난다. Q와 궁을 교환해도 클레드는 10초 후에 똑같은 짓을 반복할 뿐이다. 패시브로 스펙도 좋은 데다가 스칼에서 내리는 순간은 무적이 되기에 어지간해선 클레드를 원콤 내버리기 힘들다. 라인전을 무시하고 로밍을 다니려고 해도 클레드가 궁으로 합류해버릴 수 있기에 이것마저도 통하지 않는다."}, {"name": "사미라(원딜)", "reason": "원거리 딜러임에도 암살자인 탈론을 잡아먹는 역상성. 사미라의 원형 검무(W)가 빠진 후 암살하면 쉬울 것 같지만, 문제는 그것뿐만이 아니다. 암살자가 싫어하는 내구력 아이템인 판금 장화, 불멸의 철갑궁, 피바라기 등은 죄다 올리기 때문이다. 특히 W가 있는 사미라 상대로는 동성장 기준 1대1로 절대 이길 수 없다. 탈론의 주력기를 모두 막아버리면서 높은 생명력 흡수로 탈론의 딜을 상쇄하며, 이어지는 패시브 발동마저 봉인해 버린다. 탈론은 딜은 다소 약하지만 빠른 콤보 속도가 장점인데, 오히려 사미라를 상대할 때의 경우에는 투사체 스킬이 한 번에 막혀버릴 수도 있다는 단점으로 바뀔 수도 있다."}], "general_counters": ["피즈", "아리", "조이", "애니비아", "르블랑", "리산드라", "니코", "아크샨", "벡스", "카시오페아", "이렐리아", "다이애나", "갱플랭크", "레넥톤", "세트", "아트록스", "말파이트", "오른", "사이온", "피들스틱(정글)", "샤코(정글)", "뽀삐(정글)", "마스터 이(정글)"]}
{"champion": "탈리야", "aliases": [], "hard_counters": [], "general_counters": ["제드", "카타리나", "카사딘", "니코", "조이", "카직스", "샤코", "렝가", "마스터 이", "자르반 4세", "문도 박사", "세주아니"]}
{"champion": "탐 켄치", "aliases": ["탐켄치", "켄치"], "hard_counters": [{"name": "하이머딩거", "reason": "탐 켄치는 라인 클리어 능력이 매우 구리지만 압도적인 대인전 능력을 바탕으로 견제나 딜교를 통해 라인 주도권을 잡는 챔피언인데, 하이머딩거를 상대로는 딜교와 견제 둘 다 통하지 않는다. 포탑과 미니언을 끼고 있는 원거리 챔피언인 딩거에게 Q를 맞추기는 매우 어려우며 W를 쓰든 그냥 걸어서 딜교하러 들어가든 매우 느린 탐 켄치가 포탑을 끼고 있는 딩거에게 들어갔다간 그대로 수류탄을 맞고 일방적으로 쳐맞기만 한다. 견제와 딜교가 통하지 않기 때문에 탐 켄치의 장점인 대인전 능력을 발휘할 수가 없으며 오히려 라인 클리어가 부실하다는 단점만 부각되어 계속해서 압박을 당해야만 한다."}, {"name": "릴리아", "reason": "패시브의 퍼댐과 유지력으로 인해 릴리아가 탐 켄치에게 라인전이 밀리지는 않으며, 패시브의 이동 속도를 이용하여 무빙만 잘해서 W와 Q를 피하면 탐 켄치를 일방적으로 구타할 수 있다. 체력템이 갖추어지면 Q를 몇 번 맞아서 삼켜져도 Q 한 번만 피하면 바로 역전할 수도 있다. 한타에서도 탐 켄치보다 더 크게 관여할 수 있다는 점 때문인지 생각보다 탐 켄치 상대 승률이 좋은 편."}, {"name": "일라오이", "reason": "6렙이 찍히고 영혼이 끌리면 천하의 탐 켄치가 맞딜을 진다. 그 후로는 일라오이의 스플릿을 막자니 촉수에 찢겨나가고 한타를 열자니 탐 켄치는 한타가 구리다. 6렙 전에 영혼을 통한 불합리한 딜교를 피하고 최대한 압살해 놓는 것만이 상책이다."}, {"name": "문도 박사", "reason": "여러모로 많이 어려운 상대. 6레벨 이전에는 탐 켄치의 유일한 CC기인 심연 잠수(W)의 에어본을 씹는데다 무식한 퍼댐을 자랑하는 뼈톱을 4초마다 계속 날려대기 때문에 피 관리가 어렵다. 덩치가 꽤나 큰 탐 켄치 특성상 뼈톱에 쉽게 맞는 것은 덤. 6레벨 이후라고 해도 여전히 어려운 게 문도 박사의 궁극기 또한 탐 켄치의 딜을 상쇄시키기 좋고 더군다나 심지어는 그 집어삼키기마저도 문도의 패시브에 완벽히 카운터 당한다. 더 결정적인 것은 문도 박사는 후반 영향력과 캐리력이 탑 챔피언 중 사실상 최상위권에 들어가는 챔피언이기 때문에 안 그래도 라인전에서 찍어 눌러야 하는 탐 켄치가 라인전에서 이기지도 못하는 것은 물론이거니와 반반을 간다는 거 자체가 매우 손해인데, 후반 캐리력도 넘사벽급으로 차이가 나기 때문에 실질적으로 두 티어 이상 차이가 나지 않는 이상 밴을 하거나 닷지하는 게 정신건강에 이로울 정도로 챔피언 설계 자체가 극악으로 불리할 수밖에 없다. 그래도 불행 중 다행인 거는 혀 채찍으로 문도에게 쥐약인 둔화는 계속 먹일 수 있다는 것."}, {"name": "유틸형 원거리 서포터(서폿)", "reason": "바텀 2:2에서는 탐 켄치의 막강한 근접전 능력을 발휘하는 상황이 제한적이다. 라인 푸시나 견제 등 여러 면에서 밀리고 시작하기 쉽다."}], "general_counters": ["클레드", "베인", "워윅", "가렌", "다리우스", "아트록스", "볼리베어", "쉔", "사일러스", "신지드", "케넨", "모데카이저"]}
{"champion": "트런들", "aliases": [], "hard_counters": [{"name": "잭스", "reason": "라인전과 후반 밸류 모두 밀리는 하드 카운터. 가급적이면 고정 밴을 권장한다. 반격으로 트런들의 주 딜인 평타와 깨물기를 원천 봉쇄하는 것이 가능하며, 특히 깨물기는 적의 공격력을 낮추고 트런들 자신의 공격력을 올리는, 트런들의 딜링의 주요 수단인데 이걸 잭스가 회피하는 순간 트런들은 잭스와의 맞딜에서 이길 수 없다. 대미지도 AD와 AP 하이브리드 형식으로 우겨넣기 때문에 트런들이 대처하기가 힘들다. 또한, 트런들의 강점인 얼음 기둥을 통한 갱킹 또는 갱 호응으로 잡아내려고 해도 도약으로 회피하기 때문에 그러기도 쉽지가 않다. 잭스와의 교전을 피하고 트런들의 특장점인 후반 사이드 운영으로 이득을 보려고 해도, 역시 한 사이드하는 잭스와 후반으로 가며 템이 뽑히면 뽑힐수록 트런들보다 잭스가 더 강해지기에 트런들의 강점을 모두 원천 봉쇄할 수 있는 픽이다. 다만 한타 때 궁극기를 써서 뻥튀기된 잭스의 방마저를 진압으로 도로 빼앗아 물몸 수준으로 만드는 건 호재. 사이드는 어차피 지니 한타를 유도해 잭스를 마킹하는 것도 좋은 방법이다."}, {"name": "그레이브즈 및 킨드레드(정글)", "reason": "둘 다 이동기로 카이팅이 가능하고, 벽을 넘어다닐 수 있으며, 필요하면 싸움을 피하면서 성장할 수도 있고, 전투력도 강하다. 특히 그브의 연막탄은 트런들을 쉽게 무력화하며 킨드의 궁도 진입해서 싸우는 트런들 입장에서 심히 거슬린다. 그브가 아예 핵심 룬으로 난입을 들고 오면 트런들은 접근이 힘들며 킨드레드의 E를 위시한 폭딜은 아무리 트런들일지라도 버티기 힘들다. 실제로도 대회에서는 트런들의 카운터로 그레이브즈 및 킨드레드를 상당히 자주 기용하는 모습을 보여주고 있다. 다만 트런들도 난입 룬이 연구되면서 대응책이 있기도 하며 한타 구도에서 트런들이 얼마나 든든하게 버텨주느냐에 따라 게임을 이길 수도 있고 질 수도 있다."}, {"name": "니달리(정글)", "reason": "역시 트런들의 대표적인 카운터로 꼽히는 정글러. 첫 귀환 전에 사고를 당하지 않는다면 그때부터 압도적인 정글링 스피드와 기동력으로 정글몹을 다 털어먹고 성장 차이를 미친 듯이 벌릴 수가 있다."}], "general_counters": ["블라디미르", "갱플랭크", "케일", "그라가스", "요릭", "볼리베어", "레넥톤", "아트록스", "워윅", "아칼리", "티모", "나서스"]}
{"champion": "트리스타나", "aliases": ["트타", "트리"], "hard_counters": [{"name": "드레이븐", "reason": "만나면 닷지도 고려해야 할 정도로 최악의 상대. 원딜 중에서 거의 유일하게 능동적으로 트리스타나의 로켓 점프를 끊을 수 있는데다 맞딜도 트리스타나보다 월등히 세다. 드레이븐의 E 스킬은 준즉발 광역 밀치기+둔화이기 때문에 선딜이 긴 앞점프는 끊기기 매우 쉽다. 설상가상으로 드레이븐은 타 원딜과 비교해 2배의 평타 딜을 자랑하는 정신 나간 평타를 1레벨부터 보유하고 있는 원딜이라, 앞점프가 끊기면 거진 죽은 거나 다름없다. 그렇다고 점프를 안 하자니 초반에 사거리도 짧고 견제기도 마땅히 없는 트리스타나는 라인전 맞딜 최강인 드레이븐을 상대로 라인전에서 불리할 수밖에 없고, 역으로 드레이븐이 E 스킬로 강제 딜교를 걸 수도 있다. 그렇다고 혼자 있을 때 암살을 하자니, 앞서 말했듯 드레이븐은 혼자서도 앞점프를 손쉽게 끊어낼 수 있어 섣불리 암살 시도를 했다간 본인이 전광판으로 가버린다."}, {"name": "시비르", "reason": "리워크 전에도 후에도 트리스타나의 스킬셋을 완벽하게 카운터치는 전통의 하드 카운터. 트리스타나의 딜 교환의 핵심인 폭발 화약을 스펠 실드로 너무 쉽게 차단해버리며, 이러면 폭발 화약이 봉쇄되므로 전투가 성립하지 않는다. 심지어 라인을 미는 속도조차 시비르가 월등히 앞서는데, 트리스타나는 포탑을 낀 상태에서 CS를 먹기가 진만큼이나 어려운 원딜이라서 더욱 기를 펴기 어렵다. 어찌저찌 라인전을 버텨낸 이후에는 할 만해지는데, 라인전이 끝난 이후엔 방관 빌드든 치명타 빌드든 1대1은 폭발 화약(E)이 스펠 실드에 막히더라도 DPS의 차이로 찍어누르는 게 가능하며 한타 페이즈로 올 경우 방관 시비르는 지속딜로, 치명타 시비르는 사거리 차이로 싸우는 것이 좋다. 다만 치명타 시비르에 경우 막강한 광역 딜링에 앞라인과 같이 쓸려나가지 않도록 해야 한다."}, {"name": "사미라", "reason": "이 분야에서 대표적이며 시비르보다 더한 하드 카운터. 트리스타나 딜교의 핵심이 되는 폭발 화약(E)과 평타를 원형 검무(W)로 막아버린다. 게다가 이쪽도 근접전이 막강해 하드 CC기가 풍부한 그랩이나 돌진형 탱커 서포터와 자주 오기 때문에 트리스타나가 라인전에서 이득을 보기 어렵다. 특히 궁극기가 생기는 6렙 이후에는 안 그래도 중반에 약한 트리스타나인데 존재감 차이가 더욱 극심해진다. 한타에서 사미라의 궁극기에 휘말려 트리스타나나 아군이 아무것도 못하고 죽을 수 있으며, 로켓 점프(W)가 빠진 상황에서 대구경 탄환(R)이 원형 검무(W)에 막히면 그대로 사망이다. 그리고 처치 관여 시 이동기인 거침없는 질주(E)의 쿨이 초기화되기 때문에 로켓 점프(W)로 확실히 따돌린다는 보장도 없다. 무엇보다 궁극기는 스타일 연계만 쌓으면 교전에서 여러 번 쓸 수 있기 때문에 원형 검무(W)에 막히지 않는 비투사체 하드 CC기를 가해줄 아군이 없다면 6렙 이후엔 함부로 접근하지 않는 게 낫다. 그나마 혼자서 공략이 가능한 시비르와 달리 사미라는 무조건 아군의 도움을 받아야 한다."}, {"name": "티모", "reason": "트리스타나 장인들도 인정하는 명실상부한 하드 카운터 중 하나로, 트리스타나의 티모 상대 승률은 44.7%일 정도로 최악의 카운터다. Q 실명 한번에 평타가 딜링인 트리스타나의 공격을 완전히 무력화시키기에 사실상 티모의 실명 스킬이 빠지기 전까지는 섣불리 로켓 점프를 딜교용으로 사용할 수 없다는 것도 악재 중 하나. 그나마 티모는 탑 라인이 주 포지션이라, 미드, 원딜이 주 포지션인 트리와 같은 라인에선 만나는 일은 대체적으로 드물지만, 간혹 트리스타나를 카운터하기 위한 조커픽으로 간간이 바텀, 미드에서도 사용되는 모습을 보인다."}], "general_counters": ["루시안", "케이틀린", "바루스", "닐라", "노틸러스", "쓰레쉬", "렐", "알리스타", "잔나", "뽀삐", "룰루"]}
{"champion": "트린다미어", "aliases": ["트린"], "hard_counters": [{"name": "말파이트", "reason": "높은 방어력과 공속 감소를 달고 있는 지면 강타 때문에 구조상 카운터를 맞는다. 중반 이후 한타 페이즈에서도 말파이트의 한타 영향력이 압도적이기에 트린다미어는 진입 각을 잡기가 힘들다. 다만 착취 빌드가 주류가 된 현재를 기준으로는, 유지력으로 말파이트의 마나를 고갈시키며 착취로 짤딜교를 하거나, 극초반 CS 디나이로 성장 차이를 벌리며 아군 정글과 다이브를 설계한다는 선택지가 존재하기에 예전 수준의 하드 카운터는 아니다."}], "general_counters": ["람머스", "뽀삐", "오른", "나르", "퀸", "케넨", "하이머딩거", "볼리베어", "워윅", "다리우스", "나서스", "잭스", "티모", "쉔", "아칼리", "트런들", "탐 켄치"]}
{"champion": "트위스티드 페이트", "aliases": ["트페", "트위스티드페이트"], "hard_counters": [{"name": "야스오", "reason": "최악의 하드 카운터. 미드 트페 밴대상 1순위. 비단 미드 뿐만 아니라 어느 라인에서 만나든, AD 빌드든 AP 빌드든 최악의 상대다. 다른 암살자는 그래도 초중반에 트페가 우위를 점할 때도 있거나 또는 중반 사이드 단계에서 운영으로 풀어나 가는 등 대처 방안이 있지만 야스오는 그냥 초중후반 싹다 트페가 불리하다. 야스오가 숙련도가 높거나 라인 관리를 잘 하는 유저라면 라인전을 버티는 것이 사실상 불가능한 수준으로 바람 장막에 모든 공 격이 막히기 때문에 견제나 딜교환이 어렵고, 라인전에서는 미니언에 질풍검을 타고 들어오는 야스오에게 대항하기가 매우 어렵다. 그나 마 6레벨 이후 로밍만이 해결책인데 야스오의 높은 푸시력 때문에 로밍으로 이득을 취하지 못했을 경우 점점 성장세가 기울어지게 된다. 설령 반반을 가는 것에 성공했더라도, 무난히 성장한 야스오는 한타 와 스플릿 모두 강력하기에 운영으로 풀어가기도 힘들어지고, 여전히 바람 장막(W)에 막히는 트페의 모든 공격 수단 때문에 골드 카드로 CC기를 걸 수도, 딜을 넣을 수도 없다. 실제로 라인킬 확률, 게임 승률 모두 야스오가 앞선다. 미드 트페를 할 생각이면 반드시 밴하는 것이 여러모로 덜 피곤하고 좋다."}, {"name": "멜", "reason": "하드 카운터까진 아니지만, 어려운 상대. 멜의 반박(W) 스킬은 야스오 의 바람 장막의 상위호환격으로, 바람 장막이 그냥 골카를 막기만 한다면 멜의 반박(W)은 골카를 막음과 동시에 그대로 골카가 반사되어 역으로 트페가 기절에 걸린다. 야스오처럼 매커니즘상 카운터에 해당한다. 따라서 트페의 장점인 갱호응 능력을 완벽히 무마시킬 수 있다는 것이 문제. 그나마 야스오처럼 처음부터 끝까지 트페를 지독하게 압박하지는 못하고 돌진기도 없어서 트페에게 순식간에 접근을 해서 폭딜을 퍼붓는다던가 그런 챔프는 아니라서 라인전이 매우 어렵지는 않다. 푸시력은 트페가 우위에 있기 때문. 물론 멜과의 일대일 상황 에서는 골드 카드가 거의 봉인되기 때문에 대인전은 불리하지만 애초에 트페나 멜이나 둘 다 대인전 위주로 굴리는 챔피언도 아니고 대인전 특화 챔피언도 아니며 심지어 트페는 운영으로 굴리기 때문에 상 황에 따라 반박의 활용성을 무마시킬 수 있다."}], "general_counters": ["갈리오", "아리", "이렐리아", "키아나", "제드", "판테온", "모르가나", "피즈", "사일러스"]}
{"champion": "트위치", "aliases": [], "hard_counters": [{"name": "야스오", "reason": "트위치 최대의 하드 카운터 중 하나. 원딜 카운터 챔피언으로 알려진 야스오답게 트위치도 예외는 아니다. 트위치가 딜각을 잡고 적군에게 무차별 난사를 쏘아대더라도, 야스오가 트위치의 방향으로 W 바람 장막을 한번 펼치는 순간, 사실상 트위치의 무차별 난사는 손쉽게 무력화되어 버린다. 요네, 이렐리아와 마찬가지로 기동성이 우수한 암살자 챔피언에도 속하기에 야스오에게 자칫해서 거리를 내어주는 순간에는 야스오가 비정상이 아닌 이상, 야스오를 마땅히 밀쳐낼 만한 수단이 없는 트위치는 사실상 점멸이  빠진 상태면, 이미 죽은 것이나 다름없는 셈. 이처럼 여러모로 까다 로운 카운터 챔피언 중 하나기에, 한타 시작 전에 야스오의 W 바람  장막을 주의하며 포지션을 잡아야 한다."}], "general_counters": ["칼리스타", "루시안", "코르키", "드레이븐", "케이틀린", "닐라", "노틸러스", "레오나", "렐", "쓰레쉬", "브라움", "알리스타", "탐켄치", "자이라", "카르마", "브랜드", "제라스", "흐웨이"]}
{"champion": "티모", "aliases": [], "hard_counters": [{"name": "아트록스", "reason": "밴 대상 1순위. 리메이크 전 아트록스는 평타 위주 AD 캐리여서 원래 티모가 이기는 상성이었는데, 리메이크 이후에는 스킬 딜러가 되어버려서 역으로 장인들도 꺼리는 카운터로 변경되었다. 견제를 해도 아트록스는 유지력이 좋아서 잘 버티고, 아트록스의 스킬셋의 범위는 티모의 사거리와 엇비슷해서 티모가 견제를 함과 동시에 다르킨의 검을 포함한 스킬 콤보를 모조리 피하는 건 매우 어려운 일이다. 티모가 열심히 카이팅과 무빙을 시도해도 이길까 말까인데 아트록스는 기본적인 유지력도 좋고 노코스트 챔피언이라 스킬을 맞춰도 그만이고 안 맞춰도 그만이라는 식으로 사용해도 이득을 본다. 따라서 상대한다면 난입, 신속의 장화 등으로 자체 이속을 올리는 게 좋다. 한타도 아트록스가 훨씬 좋은 것도 굉장히 까다로운 점. 그나마 럼블 화방처럼 피할 수 없는 게 아니고 아트는 모든 스킬이 논타겟에 거리 재기가 중요하기 때문에 숙련도가 높지 않아서 Q를 제대로 못 맞춘다면 생각보다 티모가 할 만하다. 대회에서도 아트록스 상대로 티모를 후픽했다가 멸망한 사례가 나왔다."}, {"name": "카시오페아", "reason": "밴 대상 2순위. 탑 카시오페아가 주류는 아니지만 미드에서 스왑하는 경우는 빈번하다. 티모가 상대하기 어려운 부류인 긴 사거리와 스킬 난사 능력을 모두 가진 챔피언에 속한다. 우선 마법사이기에 카시오페아에게 실명은 유의미하게 사용되기 힘들고 티모가 평타를 1~2대 칠 때 스킬을 3~4발씩 남발할 수 있다. 티모도 뚜벅이에 속하기 때문에 맹독 폭발을 피하기도 힘든 편. 물론 카시오페아도 물몸이기에 티모가 빈틈을 파고들면서 덤비면 가끔 킬각이 나오기도 하지만 이는 카시오페아의 수많은 스킬을 효과적으로 피해야 한다는 전제가 붙기에 쉽지 않다. 티모는 점화가 있고 카시오페아는 점화가 없는데도 질 수 있는 상성이다."}, {"name": "제이스", "reason": "밴 대상 3순위 꽤 까다로운 상대 중 하나다. 머큐리 캐논 Q-E의 포킹과 머큐리 해머 Q-평-E 콤보를 쿨이 돌아올 때마다 날려서 티모를 실컷 두들겨 패고 자기는 난입으로 도주하니 상대하기 매우 힘들다. 티모가 전혀 못 이기는 상성까지는 아니지만 조건이 많이 필요하다. 우선 Q-E 콤보는 감으로 잘 피해야 하고, 티모가 일방적으로 견제하려고 접근하면 천둥 강타로 밀치고 도망가니 미니언 근처에서 싸워야 한다. 하늘로!(Q)로 티모에게 들어왔을 때 주변 미니언에 의해 버섯이 폭발하면 둔화가 걸려서 제이스가 밀치지 못하게 할 수 있고 티모가 따라가서 견제할 수 있는 찬스가 나온다. 은신을 활용하는 것도 방법 중 하나지만 마냥 쉽지만은 않다. 차라리 사거리가 긴 실명 다트를 선마해서 일방적인 견제라도 하는 게 나을 수 있다. 그래도 1, 2레벨 구간에는 티모가 유리하니 초반에 압박을 잘해놓자. 예전부터 스탯 너프를 받아온 제이스라 이제는 티모가 초반에 제이스 상대로 킬각이 오히려 많이 나오기에 톱날 전에 이득을 봐야 하는 입장이 되었다. 톱날 무난하게 나오면 빡세지기 때문."}, {"name": "올라프", "reason": "2012 시즌부터 이어져 온 전통의 하드 카운터. 실명으로 평타를 막을 수 있지만, 역류와 무모한 강타에는 얄짤없어서 티모 쪽이 먼저 걸레짝이 된다. 게다가 이마저도 궁극기가 생긴 뒤부터는 통하지 않아서 그때는 진짜로 역류 한 대 맞는 순간 별 저항도 못하고 토막 날 수가 있다. 그나마 올라프가 후반에 영향력을 상실하는 점이 위안이지만, 티모가 초반을 못 버티고 터질 가능성이 매우 높다는 것이 문제. 라인전에서 터지지 않는 것이 중요하므로 난입 룬이 추천된다."}, {"name": "아칼리", "reason": "초반에는 티모가 견제력도 아칼리에 비해 좋은 편이고, 아칼리도 유지력이 좋은 편은 아닌 데다가 물몸이라 견제로 이득을 볼 수는 있다. 다만 6레벨부터는 티모가 아칼리 기동성과 평타와 타겟팅 스킬을 무력화시키는 황혼의 장막에 일방적으로 농락당한다는 게 문제다. 무결처형의 사거리 안에 들어오면 물몸인 티모는 얄짤없이 찢기게 되고 무난히 가더라도 한타에서 날뛰는 아칼리를 티모가 억제할 방법도 없다. 웬만해서는 닷지가 편한 상대."}], "general_counters": ["말파이트", "럼블", "사이온", "오른", "케넨", "문도 박사", "자크", "마오카이", "탐 켄치", "세주아니", "요릭", "초가스", "라이즈", "나서스", "카서스", "카르마", "빅토르", "블라디미르", "하이머딩거", "판테온", "야스오"]}
{"champion": "파이크", "aliases": [], "hard_counters": [{"name": "소라카", "reason": "파이크가 싫어하는 것만 모아놓은 하드 카운터. 파이크의 그랩은 채널링이기 때문에 침묵을 맞으면 얄짤없이 끊긴다. 궁극기도 침묵으로도 방해할 수 있지만 힐 역시 파이크의 궁극기를 날려먹는 주요 요인으로 소라카가 멀리 있어도 궁극기로 파이크의 처형을 막을 수 있다. 라인전에서도 파이크는 패시브로 버틸지언정 아군 원딜은 견제에 시달리다 밀려나며 소라카의 Q를 다 피하는 게 아닌 이상 소라카와 상대 원딜은 피가 계속 차서 체력 관리에서 지게 된다."}, {"name": "하이머딩거", "reason": "서포터건 바텀이건 하이머딩거는 파이크뿐만 아니라 블리츠크랭크, 노틸러스, 쓰레쉬 등 그랩류 서포터의 저승사자인데, 그랩류 서포터인 파이크도 당연히 하이머딩거에는 답이 없다. 심지어 모아야 하기 때문에 차징하는 거 보고 포탑 깔면 끝."}, {"name": "사미라", "reason": "야스오와 마찬가지로 Q와 E를 둘 다 막아버리는 원형 검무 탓에 이니시가 봉인되며, 바텀 점유율이 낮은 야스오와 달리 이쪽은 원딜이라 자주 만나기도 하는 최악의 극상성. 준 이동기인 E까지 있어 궁극기를 맞히는 것도 어렵다. 원형 검무를 빼더라도 파이크가 E로 진입했을 때 필연적으로 파이크가 사미라의 뒤에 있기 때문에 사미라가 그냥 파이크한테 E를 타버리면 기절을 걸 수 없다."}], "general_counters": ["모르가나", "샤코", "레나타 글라스크", "노틸러스", "레오나", "브라움", "알리스타", "마오카이", "이즈리얼", "자야", "시비르", "베인", "트리스타나"]}
{"champion": "판테온", "aliases": ["판테"], "hard_counters": [{"name": "말파이트", "reason": "견제력도 판테온과 맞먹으며, 맞딜 능력도 강력하다. 라인전 단계에서부터 판테온과 맞설 수 있는데 아이템이 뜨면 뜰수록 AD 챔피언들을 상대로 막강한 탱킹력을 자랑하는 말파이트에게 판테온은 흠집도 내기 힘들다. 한타 영향력도 엄청나기에 여러모로 최악의 상대. 그나마 초반에는 판테온이 유리하니 최대한 따놔야 한다. 유리한 초반에 어떻게든 말려놓으면 그만큼 말파이트가 한타에 크게 기여하는 시점은 늦춰지고 그 시간 동안 로밍을 다니면 손해를 최소화할 수 있다."}, {"name": "우르곳", "reason": "절대 못 이긴다. 이쪽은 말파이트보다도 심한데 초반부터 강하며, 평타로 인한 유지력, 원거리, 탱커라는 판테온이 싫어할 만한 것들만 모조리 모아두었다. 정글이 계속 와도 우르곳이 발로 하는 것이 아닌 이상 절대 못 이긴다. 밴을 안 했는데 나왔다면 그냥 닷지하는 것이 본인과 아군들의 정신건강에 도움이 된다."}, {"name": "올라프", "reason": "극상성. 올라프는 전통적인 1레벨 강자 중에 한 명이고, 리워크되어 초반이 약간 약해진 지금에도 올라프가 판테온은 이길 수 있다. 3레벨부터는 올라프의 도끼를 맞는 순간 방패 돌격이 확정적으로 빠지게 되고, 템과 궁극기가 갖춰진 6레벨부터는 판테온이 방호의 도약을 쓰는 순간 죽는다. 라인전에서 말린 판테온은 로밍을 선택하겠지만, 포탑을 잘 부수는 올라프 입장에서는 골드를 잔뜩 뜯어낼 기회가 되어버린다."}, {"name": "흐웨이", "reason": "사거리에서 압도됨은 물론 판테온의 돌진이 흐웨이의 공포에 끊기기 때문에 개활지에서는 단 한 대도 때릴 수가 없는 극카운터. 아리의 매혹과는 다르게 돌진을 끊는 데에 실패해도 일단 공포에 맞으면 멀어지기 때문에 아리보다 붙기 훨씬 힘들다."}, {"name": "애니비아", "reason": "최악의 하드 카운터. 메이지 중에서도 판테온 최악의 상대. 애초에 애니비아는 미드 메이지 중에서 팔이 긴 편은 아니나, 대신 이동기가 적고 굼뜬 뚜벅이들을 영원히 괴롭힐 수 있는 스킬셋을 갖고 있다. 광역 슬로우, 광역 투사체 기절, 둔화한 상대에게 추가 피해, 강제로 지형을 바꾸는 스킬 등 판테온 입장에선 부당하게 느껴질 만한 스킬셋만 골라 가진 셈이다. 6레벨 전에는 판테온에게도 기회가 있고, 6레벨 전 애니비아는 라인 클리어가 그닥 좋지 않다는 점을 이용해 쿨타임이 짧은 혜성의 창으로 라인을 밀고 정글 교전에 합류를 한다든지 이득을 볼 수 있으나 진짜 지옥은 6레벨이 찍히는 순간이다. 6레벨이 찍히는 순간 애니비아는 궁극기를 이용해서 라인을 하이패스로 지우고 판테온을 돌아다니지 못하게 라인에 묶어두기 시작한다. 판테온이 라인전을 박살 내고 굴리기 시작한다 한들, 애니비아 특유의 수성 능력이 발목을 잡는다. 애니비아가 궁극기로 라인을 지워 수성을 하기 시작하면 점점 게임은 중후반으로 넘어가게 되고, 그렇게 되면 속이 타는 쪽은 판테온이다. 후반 한타에서도 애니비아의 벽 생성과 광역 장판, 광역 기절이 가진 한타력은 판테온보다 월등하다."}], "general_counters": ["마오카이", "모데카이저", "초가스", "오른", "워윅", "탐 켄치", "람머스", "볼리베어", "우디르", "그라가스", "세주아니", "일라오이", "스카너", "다이애나", "빅토르", "벡스", "아리", "탈리야", "말자하", "제라스", "블라디미르", "하이머딩거", "스웨인", "조이", "타릭", "브라움", "알리스타", "피들스틱", "레오나", "쓰레쉬", "케이틀린", "베이가", "시비르", "샤코", "노틸러스", "렐", "룰루", "밀리오", "럭스", "뽀삐"]}
{"champion": "피들스틱", "aliases": ["피들"], "hard_counters": [{"name": "알리스타(서폿)", "reason": "피들스틱이 궁극기로 나타나도 박치기로 멀리 보내버리면 그만이며, 기습 궁극기로 공포를 걸었다고 해도 꺾을 수 없는 의지로 공포를 풀어버릴 수 있고 원체 수준급으로 튼튼한데 궁극기까지 킨 알리스타에게는 딜이고 뭐고 씨알도 안 박히는 기가 막히는 장면을 보게 된다. 게다가 생존기가 부실한 피들스틱은 알리스타의 쿵쾅 콤보에 쉽게 위협을 받을 수 있어서 밑에 풍작을 끊기 쉬운 챔피언에도 속한다. 서포터로서 시야 장악까지 수준급이라면 올라프 수준의 카운터로 여겨진다."}, {"name": "마오카이(서폿)", "reason": "서폿 한정 밴 0순위. 리메이크 전이든 후든 최악의 하드 카운터로, 그놈의 묘목이 피들스틱을 게임 내내 성가시게 한다. 애써 기습/궁극기 각을 재놔도 마오카이가 심드렁하게 묘목을 던지면 바로 피들스틱의 위치가 발각되어서 궁극기 대박을 노리기가 힘들고 마오카이의 뛰어난 추격전 성능 때문에 물리면 떨쳐내기도 어렵다. 허수아비를 통한 적절한 트릭 플레이만이 살 길이다. 서포터로 만나면 오히려 수풀에 숨어서 플레이하기가 더 힘들어지기에 절대 극상성."}, {"name": "제라스(서폿)", "reason": "서폿 한정으로 최악의 카운터로, 사거리가 상당히 긴 것은 물론, 미니언에 막히지 않는 범위형 즉발 포킹은 상대하기 힘든 정도가 아니라 아예 낙동강 오리알 신세로 만들어 버린다. 피들이 수풀에 숨어봤자 있을 만한 곳이 바텀 라인 근처에 있는 수풀뿐이라는 걸 누구나 알기 때문에 수풀 속에 숨어서 수확(E), 까마귀 폭풍(R)을 쓰기도 어려우며, 풍작 또한 미니언에 막히지 않는 포킹 스킬을 보유한 제라스 상대로는 맘대로 쓰기 힘들다. 악운으로 수풀 속에서 비전 구체(E)를 맞기라도 한다면 이어지는 Q, W도 연달아 맞아서 딜교에 상당한 손해를 보게 된다."}, {"name": "올라프(정글)", "reason": "딜교가 전혀 성립되지 않기 때문에 뒤도 돌아보지 말고 도망치는 것이 상책이다. 노플일 때 날아오는 도끼는 사형 선고나 다름없으니 무조건 피해야 한다. 6레벨 이후로는 피들스틱의 모든 군중 제어기를 무시하는 라그나로크 때문에 더욱 답이 없는 상대. 최대한 버티면서 후반 한타를 기약하자. 후반을 가면 고기방패 역할의 올라프는 체력 포션일 뿐이다. 다만 초반이 워낙 고되기에 피들스틱 장인들도 닷지를 권하는 카운터 챔피언."}], "general_counters": ["잔나", "벨코즈", "문도 박사(정글)"]}
{"champion": "피오라", "aliases": [], "hard_counters": [{"name": "워윅", "reason": "그냥 못 이기는 상대. 스킬셋부터 피오라를 카운터 치기 좋게 짜여있다. 피오라가 Q로 짤짤이를 넣으러 들이미는 순간 워윅도 맞Q로 깨물 테고 그렇게 딜교를 발린다. 응수가 공포와 제압을 막을 순 있으나 이것도 워윅이 공포는 심리전, 또는 막혔을 시 꾹Q로 기절을 피할 수 있고 제압은 붙어서 애매한 타이밍에 누르면 응수도 못 해보고 킬을 헌납당할 수 있다. 어찌저찌 딸피로 만들어도 미니언만 있다면 특유의 기괴한 피흡으로 다시 정상화시키고 최체비 고뎀으로 죽이려 해도 대부분 방어막을 들고 와 딜을 씹어버릴 수 있기에 여간 어려운 게 아니다. 티어가 높지 않고 딱히 밴할 게 없다면 추천한다. 저티어는 만날 시 그냥 닷지를 하는 게 낫다."}, {"name": "뽀삐", "reason": "하드 카운터. E가 타겟팅+준 즉발이기에 예측이나 일부러 각을 내주고 낚시를 시도하는 것이 아니라면 반응할 수가 없고, 단순 뽀삐만 이동하는 게 아닌 적을 에어본 형태로 밀어내는 방식이라서 뽀삐가 피오라를 밀기 직전에 응수로 반응하지 않는 한 절대 막아낼 수 없다. 그대로 벽에 박히면 사실상 끔살 확정. 이동기를 차단하는 그놈의 W 때문에 딜교를 어영부영 넘겨도 뽀삐가 이긴다. 벽에 두어 번 쳐박히면 그대로 다이브로 이어지는 수준. 라인전도 미칠 듯이 빡세지만 사이드 구도에서도 피오라가 반격이 가능해진 것을 제외하면 불리한 심리전은 그대로이기에 뚫기가 굉장히 힘들고, 대부분의 경우 뽀삐가 성장이 우세하므로 동성장이라는 전제 자체가 성립하기 어렵다."}, {"name": "말파이트", "reason": "체력 비례 고정 피해가 있어서 유리할 것처럼 보이지만 그건 공격력을 충분히 갖추는 후반 얘기고, 추가 방어력과 체력 비례 실드를 항시 가지는 말파이트는 피오라의 첫 번째 전성기인 2코어 타이밍에서도 잡기 어렵다. 거기다 피오라는 평타 기반 챔피언이기 때문에 지면 강타를 맞으면 엄청나게 딜로스가 발생할 수밖에 없다. 응수로 지면 강타를 운 좋게 막아도 뚫리지만 않으면 되는 말파이트 입장에선 Q 쏘고 그대로 튀면 되며, 지면 강타의 쿨타임이 긴 것도 아니고 애초에 막는 것 자체가 예측의 영역이라 결국은 공속 감소를 피할 수 없다. 이렇게 피오라의 모든 공격 수단을 무의미하게 만들기 때문에 라인전 내내 초코파이만 실컷 강제급여 당하는데 이걸 참아도 지고 못 참으면 1데스 적립하는 극상성이다. 후반부에도 말파이트가 궁극기로 이니시를 걸면 피오라 본인은 응수로 간단히 막을 수 있을지 몰라도 그 사이에 팀원들이 녹아내린다. 거기에 한타 기여도가 최악이어서 스플릿 운영이 강제되는 피오라에게 이니시계의 끝판왕급 궁을 보유한 말파이트는 운영 쪽으로 봐도 좋지 않다."}], "general_counters": ["오공", "다리우스", "레넥톤", "세트", "탐 켄치", "가렌", "판테온", "트런들", "렝가", "볼리베어", "케일", "라이즈", "럼블", "베인", "케넨", "퀸", "하이머딩거", "드레이븐", "루시안", "칼리스타", "티모", "카시오페아", "나서스"]}
{"champion": "피즈", "aliases": [], "hard_counters": [{"name": "레넥톤", "reason": "닷지를 고려할 수준의 카운터. 기본 스펙이 월등히 차이 나 피 교환이 불리하며, 딜교에 성공해도 Q로 체력을 회복하고, 콤보의 시작이 타겟팅 스턴이라 회피도 불가능하다. 6렙이 되어 궁극기를 적중시켜도 레넥톤이 풀피에서 원콤 날 리도 없으며, 서로 궁극기가 없다면 레넥톤이 훨씬 유리하다. 다만 중반을 넘어가면 1대1은 지더라도 피즈의 변수가 훨씬 많기 때문에 궁극기와 E의 어그로 핑퐁을 바탕으로 승부를 보는 게 좋다. 반대로, 우리 팀 조합이 근접 개싸움 조합일 경우는 힘싸움에서 밀리므로 최대한 잘라먹기 위주로 가는 게 좋다."}, {"name": "판테온", "reason": "판테온의 방호의 도약(W)은 거리가 좀 되면 모션을 보고 재간둥이(E)로 흘려보낼 수 있지만 초근접한 상태라면 반응이 거의 불가능해 거리 조절은 필수다. 오히려 W가 아니라 Q를 씹는다는 생각으로 플레이하는 게 더 좋다. Q를 씹으면 판테온은 E를 빼지 않으면 반반 딜교가 되기 때문에 그나마 대응이 가능하다. 하지만 궁극기는 방패 돌격(E) 때문에 선공권이 없고, 판테온의 로밍을 막을 방법도 전무하며 후반을 가도 피즈가 판테온보다 유리할 구석은 별로 없어 매우 불리하다."}], "general_counters": ["세트", "나서스", "카사딘", "클레드", "아크샨", "갈리오", "리산드라", "말자하", "아칼리"]}
{"champion": "하이머딩거", "aliases": ["하딩", "딩거", "하이머"], "hard_counters": [{"name": "아지르", "reason": "하이머딩거와 마찬가지로 소환수를 소환하여 딜을 하는 챔피언인데 문제는 아지르의 소환수인 모래 병사들은 타겟팅 지정 불가 + 무적이다. 게다가 미드 메이지 챔피언 중에서 사거리까지 긴 편이라서 하이머딩거의 견제에 고통받을 일도 없다. 즉 똑같이 소환수를 소환하면 아지르는 하이머딩거의 사거리 밖에서 편안하게 모래 병사로 하이머딩거의 포탑들을 다 치울 수 있는 반면 하이머딩거는 아지르의 모래 병사를 처리할 방법이 전무하다. 때문에 극초반 푸시력부터 상대가 안 되며 템이 나오면 나올수록 모래 병사의 딜이 더 강해지기 때문에 포탑이 치워지는 속도 역시 더 빨라진다. 그나마 아지르의 마나 소모량이 커서 함부로 스킬들을 남발하지는 못하는 점이 있기는 하지만 이마저도 사실 아지르가 쓸데없이 스킬을 하이머딩거에게 꽂아넣지 않고 모래 병사로 하이머딩거의 포탑 치우기에만 집중하면 딱히 마나 소모량으로 고통받지도 않는다. 성장성도 아지르가 월등하게 높기 때문에 굉장히 골치 아픈 존재."}, {"name": "진(원딜)", "reason": "상대 승률 20%에 이르는 바텀 하이머딩거 최악의 하드 카운터. 만나면 그냥 닷지하는 것을 추천한다. 진의 특성상 원거리에서 춤추는 유탄(Q)이나 살상연희(W)로 포킹하는 것이 대다수인데 하이머딩거는 근중거리에서 포탑으로 지속 딜을 넣는 챔피언이기에 진이 장거리에서 포탑을 부수기도 좋고 생존력이 떨어지는 하이머딩거는 6레벨 이후 W의 속박-커튼 콜(R) 연계 시 그냥 죽는다고 봐야 할 수준이다."}], "general_counters": ["제라스", "직스", "바루스", "빅토르", "카서스", "흐웨이", "트위스티드 페이트", "신드라", "아칼리", "제드", "탈론", "야스오", "럼블", "요릭", "사이온"]}
{"champion": "헤카림", "aliases": [], "hard_counters": [], "general_counters": ["볼리베어", "엘리스", "신 짜오", "렉사이", "우디르", "녹턴", "판테온", "트런들", "카직스", "사일러스"]}
{"champion": "흐웨이", "aliases": [], "hard_counters": [{"name": "피즈", "reason": "하드 카운터 1호. 기동성이 높은 피즈는 흐웨이의 스킬들을 재간둥이(E)로 최소 1개 피할 수 있으며, 성게 찌르기(Q)와 재간둥이(E)로 쉽게 거리를 좁히기에 라클에 Q를 사용하기 어렵다. 6레벨 이후에는 궁극기를 포함한 콤보로 딜교 한번만 하면 킬각 주도권이 피즈에게 있으며, 갱 호응도 매우 좋아진다. 상대법은 콩콩이와 공속 룬을 들고 초반 주도권을 이용해 빅 웨이브를 쌓아 유리한 집 타이밍을 잡고, 이를 굴려 CS 차이를 내는 것이다. 웨이브가 쌓이면 점화 대미지를 극복할 수 있는 딜 교환 구도가 나오고, 피즈 입장에서 로밍을 가면 큰 손해인 웨이브가 된다. 주의점으로, 다른 메이지 상대하듯 먼저 스킬을 빼다간 스킬을 맞히고도 죽을 수 있으니 신중한 거리 조절이 필요하다. 딜교환 시 먼저 녹일 각이 나오지 않으면 WE보다는 WW를 안전한 위치에 깔아 접근을 거부하는 방식으로 하는 것이 좋다. 모든 구간에서 재간둥이의 쿨타임보다 Q의 쿨타임이 짧으니, 이 점 명심하자. 물론 이는 흐웨이가 실수를 전혀 안 할 경우이고, 실전에서는 들어온 피즈 잡아먹으려다 상대 갱이어서 역으로 맞아죽는 경우가 훨씬 빈번하니 시야가 완벽하지 않다면 무리하지는 말자."}, {"name": "카타리나", "reason": "하드 카운터 2호. 피즈보다 더 어렵다. 흐웨이는 돌진을 차단하는 능력이 좋은 대신 이미 근접한 상대에겐 약한데 카타리나의 순보는 순간이동 판정이라 저지가 불가능하다. 또한 피즈와 달리 카타리나의 순보는 단검 근처의 원하는 위치를 지정하는 방식이라 예측도 어렵다. 피즈는 E가 단발성이라 서로 교환 구도를 만들어낼 수 있지만, 카타리나는 단검을 주우면 E를 추가로 사용하기에 E 빠졌다고 라클에 Q를 쓰거나 거리 줬다가 카타리나가 도란 검 들고 평타만 쳐도 딜교에서 손해를 볼 확률이 높다. 장인들도 까다로워할 정도의 하드 카운터이니 밴이나 닷지를 추천한다."}, {"name": "야스오", "reason": "하드 카운터 3호. 모든 투사체 챔피언들의 스트레스 유발 1위인 바람 장막(W)에 사실상 모든 스킬이 막히며 기껏해야 QW, EE 정도만 편하게 사용 가능해 라인전이 매우 괴롭다. 암울한 형상(EQ), 절망의 소용돌이(R)가 장막에 소멸되면 흐웨이가 영향력을 행사하기 힘들어지며 질풍검(E)으로 미니언을 끼고 딜교를 하거나 회피를 하면 스킬 시전이 굼뜬 흐웨이로는 대처하기가 상당히 곤란한 것은 덤. 다행히 바람 장막은 가장 마지막에 마스터하는 스킬이고, 갈수록 푸시 주도권은 흐웨이에게 넘어오는 매치업이므로 라인을 쌓아 안전하게 WE, QE를 이용해 라인을 밀면서 킬을 주지 않고 로밍으로 게임을 풀어나가면 된다. 오히려 야스오 쪽에서 장막을 EQ를 막는 데 혈안이 되어 있으면 안 그래도 맞히기 쉬운 EE를 맞히기 더 쉬워지므로 정글러를 불러 킬을 딸 수도 있고 정글러가 이동 불가 CC를 보유하고 있다면 야스오 입장에서 막을 수도 없는 QW의 추가 피해로 역으로 터트려 버릴 수도 있다. 추가적으로, 라인을 밀 때 QE를 아군 미니언을 거치는 궤적으로 깔아야 한다. 진입하기만 하면 패시브가 벗겨지는 환경을 만들어야 야스오에게도 부담이 되기 때문."}], "general_counters": ["르블랑", "제드", "나피리", "아리", "조이", "제라스", "빅토르"]}